<?xml version="1.0"?>
<CastXML format="1.1.5">

  <Struct id="_1138" name="CThostFtdcDepartmentUserField" context="_1" location="f2:9471" file="f2" line="9471" members="_6454 _6455 _6456 _6457 _6458 _6459 _6460 _6461" size="328" align="8"/>
  <Struct id="_1139" name="CThostFtdcQueryFreqField" context="_1" location="f2:9484" file="f2" line="9484" members="_6462 _6463 _6464 _6465 _6466" size="32" align="32"/>
  <Class id="_1140" name="CThostFtdcMdSpi" context="_1" location="f3:29" file="f3" line="29" members="_6467 _6468 _6469 _6470 _6471 _6472 _6473 _6474 _6475 _6476 _6477 _6478 _6479 _6480 _6481 _6482" size="64" align="64"/>
  <Class id="_1141" name="CThostFtdcMdApi" context="_1" location="f3:77" file="f3" line="77" abstract="1" members="_6483 _6484 _6485 _6486 _6487 _6488 _6489 _6490 _6491 _6492 _6493 _6494 _6495 _6496 _6497 _6498 _6499 _6500 _6501 _6502" size="64" align="64"/>
  <Class id="_1142" name="CThostFtdcTraderSpi" context="_1" location="f4:29" file="f4" line="29" members="_6503 _6504 _6505 _6506 _6507 _6508 _6509 _6510 _6511 _6512 _6513 _6514 _6515 _6516 _6517 _6518 _6519 _6520 _6521 _6522 _6523 _6524 _6525 _6526 _6527 _6528 _6529 _6530 _6531 _6532 _6533 _6534 _6535 _6536 _6537 _6538 _6539 _6540 _6541 _6542 _6543 _6544 _6545 _6546 _6547 _6548 _6549 _6550 _6551 _6552 _6553 _6554 _6555 _6556 _6557 _6558 _6559 _6560 _6561 _6562 _6563 _6564 _6565 _6566 _6567 _6568 _6569 _6570 _6571 _6572 _6573 _6574 _6575 _6576 _6577 _6578 _6579 _6580 _6581 _6582 _6583 _6584 _6585 _6586 _6587 _6588 _6589 _6590 _6591 _6592 _6593 _6594 _6595 _6596 _6597 _6598 _6599 _6600 _6601 _6602 _6603 _6604 _6605 _6606 _6607 _6608 _6609 _6610 _6611 _6612 _6613 _6614 _6615 _6616 _6617 _6618 _6619 _6620 _6621 _6622 _6623 _6624 _6625 _6626 _6627 _6628 _6629 _6630 _6631" size="64" align="64"/>
  <Class id="_1143" name="CThostFtdcTraderApi" context="_1" location="f4:416" file="f4" line="416" abstract="1" members="_6632 _6633 _6634 _6635 _6636 _6637 _6638 _6639 _6640 _6641 _6642 _6643 _6644 _6645 _6646 _6647 _6648 _6649 _6650 _6651 _6652 _6653 _6654 _6655 _6656 _6657 _6658 _6659 _6660 _6661 _6662 _6663 _6664 _6665 _6666 _6667 _6668 _6669 _6670 _6671 _6672 _6673 _6674 _6675 _6676 _6677 _6678 _6679 _6680 _6681 _6682 _6683 _6684 _6685 _6686 _6687 _6688 _6689 _6690 _6691 _6692 _6693 _6694 _6695 _6696 _6697 _6698 _6699 _6700 _6701 _6702 _6703 _6704 _6705 _6706 _6707 _6708 _6709 _6710 _6711 _6712 _6713 _6714 _6715 _6716 _6717 _6718 _6719 _6720 _6721 _6722 _6723 _6724 _6725 _6726 _6727 _6728 _6729 _6730 _6731" size="64" align="64"/>
  <Function id="_1144" name="__builtin_memcpy" returns="_6732" context="_1" location="f2:29" file="f2" line="29" extern="1" artificial="1" mangled="_Z16__builtin_memcpy">
    <Argument type="_6732"/>
    <Argument type="_6733"/>
    <Argument type="_6734"/>
  </Function>
  <FundamentalType id="_1145" name="__int128" size="128" align="128"/>
  <FundamentalType id="_1146" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_1147" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_6735 _6736 _6737 _6738" size="256" align="64"/>
  <PointerType id="_1148" type="_1160" size="64" align="64"/>
  <ArrayType id="_1149" min="0" max="0" type="_6739"/>
  <ArrayType id="_1150" min="0" max="20" type="_1160"/>
  <ArrayType id="_1151" min="0" max="12" type="_1160"/>
  <ArrayType id="_1152" min="0" max="10" type="_1160"/>
  <ArrayType id="_1153" min="0" max="8" type="_1160"/>
  <ArrayType id="_1154" min="0" max="80" type="_1160"/>
  <ArrayType id="_1155" min="0" max="30" type="_1160"/>
  <ArrayType id="_1156" min="0" max="15" type="_1160"/>
  <ArrayType id="_1157" min="0" max="40" type="_1160"/>
  <ArrayType id="_1158" min="0" max="60" type="_1160"/>
  <ArrayType id="_1159" min="0" max="1" type="_1160"/>
  <FundamentalType id="_1160" name="char" size="8" align="8"/>
  <ArrayType id="_1161" min="0" max="64" type="_1160"/>
  <FundamentalType id="_1162" name="int" size="32" align="32"/>
  <ArrayType id="_1163" min="0" max="14" type="_1160"/>
  <ArrayType id="_1164" min="0" max="50" type="_1160"/>
  <ArrayType id="_1165" min="0" max="2048" type="_1160"/>
  <ArrayType id="_1166" min="0" max="500" type="_1160"/>
  <FundamentalType id="_1167" name="double" size="64" align="64"/>
  <ArrayType id="_1168" min="0" max="4" type="_1160"/>
  <FundamentalType id="_1169" name="short int" size="16" align="16"/>
  <ArrayType id="_1170" min="0" max="100" type="_1160"/>
  <ArrayType id="_1171" min="0" max="6" type="_1160"/>
  <ArrayType id="_1172" min="0" max="160" type="_1160"/>
  <ArrayType id="_1173" min="0" max="32" type="_1160"/>
  <ArrayType id="_1174" min="0" max="255" type="_1160"/>
  <ArrayType id="_1175" min="0" max="256" type="_1160"/>
  <ArrayType id="_1176" min="0" max="3" type="_1160"/>
  <ArrayType id="_1177" min="0" max="1024" type="_1160"/>
  <ArrayType id="_1178" min="0" max="24" type="_1160"/>
  <ArrayType id="_1179" min="0" max="400" type="_1160"/>
  <ArrayType id="_1180" min="0" max="16" type="_1160"/>
  <ArrayType id="_1181" min="0" max="2" type="_1160"/>
  <ArrayType id="_1182" min="0" max="21" type="_1160"/>
  <ArrayType id="_1183" min="0" max="128" type="_1160"/>
  <ArrayType id="_1184" min="0" max="19" type="_1160"/>
  <ArrayType id="_1185" min="0" max="1000" type="_1160"/>
  <ArrayType id="_1186" min="0" max="5" type="_1160"/>
  <ArrayType id="_1187" min="0" max="9" type="_1160"/>
  <ArrayType id="_1188" min="0" max="35" type="_1160"/>
  <ArrayType id="_1189" min="0" max="70" type="_1160"/>
  <ArrayType id="_1190" min="0" max="11" type="_1160"/>
  <ArrayType id="_1191" min="0" max="200" type="_1160"/>
  <ArrayType id="_1192" min="0" max="23" type="_1160"/>
  <ArrayType id="_1193" min="0" max="512" type="_1160"/>
  <ArrayType id="_1194" min="0" max="22" type="_1160"/>
  <ArrayType id="_1195" min="0" max="272" type="_1160"/>
  <ArrayType id="_1196" min="0" max="260" type="_1160"/>
  <ArrayType id="_1197" min="0" max="364" type="_1160"/>
  <ArrayType id="_1198" min="0" max="348" type="_1160"/>
  <ArrayType id="_1199" min="0" max="2560" type="_1160"/>
  <ArrayType id="_1200" min="0" max="300" type="_1160"/>
  <ArrayType id="_1201" min="0" max="99" type="_1160"/>
  <Field id="_1202" name="SequenceSeries" type="_115" context="_787" access="public" location="f2:23" file="f2" line="23" offset="0"/>
  <Field id="_1203" name="SequenceNo" type="_100" context="_787" access="public" location="f2:25" file="f2" line="25" offset="32"/>
  <Constructor id="_1204" name="CThostFtdcDisseminationField" context="_787" access="public" location="f2:20" file="f2" line="20" inline="1" artificial="1"/>
  <Constructor id="_1205" name="CThostFtdcDisseminationField" context="_787" access="public" location="f2:20" file="f2" line="20" inline="1" artificial="1">
    <Argument type="_6740" location="f2:20" file="f2" line="20"/>
  </Constructor>
  <OperatorMethod id="_1206" name="=" returns="_6741" context="_787" access="public" location="f2:20" file="f2" line="20" inline="1" artificial="1" mangled="_ZN28CThostFtdcDisseminationFieldaSERKS_">
    <Argument type="_6740" location="f2:20" file="f2" line="20"/>
  </OperatorMethod>
  <Destructor id="_1207" name="CThostFtdcDisseminationField" context="_787" access="public" location="f2:20" file="f2" line="20" inline="1" artificial="1"/>
  <Field id="_1208" name="TradingDay" type="_30" context="_788" access="public" location="f2:32" file="f2" line="32" offset="0"/>
  <Field id="_1209" name="BrokerID" type="_10" context="_788" access="public" location="f2:34" file="f2" line="34" offset="72"/>
  <Field id="_1210" name="UserID" type="_16" context="_788" access="public" location="f2:36" file="f2" line="36" offset="160"/>
  <Field id="_1211" name="Password" type="_17" context="_788" access="public" location="f2:38" file="f2" line="38" offset="288"/>
  <Field id="_1212" name="UserProductInfo" type="_40" context="_788" access="public" location="f2:40" file="f2" line="40" offset="616"/>
  <Field id="_1213" name="InterfaceProductInfo" type="_40" context="_788" access="public" location="f2:42" file="f2" line="42" offset="704"/>
  <Field id="_1214" name="ProtocolInfo" type="_41" context="_788" access="public" location="f2:44" file="f2" line="44" offset="792"/>
  <Field id="_1215" name="MacAddress" type="_27" context="_788" access="public" location="f2:46" file="f2" line="46" offset="880"/>
  <Field id="_1216" name="OneTimePassword" type="_17" context="_788" access="public" location="f2:48" file="f2" line="48" offset="1048"/>
  <Field id="_1217" name="ClientIPAddress" type="_38" context="_788" access="public" location="f2:50" file="f2" line="50" offset="1376"/>
  <Field id="_1218" name="LoginRemark" type="_747" context="_788" access="public" location="f2:52" file="f2" line="52" offset="1504"/>
  <Field id="_1219" name="ClientIPPort" type="_39" context="_788" access="public" location="f2:54" file="f2" line="54" offset="1792"/>
  <Constructor id="_1220" name="CThostFtdcReqUserLoginField" context="_788" access="public" location="f2:29" file="f2" line="29" inline="1" artificial="1"/>
  <Constructor id="_1221" name="CThostFtdcReqUserLoginField" context="_788" access="public" location="f2:29" file="f2" line="29" inline="1" artificial="1">
    <Argument type="_6742" location="f2:29" file="f2" line="29"/>
  </Constructor>
  <OperatorMethod id="_1222" name="=" returns="_6743" context="_788" access="public" location="f2:29" file="f2" line="29" inline="1" artificial="1" mangled="_ZN27CThostFtdcReqUserLoginFieldaSERKS_">
    <Argument type="_6742" location="f2:29" file="f2" line="29"/>
  </OperatorMethod>
  <Destructor id="_1223" name="CThostFtdcReqUserLoginField" context="_788" access="public" location="f2:29" file="f2" line="29" inline="1" artificial="1"/>
  <Field id="_1224" name="TradingDay" type="_30" context="_789" access="public" location="f2:61" file="f2" line="61" offset="0"/>
  <Field id="_1225" name="LoginTime" type="_31" context="_789" access="public" location="f2:63" file="f2" line="63" offset="72"/>
  <Field id="_1226" name="BrokerID" type="_10" context="_789" access="public" location="f2:65" file="f2" line="65" offset="144"/>
  <Field id="_1227" name="UserID" type="_16" context="_789" access="public" location="f2:67" file="f2" line="67" offset="232"/>
  <Field id="_1228" name="SystemName" type="_52" context="_789" access="public" location="f2:69" file="f2" line="69" offset="360"/>
  <Field id="_1229" name="FrontID" type="_98" context="_789" access="public" location="f2:71" file="f2" line="71" offset="704"/>
  <Field id="_1230" name="SessionID" type="_99" context="_789" access="public" location="f2:73" file="f2" line="73" offset="736"/>
  <Field id="_1231" name="MaxOrderRef" type="_14" context="_789" access="public" location="f2:75" file="f2" line="75" offset="768"/>
  <Field id="_1232" name="SHFETime" type="_31" context="_789" access="public" location="f2:77" file="f2" line="77" offset="872"/>
  <Field id="_1233" name="DCETime" type="_31" context="_789" access="public" location="f2:79" file="f2" line="79" offset="944"/>
  <Field id="_1234" name="CZCETime" type="_31" context="_789" access="public" location="f2:81" file="f2" line="81" offset="1016"/>
  <Field id="_1235" name="FFEXTime" type="_31" context="_789" access="public" location="f2:83" file="f2" line="83" offset="1088"/>
  <Field id="_1236" name="INETime" type="_31" context="_789" access="public" location="f2:85" file="f2" line="85" offset="1160"/>
  <Constructor id="_1237" name="CThostFtdcRspUserLoginField" context="_789" access="public" location="f2:58" file="f2" line="58" inline="1" artificial="1"/>
  <Constructor id="_1238" name="CThostFtdcRspUserLoginField" context="_789" access="public" location="f2:58" file="f2" line="58" inline="1" artificial="1">
    <Argument type="_6744" location="f2:58" file="f2" line="58"/>
  </Constructor>
  <OperatorMethod id="_1239" name="=" returns="_6745" context="_789" access="public" location="f2:58" file="f2" line="58" inline="1" artificial="1" mangled="_ZN27CThostFtdcRspUserLoginFieldaSERKS_">
    <Argument type="_6744" location="f2:58" file="f2" line="58"/>
  </OperatorMethod>
  <Destructor id="_1240" name="CThostFtdcRspUserLoginField" context="_789" access="public" location="f2:58" file="f2" line="58" inline="1" artificial="1"/>
  <Field id="_1241" name="BrokerID" type="_10" context="_790" access="public" location="f2:92" file="f2" line="92" offset="0"/>
  <Field id="_1242" name="UserID" type="_16" context="_790" access="public" location="f2:94" file="f2" line="94" offset="88"/>
  <Constructor id="_1243" name="CThostFtdcUserLogoutField" context="_790" access="public" location="f2:89" file="f2" line="89" inline="1" artificial="1"/>
  <Constructor id="_1244" name="CThostFtdcUserLogoutField" context="_790" access="public" location="f2:89" file="f2" line="89" inline="1" artificial="1">
    <Argument type="_6746" location="f2:89" file="f2" line="89"/>
  </Constructor>
  <OperatorMethod id="_1245" name="=" returns="_6747" context="_790" access="public" location="f2:89" file="f2" line="89" inline="1" artificial="1" mangled="_ZN25CThostFtdcUserLogoutFieldaSERKS_">
    <Argument type="_6746" location="f2:89" file="f2" line="89"/>
  </OperatorMethod>
  <Destructor id="_1246" name="CThostFtdcUserLogoutField" context="_790" access="public" location="f2:89" file="f2" line="89" inline="1" artificial="1"/>
  <Field id="_1247" name="BrokerID" type="_10" context="_791" access="public" location="f2:101" file="f2" line="101" offset="0"/>
  <Field id="_1248" name="UserID" type="_16" context="_791" access="public" location="f2:103" file="f2" line="103" offset="88"/>
  <Constructor id="_1249" name="CThostFtdcForceUserLogoutField" context="_791" access="public" location="f2:98" file="f2" line="98" inline="1" artificial="1"/>
  <Constructor id="_1250" name="CThostFtdcForceUserLogoutField" context="_791" access="public" location="f2:98" file="f2" line="98" inline="1" artificial="1">
    <Argument type="_6748" location="f2:98" file="f2" line="98"/>
  </Constructor>
  <OperatorMethod id="_1251" name="=" returns="_6749" context="_791" access="public" location="f2:98" file="f2" line="98" inline="1" artificial="1" mangled="_ZN30CThostFtdcForceUserLogoutFieldaSERKS_">
    <Argument type="_6748" location="f2:98" file="f2" line="98"/>
  </OperatorMethod>
  <Destructor id="_1252" name="CThostFtdcForceUserLogoutField" context="_791" access="public" location="f2:98" file="f2" line="98" inline="1" artificial="1"/>
  <Field id="_1253" name="BrokerID" type="_10" context="_792" access="public" location="f2:110" file="f2" line="110" offset="0"/>
  <Field id="_1254" name="UserID" type="_16" context="_792" access="public" location="f2:112" file="f2" line="112" offset="88"/>
  <Field id="_1255" name="UserProductInfo" type="_40" context="_792" access="public" location="f2:114" file="f2" line="114" offset="216"/>
  <Field id="_1256" name="AuthCode" type="_623" context="_792" access="public" location="f2:116" file="f2" line="116" offset="304"/>
  <Field id="_1257" name="AppID" type="_763" context="_792" access="public" location="f2:118" file="f2" line="118" offset="440"/>
  <Constructor id="_1258" name="CThostFtdcReqAuthenticateField" context="_792" access="public" location="f2:107" file="f2" line="107" inline="1" artificial="1"/>
  <Constructor id="_1259" name="CThostFtdcReqAuthenticateField" context="_792" access="public" location="f2:107" file="f2" line="107" inline="1" artificial="1">
    <Argument type="_6750" location="f2:107" file="f2" line="107"/>
  </Constructor>
  <OperatorMethod id="_1260" name="=" returns="_6751" context="_792" access="public" location="f2:107" file="f2" line="107" inline="1" artificial="1" mangled="_ZN30CThostFtdcReqAuthenticateFieldaSERKS_">
    <Argument type="_6750" location="f2:107" file="f2" line="107"/>
  </OperatorMethod>
  <Destructor id="_1261" name="CThostFtdcReqAuthenticateField" context="_792" access="public" location="f2:107" file="f2" line="107" inline="1" artificial="1"/>
  <Field id="_1262" name="BrokerID" type="_10" context="_793" access="public" location="f2:125" file="f2" line="125" offset="0"/>
  <Field id="_1263" name="UserID" type="_16" context="_793" access="public" location="f2:127" file="f2" line="127" offset="88"/>
  <Field id="_1264" name="UserProductInfo" type="_40" context="_793" access="public" location="f2:129" file="f2" line="129" offset="216"/>
  <Field id="_1265" name="AppID" type="_763" context="_793" access="public" location="f2:131" file="f2" line="131" offset="304"/>
  <Field id="_1266" name="AppType" type="_762" context="_793" access="public" location="f2:133" file="f2" line="133" offset="568"/>
  <Constructor id="_1267" name="CThostFtdcRspAuthenticateField" context="_793" access="public" location="f2:122" file="f2" line="122" inline="1" artificial="1"/>
  <Constructor id="_1268" name="CThostFtdcRspAuthenticateField" context="_793" access="public" location="f2:122" file="f2" line="122" inline="1" artificial="1">
    <Argument type="_6752" location="f2:122" file="f2" line="122"/>
  </Constructor>
  <OperatorMethod id="_1269" name="=" returns="_6753" context="_793" access="public" location="f2:122" file="f2" line="122" inline="1" artificial="1" mangled="_ZN30CThostFtdcRspAuthenticateFieldaSERKS_">
    <Argument type="_6752" location="f2:122" file="f2" line="122"/>
  </OperatorMethod>
  <Destructor id="_1270" name="CThostFtdcRspAuthenticateField" context="_793" access="public" location="f2:122" file="f2" line="122" inline="1" artificial="1"/>
  <Field id="_1271" name="BrokerID" type="_10" context="_794" access="public" location="f2:140" file="f2" line="140" offset="0"/>
  <Field id="_1272" name="UserID" type="_16" context="_794" access="public" location="f2:142" file="f2" line="142" offset="88"/>
  <Field id="_1273" name="UserProductInfo" type="_40" context="_794" access="public" location="f2:144" file="f2" line="144" offset="216"/>
  <Field id="_1274" name="AuthInfo" type="_622" context="_794" access="public" location="f2:146" file="f2" line="146" offset="304"/>
  <Field id="_1275" name="IsResult" type="_108" context="_794" access="public" location="f2:148" file="f2" line="148" offset="1344"/>
  <Field id="_1276" name="AppID" type="_763" context="_794" access="public" location="f2:150" file="f2" line="150" offset="1376"/>
  <Field id="_1277" name="AppType" type="_762" context="_794" access="public" location="f2:152" file="f2" line="152" offset="1640"/>
  <Constructor id="_1278" name="CThostFtdcAuthenticationInfoField" context="_794" access="public" location="f2:137" file="f2" line="137" inline="1" artificial="1"/>
  <Constructor id="_1279" name="CThostFtdcAuthenticationInfoField" context="_794" access="public" location="f2:137" file="f2" line="137" inline="1" artificial="1">
    <Argument type="_6754" location="f2:137" file="f2" line="137"/>
  </Constructor>
  <OperatorMethod id="_1280" name="=" returns="_6755" context="_794" access="public" location="f2:137" file="f2" line="137" inline="1" artificial="1" mangled="_ZN33CThostFtdcAuthenticationInfoFieldaSERKS_">
    <Argument type="_6754" location="f2:137" file="f2" line="137"/>
  </OperatorMethod>
  <Destructor id="_1281" name="CThostFtdcAuthenticationInfoField" context="_794" access="public" location="f2:137" file="f2" line="137" inline="1" artificial="1"/>
  <Field id="_1282" name="TradingDay" type="_30" context="_795" access="public" location="f2:159" file="f2" line="159" offset="0"/>
  <Field id="_1283" name="LoginTime" type="_31" context="_795" access="public" location="f2:161" file="f2" line="161" offset="72"/>
  <Field id="_1284" name="BrokerID" type="_10" context="_795" access="public" location="f2:163" file="f2" line="163" offset="144"/>
  <Field id="_1285" name="UserID" type="_16" context="_795" access="public" location="f2:165" file="f2" line="165" offset="232"/>
  <Field id="_1286" name="SystemName" type="_52" context="_795" access="public" location="f2:167" file="f2" line="167" offset="360"/>
  <Field id="_1287" name="FrontID" type="_98" context="_795" access="public" location="f2:169" file="f2" line="169" offset="704"/>
  <Field id="_1288" name="SessionID" type="_99" context="_795" access="public" location="f2:171" file="f2" line="171" offset="736"/>
  <Field id="_1289" name="MaxOrderRef" type="_14" context="_795" access="public" location="f2:173" file="f2" line="173" offset="768"/>
  <Field id="_1290" name="SHFETime" type="_31" context="_795" access="public" location="f2:175" file="f2" line="175" offset="872"/>
  <Field id="_1291" name="DCETime" type="_31" context="_795" access="public" location="f2:177" file="f2" line="177" offset="944"/>
  <Field id="_1292" name="CZCETime" type="_31" context="_795" access="public" location="f2:179" file="f2" line="179" offset="1016"/>
  <Field id="_1293" name="FFEXTime" type="_31" context="_795" access="public" location="f2:181" file="f2" line="181" offset="1088"/>
  <Field id="_1294" name="INETime" type="_31" context="_795" access="public" location="f2:183" file="f2" line="183" offset="1160"/>
  <Field id="_1295" name="RandomString" type="_759" context="_795" access="public" location="f2:185" file="f2" line="185" offset="1232"/>
  <Constructor id="_1296" name="CThostFtdcRspUserLogin2Field" context="_795" access="public" location="f2:156" file="f2" line="156" inline="1" artificial="1"/>
  <Constructor id="_1297" name="CThostFtdcRspUserLogin2Field" context="_795" access="public" location="f2:156" file="f2" line="156" inline="1" artificial="1">
    <Argument type="_6756" location="f2:156" file="f2" line="156"/>
  </Constructor>
  <OperatorMethod id="_1298" name="=" returns="_6757" context="_795" access="public" location="f2:156" file="f2" line="156" inline="1" artificial="1" mangled="_ZN28CThostFtdcRspUserLogin2FieldaSERKS_">
    <Argument type="_6756" location="f2:156" file="f2" line="156"/>
  </OperatorMethod>
  <Destructor id="_1299" name="CThostFtdcRspUserLogin2Field" context="_795" access="public" location="f2:156" file="f2" line="156" inline="1" artificial="1"/>
  <Field id="_1300" name="Version" type="_223" context="_796" access="public" location="f2:192" file="f2" line="192" offset="0"/>
  <Field id="_1301" name="TradeCode" type="_224" context="_796" access="public" location="f2:194" file="f2" line="194" offset="32"/>
  <Field id="_1302" name="TradeDate" type="_225" context="_796" access="public" location="f2:196" file="f2" line="196" offset="88"/>
  <Field id="_1303" name="TradeTime" type="_226" context="_796" access="public" location="f2:198" file="f2" line="198" offset="160"/>
  <Field id="_1304" name="TradeSerial" type="_227" context="_796" access="public" location="f2:200" file="f2" line="200" offset="232"/>
  <Field id="_1305" name="FutureID" type="_229" context="_796" access="public" location="f2:202" file="f2" line="202" offset="304"/>
  <Field id="_1306" name="BankID" type="_230" context="_796" access="public" location="f2:204" file="f2" line="204" offset="392"/>
  <Field id="_1307" name="BankBrchID" type="_231" context="_796" access="public" location="f2:206" file="f2" line="206" offset="424"/>
  <Field id="_1308" name="OperNo" type="_233" context="_796" access="public" location="f2:208" file="f2" line="208" offset="464"/>
  <Field id="_1309" name="DeviceID" type="_234" context="_796" access="public" location="f2:210" file="f2" line="210" offset="600"/>
  <Field id="_1310" name="RecordNum" type="_235" context="_796" access="public" location="f2:212" file="f2" line="212" offset="624"/>
  <Field id="_1311" name="SessionID" type="_99" context="_796" access="public" location="f2:214" file="f2" line="214" offset="704"/>
  <Field id="_1312" name="RequestID" type="_105" context="_796" access="public" location="f2:216" file="f2" line="216" offset="736"/>
  <Constructor id="_1313" name="CThostFtdcTransferHeaderField" context="_796" access="public" location="f2:189" file="f2" line="189" inline="1" artificial="1"/>
  <Constructor id="_1314" name="CThostFtdcTransferHeaderField" context="_796" access="public" location="f2:189" file="f2" line="189" inline="1" artificial="1">
    <Argument type="_6758" location="f2:189" file="f2" line="189"/>
  </Constructor>
  <OperatorMethod id="_1315" name="=" returns="_6759" context="_796" access="public" location="f2:189" file="f2" line="189" inline="1" artificial="1" mangled="_ZN29CThostFtdcTransferHeaderFieldaSERKS_">
    <Argument type="_6758" location="f2:189" file="f2" line="189"/>
  </OperatorMethod>
  <Destructor id="_1316" name="CThostFtdcTransferHeaderField" context="_796" access="public" location="f2:189" file="f2" line="189" inline="1" artificial="1"/>
  <Field id="_1317" name="FutureAccount" type="_170" context="_797" access="public" location="f2:223" file="f2" line="223" offset="0"/>
  <Field id="_1318" name="FuturePwdFlag" type="_237" context="_797" access="public" location="f2:225" file="f2" line="225" offset="104"/>
  <Field id="_1319" name="FutureAccPwd" type="_239" context="_797" access="public" location="f2:227" file="f2" line="227" offset="112"/>
  <Field id="_1320" name="TradeAmt" type="_113" context="_797" access="public" location="f2:229" file="f2" line="229" offset="256"/>
  <Field id="_1321" name="CustFee" type="_113" context="_797" access="public" location="f2:231" file="f2" line="231" offset="320"/>
  <Field id="_1322" name="CurrencyCode" type="_240" context="_797" access="public" location="f2:233" file="f2" line="233" offset="384"/>
  <Constructor id="_1323" name="CThostFtdcTransferBankToFutureReqField" context="_797" access="public" location="f2:220" file="f2" line="220" inline="1" artificial="1"/>
  <Constructor id="_1324" name="CThostFtdcTransferBankToFutureReqField" context="_797" access="public" location="f2:220" file="f2" line="220" inline="1" artificial="1">
    <Argument type="_6760" location="f2:220" file="f2" line="220"/>
  </Constructor>
  <OperatorMethod id="_1325" name="=" returns="_6761" context="_797" access="public" location="f2:220" file="f2" line="220" inline="1" artificial="1" mangled="_ZN38CThostFtdcTransferBankToFutureReqFieldaSERKS_">
    <Argument type="_6760" location="f2:220" file="f2" line="220"/>
  </OperatorMethod>
  <Destructor id="_1326" name="CThostFtdcTransferBankToFutureReqField" context="_797" access="public" location="f2:220" file="f2" line="220" inline="1" artificial="1"/>
  <Field id="_1327" name="RetCode" type="_241" context="_798" access="public" location="f2:240" file="f2" line="240" offset="0"/>
  <Field id="_1328" name="RetInfo" type="_242" context="_798" access="public" location="f2:242" file="f2" line="242" offset="40"/>
  <Field id="_1329" name="FutureAccount" type="_170" context="_798" access="public" location="f2:244" file="f2" line="244" offset="1072"/>
  <Field id="_1330" name="TradeAmt" type="_113" context="_798" access="public" location="f2:246" file="f2" line="246" offset="1216"/>
  <Field id="_1331" name="CustFee" type="_113" context="_798" access="public" location="f2:248" file="f2" line="248" offset="1280"/>
  <Field id="_1332" name="CurrencyCode" type="_240" context="_798" access="public" location="f2:250" file="f2" line="250" offset="1344"/>
  <Constructor id="_1333" name="CThostFtdcTransferBankToFutureRspField" context="_798" access="public" location="f2:237" file="f2" line="237" inline="1" artificial="1"/>
  <Constructor id="_1334" name="CThostFtdcTransferBankToFutureRspField" context="_798" access="public" location="f2:237" file="f2" line="237" inline="1" artificial="1">
    <Argument type="_6762" location="f2:237" file="f2" line="237"/>
  </Constructor>
  <OperatorMethod id="_1335" name="=" returns="_6763" context="_798" access="public" location="f2:237" file="f2" line="237" inline="1" artificial="1" mangled="_ZN38CThostFtdcTransferBankToFutureRspFieldaSERKS_">
    <Argument type="_6762" location="f2:237" file="f2" line="237"/>
  </OperatorMethod>
  <Destructor id="_1336" name="CThostFtdcTransferBankToFutureRspField" context="_798" access="public" location="f2:237" file="f2" line="237" inline="1" artificial="1"/>
  <Field id="_1337" name="FutureAccount" type="_170" context="_799" access="public" location="f2:257" file="f2" line="257" offset="0"/>
  <Field id="_1338" name="FuturePwdFlag" type="_237" context="_799" access="public" location="f2:259" file="f2" line="259" offset="104"/>
  <Field id="_1339" name="FutureAccPwd" type="_239" context="_799" access="public" location="f2:261" file="f2" line="261" offset="112"/>
  <Field id="_1340" name="TradeAmt" type="_113" context="_799" access="public" location="f2:263" file="f2" line="263" offset="256"/>
  <Field id="_1341" name="CustFee" type="_113" context="_799" access="public" location="f2:265" file="f2" line="265" offset="320"/>
  <Field id="_1342" name="CurrencyCode" type="_240" context="_799" access="public" location="f2:267" file="f2" line="267" offset="384"/>
  <Constructor id="_1343" name="CThostFtdcTransferFutureToBankReqField" context="_799" access="public" location="f2:254" file="f2" line="254" inline="1" artificial="1"/>
  <Constructor id="_1344" name="CThostFtdcTransferFutureToBankReqField" context="_799" access="public" location="f2:254" file="f2" line="254" inline="1" artificial="1">
    <Argument type="_6764" location="f2:254" file="f2" line="254"/>
  </Constructor>
  <OperatorMethod id="_1345" name="=" returns="_6765" context="_799" access="public" location="f2:254" file="f2" line="254" inline="1" artificial="1" mangled="_ZN38CThostFtdcTransferFutureToBankReqFieldaSERKS_">
    <Argument type="_6764" location="f2:254" file="f2" line="254"/>
  </OperatorMethod>
  <Destructor id="_1346" name="CThostFtdcTransferFutureToBankReqField" context="_799" access="public" location="f2:254" file="f2" line="254" inline="1" artificial="1"/>
  <Field id="_1347" name="RetCode" type="_241" context="_800" access="public" location="f2:274" file="f2" line="274" offset="0"/>
  <Field id="_1348" name="RetInfo" type="_242" context="_800" access="public" location="f2:276" file="f2" line="276" offset="40"/>
  <Field id="_1349" name="FutureAccount" type="_170" context="_800" access="public" location="f2:278" file="f2" line="278" offset="1072"/>
  <Field id="_1350" name="TradeAmt" type="_113" context="_800" access="public" location="f2:280" file="f2" line="280" offset="1216"/>
  <Field id="_1351" name="CustFee" type="_113" context="_800" access="public" location="f2:282" file="f2" line="282" offset="1280"/>
  <Field id="_1352" name="CurrencyCode" type="_240" context="_800" access="public" location="f2:284" file="f2" line="284" offset="1344"/>
  <Constructor id="_1353" name="CThostFtdcTransferFutureToBankRspField" context="_800" access="public" location="f2:271" file="f2" line="271" inline="1" artificial="1"/>
  <Constructor id="_1354" name="CThostFtdcTransferFutureToBankRspField" context="_800" access="public" location="f2:271" file="f2" line="271" inline="1" artificial="1">
    <Argument type="_6766" location="f2:271" file="f2" line="271"/>
  </Constructor>
  <OperatorMethod id="_1355" name="=" returns="_6767" context="_800" access="public" location="f2:271" file="f2" line="271" inline="1" artificial="1" mangled="_ZN38CThostFtdcTransferFutureToBankRspFieldaSERKS_">
    <Argument type="_6766" location="f2:271" file="f2" line="271"/>
  </OperatorMethod>
  <Destructor id="_1356" name="CThostFtdcTransferFutureToBankRspField" context="_800" access="public" location="f2:271" file="f2" line="271" inline="1" artificial="1"/>
  <Field id="_1357" name="FutureAccount" type="_170" context="_801" access="public" location="f2:291" file="f2" line="291" offset="0"/>
  <Field id="_1358" name="FuturePwdFlag" type="_237" context="_801" access="public" location="f2:293" file="f2" line="293" offset="104"/>
  <Field id="_1359" name="FutureAccPwd" type="_239" context="_801" access="public" location="f2:295" file="f2" line="295" offset="112"/>
  <Field id="_1360" name="CurrencyCode" type="_240" context="_801" access="public" location="f2:297" file="f2" line="297" offset="248"/>
  <Constructor id="_1361" name="CThostFtdcTransferQryBankReqField" context="_801" access="public" location="f2:288" file="f2" line="288" inline="1" artificial="1"/>
  <Constructor id="_1362" name="CThostFtdcTransferQryBankReqField" context="_801" access="public" location="f2:288" file="f2" line="288" inline="1" artificial="1">
    <Argument type="_6768" location="f2:288" file="f2" line="288"/>
  </Constructor>
  <OperatorMethod id="_1363" name="=" returns="_6769" context="_801" access="public" location="f2:288" file="f2" line="288" inline="1" artificial="1" mangled="_ZN33CThostFtdcTransferQryBankReqFieldaSERKS_">
    <Argument type="_6768" location="f2:288" file="f2" line="288"/>
  </OperatorMethod>
  <Destructor id="_1364" name="CThostFtdcTransferQryBankReqField" context="_801" access="public" location="f2:288" file="f2" line="288" inline="1" artificial="1"/>
  <Field id="_1365" name="RetCode" type="_241" context="_802" access="public" location="f2:304" file="f2" line="304" offset="0"/>
  <Field id="_1366" name="RetInfo" type="_242" context="_802" access="public" location="f2:306" file="f2" line="306" offset="40"/>
  <Field id="_1367" name="FutureAccount" type="_170" context="_802" access="public" location="f2:308" file="f2" line="308" offset="1072"/>
  <Field id="_1368" name="TradeAmt" type="_113" context="_802" access="public" location="f2:310" file="f2" line="310" offset="1216"/>
  <Field id="_1369" name="UseAmt" type="_113" context="_802" access="public" location="f2:312" file="f2" line="312" offset="1280"/>
  <Field id="_1370" name="FetchAmt" type="_113" context="_802" access="public" location="f2:314" file="f2" line="314" offset="1344"/>
  <Field id="_1371" name="CurrencyCode" type="_240" context="_802" access="public" location="f2:316" file="f2" line="316" offset="1408"/>
  <Constructor id="_1372" name="CThostFtdcTransferQryBankRspField" context="_802" access="public" location="f2:301" file="f2" line="301" inline="1" artificial="1"/>
  <Constructor id="_1373" name="CThostFtdcTransferQryBankRspField" context="_802" access="public" location="f2:301" file="f2" line="301" inline="1" artificial="1">
    <Argument type="_6770" location="f2:301" file="f2" line="301"/>
  </Constructor>
  <OperatorMethod id="_1374" name="=" returns="_6771" context="_802" access="public" location="f2:301" file="f2" line="301" inline="1" artificial="1" mangled="_ZN33CThostFtdcTransferQryBankRspFieldaSERKS_">
    <Argument type="_6770" location="f2:301" file="f2" line="301"/>
  </OperatorMethod>
  <Destructor id="_1375" name="CThostFtdcTransferQryBankRspField" context="_802" access="public" location="f2:301" file="f2" line="301" inline="1" artificial="1"/>
  <Field id="_1376" name="FutureAccount" type="_170" context="_803" access="public" location="f2:323" file="f2" line="323" offset="0"/>
  <Constructor id="_1377" name="CThostFtdcTransferQryDetailReqField" context="_803" access="public" location="f2:320" file="f2" line="320" inline="1" artificial="1"/>
  <Constructor id="_1378" name="CThostFtdcTransferQryDetailReqField" context="_803" access="public" location="f2:320" file="f2" line="320" inline="1" artificial="1">
    <Argument type="_6772" location="f2:320" file="f2" line="320"/>
  </Constructor>
  <OperatorMethod id="_1379" name="=" returns="_6773" context="_803" access="public" location="f2:320" file="f2" line="320" inline="1" artificial="1" mangled="_ZN35CThostFtdcTransferQryDetailReqFieldaSERKS_">
    <Argument type="_6772" location="f2:320" file="f2" line="320"/>
  </OperatorMethod>
  <Destructor id="_1380" name="CThostFtdcTransferQryDetailReqField" context="_803" access="public" location="f2:320" file="f2" line="320" inline="1" artificial="1"/>
  <Field id="_1381" name="TradeDate" type="_30" context="_804" access="public" location="f2:330" file="f2" line="330" offset="0"/>
  <Field id="_1382" name="TradeTime" type="_226" context="_804" access="public" location="f2:332" file="f2" line="332" offset="72"/>
  <Field id="_1383" name="TradeCode" type="_224" context="_804" access="public" location="f2:334" file="f2" line="334" offset="144"/>
  <Field id="_1384" name="FutureSerial" type="_228" context="_804" access="public" location="f2:336" file="f2" line="336" offset="224"/>
  <Field id="_1385" name="FutureID" type="_229" context="_804" access="public" location="f2:338" file="f2" line="338" offset="256"/>
  <Field id="_1386" name="FutureAccount" type="_236" context="_804" access="public" location="f2:340" file="f2" line="340" offset="344"/>
  <Field id="_1387" name="BankSerial" type="_228" context="_804" access="public" location="f2:342" file="f2" line="342" offset="544"/>
  <Field id="_1388" name="BankID" type="_230" context="_804" access="public" location="f2:344" file="f2" line="344" offset="576"/>
  <Field id="_1389" name="BankBrchID" type="_231" context="_804" access="public" location="f2:346" file="f2" line="346" offset="608"/>
  <Field id="_1390" name="BankAccount" type="_172" context="_804" access="public" location="f2:348" file="f2" line="348" offset="648"/>
  <Field id="_1391" name="CertCode" type="_247" context="_804" access="public" location="f2:350" file="f2" line="350" offset="976"/>
  <Field id="_1392" name="CurrencyCode" type="_240" context="_804" access="public" location="f2:352" file="f2" line="352" offset="1144"/>
  <Field id="_1393" name="TxAmount" type="_113" context="_804" access="public" location="f2:354" file="f2" line="354" offset="1216"/>
  <Field id="_1394" name="Flag" type="_246" context="_804" access="public" location="f2:356" file="f2" line="356" offset="1280"/>
  <Constructor id="_1395" name="CThostFtdcTransferQryDetailRspField" context="_804" access="public" location="f2:327" file="f2" line="327" inline="1" artificial="1"/>
  <Constructor id="_1396" name="CThostFtdcTransferQryDetailRspField" context="_804" access="public" location="f2:327" file="f2" line="327" inline="1" artificial="1">
    <Argument type="_6774" location="f2:327" file="f2" line="327"/>
  </Constructor>
  <OperatorMethod id="_1397" name="=" returns="_6775" context="_804" access="public" location="f2:327" file="f2" line="327" inline="1" artificial="1" mangled="_ZN35CThostFtdcTransferQryDetailRspFieldaSERKS_">
    <Argument type="_6774" location="f2:327" file="f2" line="327"/>
  </OperatorMethod>
  <Destructor id="_1398" name="CThostFtdcTransferQryDetailRspField" context="_804" access="public" location="f2:327" file="f2" line="327" inline="1" artificial="1"/>
  <Field id="_1399" name="ErrorID" type="_95" context="_805" access="public" location="f2:363" file="f2" line="363" offset="0"/>
  <Field id="_1400" name="ErrorMsg" type="_49" context="_805" access="public" location="f2:365" file="f2" line="365" offset="32"/>
  <Constructor id="_1401" name="CThostFtdcRspInfoField" context="_805" access="public" location="f2:360" file="f2" line="360" inline="1" artificial="1"/>
  <Constructor id="_1402" name="CThostFtdcRspInfoField" context="_805" access="public" location="f2:360" file="f2" line="360" inline="1" artificial="1">
    <Argument type="_6776" location="f2:360" file="f2" line="360"/>
  </Constructor>
  <OperatorMethod id="_1403" name="=" returns="_6777" context="_805" access="public" location="f2:360" file="f2" line="360" inline="1" artificial="1" mangled="_ZN22CThostFtdcRspInfoFieldaSERKS_">
    <Argument type="_6776" location="f2:360" file="f2" line="360"/>
  </OperatorMethod>
  <Destructor id="_1404" name="CThostFtdcRspInfoField" context="_805" access="public" location="f2:360" file="f2" line="360" inline="1" artificial="1"/>
  <Field id="_1405" name="ExchangeID" type="_23" context="_806" access="public" location="f2:372" file="f2" line="372" offset="0"/>
  <Field id="_1406" name="ExchangeName" type="_24" context="_806" access="public" location="f2:374" file="f2" line="374" offset="72"/>
  <Field id="_1407" name="ExchangeProperty" type="_29" context="_806" access="public" location="f2:376" file="f2" line="376" offset="560"/>
  <Constructor id="_1408" name="CThostFtdcExchangeField" context="_806" access="public" location="f2:369" file="f2" line="369" inline="1" artificial="1"/>
  <Constructor id="_1409" name="CThostFtdcExchangeField" context="_806" access="public" location="f2:369" file="f2" line="369" inline="1" artificial="1">
    <Argument type="_6778" location="f2:369" file="f2" line="369"/>
  </Constructor>
  <OperatorMethod id="_1410" name="=" returns="_6779" context="_806" access="public" location="f2:369" file="f2" line="369" inline="1" artificial="1" mangled="_ZN23CThostFtdcExchangeFieldaSERKS_">
    <Argument type="_6778" location="f2:369" file="f2" line="369"/>
  </OperatorMethod>
  <Destructor id="_1411" name="CThostFtdcExchangeField" context="_806" access="public" location="f2:369" file="f2" line="369" inline="1" artificial="1"/>
  <Field id="_1412" name="ProductID" type="_19" context="_807" access="public" location="f2:383" file="f2" line="383" offset="0"/>
  <Field id="_1413" name="ProductName" type="_22" context="_807" access="public" location="f2:385" file="f2" line="385" offset="248"/>
  <Field id="_1414" name="ExchangeID" type="_23" context="_807" access="public" location="f2:387" file="f2" line="387" offset="416"/>
  <Field id="_1415" name="ProductClass" type="_68" context="_807" access="public" location="f2:389" file="f2" line="389" offset="488"/>
  <Field id="_1416" name="VolumeMultiple" type="_103" context="_807" access="public" location="f2:391" file="f2" line="391" offset="512"/>
  <Field id="_1417" name="PriceTick" type="_109" context="_807" access="public" location="f2:393" file="f2" line="393" offset="576"/>
  <Field id="_1418" name="MaxMarketOrderVolume" type="_97" context="_807" access="public" location="f2:395" file="f2" line="395" offset="640"/>
  <Field id="_1419" name="MinMarketOrderVolume" type="_97" context="_807" access="public" location="f2:397" file="f2" line="397" offset="672"/>
  <Field id="_1420" name="MaxLimitOrderVolume" type="_97" context="_807" access="public" location="f2:399" file="f2" line="399" offset="704"/>
  <Field id="_1421" name="MinLimitOrderVolume" type="_97" context="_807" access="public" location="f2:401" file="f2" line="401" offset="736"/>
  <Field id="_1422" name="PositionType" type="_71" context="_807" access="public" location="f2:403" file="f2" line="403" offset="768"/>
  <Field id="_1423" name="PositionDateType" type="_66" context="_807" access="public" location="f2:405" file="f2" line="405" offset="776"/>
  <Field id="_1424" name="CloseDealType" type="_637" context="_807" access="public" location="f2:407" file="f2" line="407" offset="784"/>
  <Field id="_1425" name="TradeCurrencyID" type="_335" context="_807" access="public" location="f2:409" file="f2" line="409" offset="792"/>
  <Field id="_1426" name="MortgageFundUseRange" type="_638" context="_807" access="public" location="f2:411" file="f2" line="411" offset="824"/>
  <Field id="_1427" name="ExchangeProductID" type="_19" context="_807" access="public" location="f2:413" file="f2" line="413" offset="832"/>
  <Field id="_1428" name="UnderlyingMultiple" type="_118" context="_807" access="public" location="f2:415" file="f2" line="415" offset="1088"/>
  <Constructor id="_1429" name="CThostFtdcProductField" context="_807" access="public" location="f2:380" file="f2" line="380" inline="1" artificial="1"/>
  <Constructor id="_1430" name="CThostFtdcProductField" context="_807" access="public" location="f2:380" file="f2" line="380" inline="1" artificial="1">
    <Argument type="_6780" location="f2:380" file="f2" line="380"/>
  </Constructor>
  <OperatorMethod id="_1431" name="=" returns="_6781" context="_807" access="public" location="f2:380" file="f2" line="380" inline="1" artificial="1" mangled="_ZN22CThostFtdcProductFieldaSERKS_">
    <Argument type="_6780" location="f2:380" file="f2" line="380"/>
  </OperatorMethod>
  <Destructor id="_1432" name="CThostFtdcProductField" context="_807" access="public" location="f2:380" file="f2" line="380" inline="1" artificial="1"/>
  <Field id="_1433" name="InstrumentID" type="_19" context="_808" access="public" location="f2:422" file="f2" line="422" offset="0"/>
  <Field id="_1434" name="ExchangeID" type="_23" context="_808" access="public" location="f2:424" file="f2" line="424" offset="248"/>
  <Field id="_1435" name="InstrumentName" type="_33" context="_808" access="public" location="f2:426" file="f2" line="426" offset="320"/>
  <Field id="_1436" name="ExchangeInstID" type="_13" context="_808" access="public" location="f2:428" file="f2" line="428" offset="488"/>
  <Field id="_1437" name="ProductID" type="_19" context="_808" access="public" location="f2:430" file="f2" line="430" offset="736"/>
  <Field id="_1438" name="ProductClass" type="_68" context="_808" access="public" location="f2:432" file="f2" line="432" offset="984"/>
  <Field id="_1439" name="DeliveryYear" type="_106" context="_808" access="public" location="f2:434" file="f2" line="434" offset="992"/>
  <Field id="_1440" name="DeliveryMonth" type="_107" context="_808" access="public" location="f2:436" file="f2" line="436" offset="1024"/>
  <Field id="_1441" name="MaxMarketOrderVolume" type="_97" context="_808" access="public" location="f2:438" file="f2" line="438" offset="1056"/>
  <Field id="_1442" name="MinMarketOrderVolume" type="_97" context="_808" access="public" location="f2:440" file="f2" line="440" offset="1088"/>
  <Field id="_1443" name="MaxLimitOrderVolume" type="_97" context="_808" access="public" location="f2:442" file="f2" line="442" offset="1120"/>
  <Field id="_1444" name="MinLimitOrderVolume" type="_97" context="_808" access="public" location="f2:444" file="f2" line="444" offset="1152"/>
  <Field id="_1445" name="VolumeMultiple" type="_103" context="_808" access="public" location="f2:446" file="f2" line="446" offset="1184"/>
  <Field id="_1446" name="PriceTick" type="_109" context="_808" access="public" location="f2:448" file="f2" line="448" offset="1216"/>
  <Field id="_1447" name="CreateDate" type="_30" context="_808" access="public" location="f2:450" file="f2" line="450" offset="1280"/>
  <Field id="_1448" name="OpenDate" type="_30" context="_808" access="public" location="f2:452" file="f2" line="452" offset="1352"/>
  <Field id="_1449" name="ExpireDate" type="_30" context="_808" access="public" location="f2:454" file="f2" line="454" offset="1424"/>
  <Field id="_1450" name="StartDelivDate" type="_30" context="_808" access="public" location="f2:456" file="f2" line="456" offset="1496"/>
  <Field id="_1451" name="EndDelivDate" type="_30" context="_808" access="public" location="f2:458" file="f2" line="458" offset="1568"/>
  <Field id="_1452" name="InstLifePhase" type="_69" context="_808" access="public" location="f2:460" file="f2" line="460" offset="1640"/>
  <Field id="_1453" name="IsTrading" type="_108" context="_808" access="public" location="f2:462" file="f2" line="462" offset="1664"/>
  <Field id="_1454" name="PositionType" type="_71" context="_808" access="public" location="f2:464" file="f2" line="464" offset="1696"/>
  <Field id="_1455" name="PositionDateType" type="_66" context="_808" access="public" location="f2:466" file="f2" line="466" offset="1704"/>
  <Field id="_1456" name="LongMarginRatio" type="_112" context="_808" access="public" location="f2:468" file="f2" line="468" offset="1728"/>
  <Field id="_1457" name="ShortMarginRatio" type="_112" context="_808" access="public" location="f2:470" file="f2" line="470" offset="1792"/>
  <Field id="_1458" name="MaxMarginSideAlgorithm" type="_705" context="_808" access="public" location="f2:472" file="f2" line="472" offset="1856"/>
  <Field id="_1459" name="UnderlyingInstrID" type="_19" context="_808" access="public" location="f2:474" file="f2" line="474" offset="1864"/>
  <Field id="_1460" name="StrikePrice" type="_109" context="_808" access="public" location="f2:476" file="f2" line="476" offset="2112"/>
  <Field id="_1461" name="OptionsType" type="_721" context="_808" access="public" location="f2:478" file="f2" line="478" offset="2176"/>
  <Field id="_1462" name="UnderlyingMultiple" type="_118" context="_808" access="public" location="f2:480" file="f2" line="480" offset="2240"/>
  <Field id="_1463" name="CombinationType" type="_730" context="_808" access="public" location="f2:482" file="f2" line="482" offset="2304"/>
  <Constructor id="_1464" name="CThostFtdcInstrumentField" context="_808" access="public" location="f2:419" file="f2" line="419" inline="1" artificial="1"/>
  <Constructor id="_1465" name="CThostFtdcInstrumentField" context="_808" access="public" location="f2:419" file="f2" line="419" inline="1" artificial="1">
    <Argument type="_6782" location="f2:419" file="f2" line="419"/>
  </Constructor>
  <OperatorMethod id="_1466" name="=" returns="_6783" context="_808" access="public" location="f2:419" file="f2" line="419" inline="1" artificial="1" mangled="_ZN25CThostFtdcInstrumentFieldaSERKS_">
    <Argument type="_6782" location="f2:419" file="f2" line="419"/>
  </OperatorMethod>
  <Destructor id="_1467" name="CThostFtdcInstrumentField" context="_808" access="public" location="f2:419" file="f2" line="419" inline="1" artificial="1"/>
  <Field id="_1468" name="BrokerID" type="_10" context="_809" access="public" location="f2:489" file="f2" line="489" offset="0"/>
  <Field id="_1469" name="BrokerAbbr" type="_11" context="_809" access="public" location="f2:491" file="f2" line="491" offset="88"/>
  <Field id="_1470" name="BrokerName" type="_12" context="_809" access="public" location="f2:493" file="f2" line="493" offset="160"/>
  <Field id="_1471" name="IsActive" type="_108" context="_809" access="public" location="f2:495" file="f2" line="495" offset="832"/>
  <Constructor id="_1472" name="CThostFtdcBrokerField" context="_809" access="public" location="f2:486" file="f2" line="486" inline="1" artificial="1"/>
  <Constructor id="_1473" name="CThostFtdcBrokerField" context="_809" access="public" location="f2:486" file="f2" line="486" inline="1" artificial="1">
    <Argument type="_6784" location="f2:486" file="f2" line="486"/>
  </Constructor>
  <OperatorMethod id="_1474" name="=" returns="_6785" context="_809" access="public" location="f2:486" file="f2" line="486" inline="1" artificial="1" mangled="_ZN21CThostFtdcBrokerFieldaSERKS_">
    <Argument type="_6784" location="f2:486" file="f2" line="486"/>
  </OperatorMethod>
  <Destructor id="_1475" name="CThostFtdcBrokerField" context="_809" access="public" location="f2:486" file="f2" line="486" inline="1" artificial="1"/>
  <Field id="_1476" name="ExchangeID" type="_23" context="_810" access="public" location="f2:502" file="f2" line="502" offset="0"/>
  <Field id="_1477" name="TraderID" type="_8" context="_810" access="public" location="f2:504" file="f2" line="504" offset="72"/>
  <Field id="_1478" name="ParticipantID" type="_15" context="_810" access="public" location="f2:506" file="f2" line="506" offset="240"/>
  <Field id="_1479" name="Password" type="_17" context="_810" access="public" location="f2:508" file="f2" line="508" offset="328"/>
  <Field id="_1480" name="InstallCount" type="_93" context="_810" access="public" location="f2:510" file="f2" line="510" offset="672"/>
  <Field id="_1481" name="BrokerID" type="_10" context="_810" access="public" location="f2:512" file="f2" line="512" offset="704"/>
  <Constructor id="_1482" name="CThostFtdcTraderField" context="_810" access="public" location="f2:499" file="f2" line="499" inline="1" artificial="1"/>
  <Constructor id="_1483" name="CThostFtdcTraderField" context="_810" access="public" location="f2:499" file="f2" line="499" inline="1" artificial="1">
    <Argument type="_6786" location="f2:499" file="f2" line="499"/>
  </Constructor>
  <OperatorMethod id="_1484" name="=" returns="_6787" context="_810" access="public" location="f2:499" file="f2" line="499" inline="1" artificial="1" mangled="_ZN21CThostFtdcTraderFieldaSERKS_">
    <Argument type="_6786" location="f2:499" file="f2" line="499"/>
  </OperatorMethod>
  <Destructor id="_1485" name="CThostFtdcTraderField" context="_810" access="public" location="f2:499" file="f2" line="499" inline="1" artificial="1"/>
  <Field id="_1486" name="InvestorID" type="_9" context="_811" access="public" location="f2:519" file="f2" line="519" offset="0"/>
  <Field id="_1487" name="BrokerID" type="_10" context="_811" access="public" location="f2:521" file="f2" line="521" offset="104"/>
  <Field id="_1488" name="InvestorGroupID" type="_9" context="_811" access="public" location="f2:523" file="f2" line="523" offset="192"/>
  <Field id="_1489" name="InvestorName" type="_48" context="_811" access="public" location="f2:525" file="f2" line="525" offset="296"/>
  <Field id="_1490" name="IdentifiedCardType" type="_45" context="_811" access="public" location="f2:527" file="f2" line="527" offset="944"/>
  <Field id="_1491" name="IdentifiedCardNo" type="_44" context="_811" access="public" location="f2:529" file="f2" line="529" offset="952"/>
  <Field id="_1492" name="IsActive" type="_108" context="_811" access="public" location="f2:531" file="f2" line="531" offset="1376"/>
  <Field id="_1493" name="Telephone" type="_126" context="_811" access="public" location="f2:533" file="f2" line="533" offset="1408"/>
  <Field id="_1494" name="Address" type="_124" context="_811" access="public" location="f2:535" file="f2" line="535" offset="1736"/>
  <Field id="_1495" name="OpenDate" type="_30" context="_811" access="public" location="f2:537" file="f2" line="537" offset="2544"/>
  <Field id="_1496" name="Mobile" type="_128" context="_811" access="public" location="f2:539" file="f2" line="539" offset="2616"/>
  <Field id="_1497" name="CommModelID" type="_9" context="_811" access="public" location="f2:541" file="f2" line="541" offset="2944"/>
  <Field id="_1498" name="MarginModelID" type="_9" context="_811" access="public" location="f2:543" file="f2" line="543" offset="3048"/>
  <Constructor id="_1499" name="CThostFtdcInvestorField" context="_811" access="public" location="f2:516" file="f2" line="516" inline="1" artificial="1"/>
  <Constructor id="_1500" name="CThostFtdcInvestorField" context="_811" access="public" location="f2:516" file="f2" line="516" inline="1" artificial="1">
    <Argument type="_6788" location="f2:516" file="f2" line="516"/>
  </Constructor>
  <OperatorMethod id="_1501" name="=" returns="_6789" context="_811" access="public" location="f2:516" file="f2" line="516" inline="1" artificial="1" mangled="_ZN23CThostFtdcInvestorFieldaSERKS_">
    <Argument type="_6788" location="f2:516" file="f2" line="516"/>
  </OperatorMethod>
  <Destructor id="_1502" name="CThostFtdcInvestorField" context="_811" access="public" location="f2:516" file="f2" line="516" inline="1" artificial="1"/>
  <Field id="_1503" name="InvestorID" type="_9" context="_812" access="public" location="f2:550" file="f2" line="550" offset="0"/>
  <Field id="_1504" name="BrokerID" type="_10" context="_812" access="public" location="f2:552" file="f2" line="552" offset="104"/>
  <Field id="_1505" name="ExchangeID" type="_23" context="_812" access="public" location="f2:554" file="f2" line="554" offset="192"/>
  <Field id="_1506" name="ClientID" type="_18" context="_812" access="public" location="f2:556" file="f2" line="556" offset="264"/>
  <Field id="_1507" name="IsActive" type="_108" context="_812" access="public" location="f2:558" file="f2" line="558" offset="352"/>
  <Field id="_1508" name="ClientIDType" type="_77" context="_812" access="public" location="f2:560" file="f2" line="560" offset="384"/>
  <Field id="_1509" name="BranchID" type="_261" context="_812" access="public" location="f2:562" file="f2" line="562" offset="392"/>
  <Field id="_1510" name="BizType" type="_761" context="_812" access="public" location="f2:564" file="f2" line="564" offset="464"/>
  <Field id="_1511" name="InvestUnitID" type="_748" context="_812" access="public" location="f2:566" file="f2" line="566" offset="472"/>
  <Constructor id="_1512" name="CThostFtdcTradingCodeField" context="_812" access="public" location="f2:547" file="f2" line="547" inline="1" artificial="1"/>
  <Constructor id="_1513" name="CThostFtdcTradingCodeField" context="_812" access="public" location="f2:547" file="f2" line="547" inline="1" artificial="1">
    <Argument type="_6790" location="f2:547" file="f2" line="547"/>
  </Constructor>
  <OperatorMethod id="_1514" name="=" returns="_6791" context="_812" access="public" location="f2:547" file="f2" line="547" inline="1" artificial="1" mangled="_ZN26CThostFtdcTradingCodeFieldaSERKS_">
    <Argument type="_6790" location="f2:547" file="f2" line="547"/>
  </OperatorMethod>
  <Destructor id="_1515" name="CThostFtdcTradingCodeField" context="_812" access="public" location="f2:547" file="f2" line="547" inline="1" artificial="1"/>
  <Field id="_1516" name="BrokerID" type="_10" context="_813" access="public" location="f2:573" file="f2" line="573" offset="0"/>
  <Field id="_1517" name="ExchangeID" type="_23" context="_813" access="public" location="f2:575" file="f2" line="575" offset="88"/>
  <Field id="_1518" name="ParticipantID" type="_15" context="_813" access="public" location="f2:577" file="f2" line="577" offset="160"/>
  <Field id="_1519" name="IsActive" type="_108" context="_813" access="public" location="f2:579" file="f2" line="579" offset="256"/>
  <Constructor id="_1520" name="CThostFtdcPartBrokerField" context="_813" access="public" location="f2:570" file="f2" line="570" inline="1" artificial="1"/>
  <Constructor id="_1521" name="CThostFtdcPartBrokerField" context="_813" access="public" location="f2:570" file="f2" line="570" inline="1" artificial="1">
    <Argument type="_6792" location="f2:570" file="f2" line="570"/>
  </Constructor>
  <OperatorMethod id="_1522" name="=" returns="_6793" context="_813" access="public" location="f2:570" file="f2" line="570" inline="1" artificial="1" mangled="_ZN25CThostFtdcPartBrokerFieldaSERKS_">
    <Argument type="_6792" location="f2:570" file="f2" line="570"/>
  </OperatorMethod>
  <Destructor id="_1523" name="CThostFtdcPartBrokerField" context="_813" access="public" location="f2:570" file="f2" line="570" inline="1" artificial="1"/>
  <Field id="_1524" name="UserID" type="_16" context="_814" access="public" location="f2:586" file="f2" line="586" offset="0"/>
  <Field id="_1525" name="UserName" type="_47" context="_814" access="public" location="f2:588" file="f2" line="588" offset="128"/>
  <Field id="_1526" name="Password" type="_17" context="_814" access="public" location="f2:590" file="f2" line="590" offset="776"/>
  <Field id="_1527" name="IsActive" type="_108" context="_814" access="public" location="f2:592" file="f2" line="592" offset="1120"/>
  <Constructor id="_1528" name="CThostFtdcSuperUserField" context="_814" access="public" location="f2:583" file="f2" line="583" inline="1" artificial="1"/>
  <Constructor id="_1529" name="CThostFtdcSuperUserField" context="_814" access="public" location="f2:583" file="f2" line="583" inline="1" artificial="1">
    <Argument type="_6794" location="f2:583" file="f2" line="583"/>
  </Constructor>
  <OperatorMethod id="_1530" name="=" returns="_6795" context="_814" access="public" location="f2:583" file="f2" line="583" inline="1" artificial="1" mangled="_ZN24CThostFtdcSuperUserFieldaSERKS_">
    <Argument type="_6794" location="f2:583" file="f2" line="583"/>
  </OperatorMethod>
  <Destructor id="_1531" name="CThostFtdcSuperUserField" context="_814" access="public" location="f2:583" file="f2" line="583" inline="1" artificial="1"/>
  <Field id="_1532" name="UserID" type="_16" context="_815" access="public" location="f2:599" file="f2" line="599" offset="0"/>
  <Field id="_1533" name="FunctionCode" type="_60" context="_815" access="public" location="f2:601" file="f2" line="601" offset="128"/>
  <Constructor id="_1534" name="CThostFtdcSuperUserFunctionField" context="_815" access="public" location="f2:596" file="f2" line="596" inline="1" artificial="1"/>
  <Constructor id="_1535" name="CThostFtdcSuperUserFunctionField" context="_815" access="public" location="f2:596" file="f2" line="596" inline="1" artificial="1">
    <Argument type="_6796" location="f2:596" file="f2" line="596"/>
  </Constructor>
  <OperatorMethod id="_1536" name="=" returns="_6797" context="_815" access="public" location="f2:596" file="f2" line="596" inline="1" artificial="1" mangled="_ZN32CThostFtdcSuperUserFunctionFieldaSERKS_">
    <Argument type="_6796" location="f2:596" file="f2" line="596"/>
  </OperatorMethod>
  <Destructor id="_1537" name="CThostFtdcSuperUserFunctionField" context="_815" access="public" location="f2:596" file="f2" line="596" inline="1" artificial="1"/>
  <Field id="_1538" name="BrokerID" type="_10" context="_816" access="public" location="f2:608" file="f2" line="608" offset="0"/>
  <Field id="_1539" name="InvestorGroupID" type="_9" context="_816" access="public" location="f2:610" file="f2" line="610" offset="88"/>
  <Field id="_1540" name="InvestorGroupName" type="_153" context="_816" access="public" location="f2:612" file="f2" line="612" offset="192"/>
  <Constructor id="_1541" name="CThostFtdcInvestorGroupField" context="_816" access="public" location="f2:605" file="f2" line="605" inline="1" artificial="1"/>
  <Constructor id="_1542" name="CThostFtdcInvestorGroupField" context="_816" access="public" location="f2:605" file="f2" line="605" inline="1" artificial="1">
    <Argument type="_6798" location="f2:605" file="f2" line="605"/>
  </Constructor>
  <OperatorMethod id="_1543" name="=" returns="_6799" context="_816" access="public" location="f2:605" file="f2" line="605" inline="1" artificial="1" mangled="_ZN28CThostFtdcInvestorGroupFieldaSERKS_">
    <Argument type="_6798" location="f2:605" file="f2" line="605"/>
  </OperatorMethod>
  <Destructor id="_1544" name="CThostFtdcInvestorGroupField" context="_816" access="public" location="f2:605" file="f2" line="605" inline="1" artificial="1"/>
  <Field id="_1545" name="BrokerID" type="_10" context="_817" access="public" location="f2:619" file="f2" line="619" offset="0"/>
  <Field id="_1546" name="AccountID" type="_170" context="_817" access="public" location="f2:621" file="f2" line="621" offset="88"/>
  <Field id="_1547" name="PreMortgage" type="_113" context="_817" access="public" location="f2:623" file="f2" line="623" offset="192"/>
  <Field id="_1548" name="PreCredit" type="_113" context="_817" access="public" location="f2:625" file="f2" line="625" offset="256"/>
  <Field id="_1549" name="PreDeposit" type="_113" context="_817" access="public" location="f2:627" file="f2" line="627" offset="320"/>
  <Field id="_1550" name="PreBalance" type="_113" context="_817" access="public" location="f2:629" file="f2" line="629" offset="384"/>
  <Field id="_1551" name="PreMargin" type="_113" context="_817" access="public" location="f2:631" file="f2" line="631" offset="448"/>
  <Field id="_1552" name="InterestBase" type="_113" context="_817" access="public" location="f2:633" file="f2" line="633" offset="512"/>
  <Field id="_1553" name="Interest" type="_113" context="_817" access="public" location="f2:635" file="f2" line="635" offset="576"/>
  <Field id="_1554" name="Deposit" type="_113" context="_817" access="public" location="f2:637" file="f2" line="637" offset="640"/>
  <Field id="_1555" name="Withdraw" type="_113" context="_817" access="public" location="f2:639" file="f2" line="639" offset="704"/>
  <Field id="_1556" name="FrozenMargin" type="_113" context="_817" access="public" location="f2:641" file="f2" line="641" offset="768"/>
  <Field id="_1557" name="FrozenCash" type="_113" context="_817" access="public" location="f2:643" file="f2" line="643" offset="832"/>
  <Field id="_1558" name="FrozenCommission" type="_113" context="_817" access="public" location="f2:645" file="f2" line="645" offset="896"/>
  <Field id="_1559" name="CurrMargin" type="_113" context="_817" access="public" location="f2:647" file="f2" line="647" offset="960"/>
  <Field id="_1560" name="CashIn" type="_113" context="_817" access="public" location="f2:649" file="f2" line="649" offset="1024"/>
  <Field id="_1561" name="Commission" type="_113" context="_817" access="public" location="f2:651" file="f2" line="651" offset="1088"/>
  <Field id="_1562" name="CloseProfit" type="_113" context="_817" access="public" location="f2:653" file="f2" line="653" offset="1152"/>
  <Field id="_1563" name="PositionProfit" type="_113" context="_817" access="public" location="f2:655" file="f2" line="655" offset="1216"/>
  <Field id="_1564" name="Balance" type="_113" context="_817" access="public" location="f2:657" file="f2" line="657" offset="1280"/>
  <Field id="_1565" name="Available" type="_113" context="_817" access="public" location="f2:659" file="f2" line="659" offset="1344"/>
  <Field id="_1566" name="WithdrawQuota" type="_113" context="_817" access="public" location="f2:661" file="f2" line="661" offset="1408"/>
  <Field id="_1567" name="Reserve" type="_113" context="_817" access="public" location="f2:663" file="f2" line="663" offset="1472"/>
  <Field id="_1568" name="TradingDay" type="_30" context="_817" access="public" location="f2:665" file="f2" line="665" offset="1536"/>
  <Field id="_1569" name="SettlementID" type="_96" context="_817" access="public" location="f2:667" file="f2" line="667" offset="1632"/>
  <Field id="_1570" name="Credit" type="_113" context="_817" access="public" location="f2:669" file="f2" line="669" offset="1664"/>
  <Field id="_1571" name="Mortgage" type="_113" context="_817" access="public" location="f2:671" file="f2" line="671" offset="1728"/>
  <Field id="_1572" name="ExchangeMargin" type="_113" context="_817" access="public" location="f2:673" file="f2" line="673" offset="1792"/>
  <Field id="_1573" name="DeliveryMargin" type="_113" context="_817" access="public" location="f2:675" file="f2" line="675" offset="1856"/>
  <Field id="_1574" name="ExchangeDeliveryMargin" type="_113" context="_817" access="public" location="f2:677" file="f2" line="677" offset="1920"/>
  <Field id="_1575" name="ReserveBalance" type="_113" context="_817" access="public" location="f2:679" file="f2" line="679" offset="1984"/>
  <Field id="_1576" name="CurrencyID" type="_335" context="_817" access="public" location="f2:681" file="f2" line="681" offset="2048"/>
  <Field id="_1577" name="PreFundMortgageIn" type="_113" context="_817" access="public" location="f2:683" file="f2" line="683" offset="2112"/>
  <Field id="_1578" name="PreFundMortgageOut" type="_113" context="_817" access="public" location="f2:685" file="f2" line="685" offset="2176"/>
  <Field id="_1579" name="FundMortgageIn" type="_113" context="_817" access="public" location="f2:687" file="f2" line="687" offset="2240"/>
  <Field id="_1580" name="FundMortgageOut" type="_113" context="_817" access="public" location="f2:689" file="f2" line="689" offset="2304"/>
  <Field id="_1581" name="FundMortgageAvailable" type="_113" context="_817" access="public" location="f2:691" file="f2" line="691" offset="2368"/>
  <Field id="_1582" name="MortgageableFund" type="_113" context="_817" access="public" location="f2:693" file="f2" line="693" offset="2432"/>
  <Field id="_1583" name="SpecProductMargin" type="_113" context="_817" access="public" location="f2:695" file="f2" line="695" offset="2496"/>
  <Field id="_1584" name="SpecProductFrozenMargin" type="_113" context="_817" access="public" location="f2:697" file="f2" line="697" offset="2560"/>
  <Field id="_1585" name="SpecProductCommission" type="_113" context="_817" access="public" location="f2:699" file="f2" line="699" offset="2624"/>
  <Field id="_1586" name="SpecProductFrozenCommission" type="_113" context="_817" access="public" location="f2:701" file="f2" line="701" offset="2688"/>
  <Field id="_1587" name="SpecProductPositionProfit" type="_113" context="_817" access="public" location="f2:703" file="f2" line="703" offset="2752"/>
  <Field id="_1588" name="SpecProductCloseProfit" type="_113" context="_817" access="public" location="f2:705" file="f2" line="705" offset="2816"/>
  <Field id="_1589" name="SpecProductPositionProfitByAlg" type="_113" context="_817" access="public" location="f2:707" file="f2" line="707" offset="2880"/>
  <Field id="_1590" name="SpecProductExchangeMargin" type="_113" context="_817" access="public" location="f2:709" file="f2" line="709" offset="2944"/>
  <Field id="_1591" name="BizType" type="_761" context="_817" access="public" location="f2:711" file="f2" line="711" offset="3008"/>
  <Field id="_1592" name="FrozenSwap" type="_113" context="_817" access="public" location="f2:713" file="f2" line="713" offset="3072"/>
  <Field id="_1593" name="RemainSwap" type="_113" context="_817" access="public" location="f2:715" file="f2" line="715" offset="3136"/>
  <Constructor id="_1594" name="CThostFtdcTradingAccountField" context="_817" access="public" location="f2:616" file="f2" line="616" inline="1" artificial="1"/>
  <Constructor id="_1595" name="CThostFtdcTradingAccountField" context="_817" access="public" location="f2:616" file="f2" line="616" inline="1" artificial="1">
    <Argument type="_6800" location="f2:616" file="f2" line="616"/>
  </Constructor>
  <OperatorMethod id="_1596" name="=" returns="_6801" context="_817" access="public" location="f2:616" file="f2" line="616" inline="1" artificial="1" mangled="_ZN29CThostFtdcTradingAccountFieldaSERKS_">
    <Argument type="_6800" location="f2:616" file="f2" line="616"/>
  </OperatorMethod>
  <Destructor id="_1597" name="CThostFtdcTradingAccountField" context="_817" access="public" location="f2:616" file="f2" line="616" inline="1" artificial="1"/>
  <Field id="_1598" name="InstrumentID" type="_19" context="_818" access="public" location="f2:722" file="f2" line="722" offset="0"/>
  <Field id="_1599" name="BrokerID" type="_10" context="_818" access="public" location="f2:724" file="f2" line="724" offset="248"/>
  <Field id="_1600" name="InvestorID" type="_9" context="_818" access="public" location="f2:726" file="f2" line="726" offset="336"/>
  <Field id="_1601" name="PosiDirection" type="_72" context="_818" access="public" location="f2:728" file="f2" line="728" offset="440"/>
  <Field id="_1602" name="HedgeFlag" type="_75" context="_818" access="public" location="f2:730" file="f2" line="730" offset="448"/>
  <Field id="_1603" name="PositionDate" type="_65" context="_818" access="public" location="f2:732" file="f2" line="732" offset="456"/>
  <Field id="_1604" name="YdPosition" type="_97" context="_818" access="public" location="f2:734" file="f2" line="734" offset="480"/>
  <Field id="_1605" name="Position" type="_97" context="_818" access="public" location="f2:736" file="f2" line="736" offset="512"/>
  <Field id="_1606" name="LongFrozen" type="_97" context="_818" access="public" location="f2:738" file="f2" line="738" offset="544"/>
  <Field id="_1607" name="ShortFrozen" type="_97" context="_818" access="public" location="f2:740" file="f2" line="740" offset="576"/>
  <Field id="_1608" name="LongFrozenAmount" type="_113" context="_818" access="public" location="f2:742" file="f2" line="742" offset="640"/>
  <Field id="_1609" name="ShortFrozenAmount" type="_113" context="_818" access="public" location="f2:744" file="f2" line="744" offset="704"/>
  <Field id="_1610" name="OpenVolume" type="_97" context="_818" access="public" location="f2:746" file="f2" line="746" offset="768"/>
  <Field id="_1611" name="CloseVolume" type="_97" context="_818" access="public" location="f2:748" file="f2" line="748" offset="800"/>
  <Field id="_1612" name="OpenAmount" type="_113" context="_818" access="public" location="f2:750" file="f2" line="750" offset="832"/>
  <Field id="_1613" name="CloseAmount" type="_113" context="_818" access="public" location="f2:752" file="f2" line="752" offset="896"/>
  <Field id="_1614" name="PositionCost" type="_113" context="_818" access="public" location="f2:754" file="f2" line="754" offset="960"/>
  <Field id="_1615" name="PreMargin" type="_113" context="_818" access="public" location="f2:756" file="f2" line="756" offset="1024"/>
  <Field id="_1616" name="UseMargin" type="_113" context="_818" access="public" location="f2:758" file="f2" line="758" offset="1088"/>
  <Field id="_1617" name="FrozenMargin" type="_113" context="_818" access="public" location="f2:760" file="f2" line="760" offset="1152"/>
  <Field id="_1618" name="FrozenCash" type="_113" context="_818" access="public" location="f2:762" file="f2" line="762" offset="1216"/>
  <Field id="_1619" name="FrozenCommission" type="_113" context="_818" access="public" location="f2:764" file="f2" line="764" offset="1280"/>
  <Field id="_1620" name="CashIn" type="_113" context="_818" access="public" location="f2:766" file="f2" line="766" offset="1344"/>
  <Field id="_1621" name="Commission" type="_113" context="_818" access="public" location="f2:768" file="f2" line="768" offset="1408"/>
  <Field id="_1622" name="CloseProfit" type="_113" context="_818" access="public" location="f2:770" file="f2" line="770" offset="1472"/>
  <Field id="_1623" name="PositionProfit" type="_113" context="_818" access="public" location="f2:772" file="f2" line="772" offset="1536"/>
  <Field id="_1624" name="PreSettlementPrice" type="_109" context="_818" access="public" location="f2:774" file="f2" line="774" offset="1600"/>
  <Field id="_1625" name="SettlementPrice" type="_109" context="_818" access="public" location="f2:776" file="f2" line="776" offset="1664"/>
  <Field id="_1626" name="TradingDay" type="_30" context="_818" access="public" location="f2:778" file="f2" line="778" offset="1728"/>
  <Field id="_1627" name="SettlementID" type="_96" context="_818" access="public" location="f2:780" file="f2" line="780" offset="1824"/>
  <Field id="_1628" name="OpenCost" type="_113" context="_818" access="public" location="f2:782" file="f2" line="782" offset="1856"/>
  <Field id="_1629" name="ExchangeMargin" type="_113" context="_818" access="public" location="f2:784" file="f2" line="784" offset="1920"/>
  <Field id="_1630" name="CombPosition" type="_97" context="_818" access="public" location="f2:786" file="f2" line="786" offset="1984"/>
  <Field id="_1631" name="CombLongFrozen" type="_97" context="_818" access="public" location="f2:788" file="f2" line="788" offset="2016"/>
  <Field id="_1632" name="CombShortFrozen" type="_97" context="_818" access="public" location="f2:790" file="f2" line="790" offset="2048"/>
  <Field id="_1633" name="CloseProfitByDate" type="_113" context="_818" access="public" location="f2:792" file="f2" line="792" offset="2112"/>
  <Field id="_1634" name="CloseProfitByTrade" type="_113" context="_818" access="public" location="f2:794" file="f2" line="794" offset="2176"/>
  <Field id="_1635" name="TodayPosition" type="_97" context="_818" access="public" location="f2:796" file="f2" line="796" offset="2240"/>
  <Field id="_1636" name="MarginRateByMoney" type="_112" context="_818" access="public" location="f2:798" file="f2" line="798" offset="2304"/>
  <Field id="_1637" name="MarginRateByVolume" type="_112" context="_818" access="public" location="f2:800" file="f2" line="800" offset="2368"/>
  <Field id="_1638" name="StrikeFrozen" type="_97" context="_818" access="public" location="f2:802" file="f2" line="802" offset="2432"/>
  <Field id="_1639" name="StrikeFrozenAmount" type="_113" context="_818" access="public" location="f2:804" file="f2" line="804" offset="2496"/>
  <Field id="_1640" name="AbandonFrozen" type="_97" context="_818" access="public" location="f2:806" file="f2" line="806" offset="2560"/>
  <Field id="_1641" name="ExchangeID" type="_23" context="_818" access="public" location="f2:808" file="f2" line="808" offset="2592"/>
  <Field id="_1642" name="YdStrikeFrozen" type="_97" context="_818" access="public" location="f2:810" file="f2" line="810" offset="2688"/>
  <Field id="_1643" name="InvestUnitID" type="_748" context="_818" access="public" location="f2:812" file="f2" line="812" offset="2720"/>
  <Field id="_1644" name="PositionCostOffset" type="_113" context="_818" access="public" location="f2:814" file="f2" line="814" offset="2880"/>
  <Constructor id="_1645" name="CThostFtdcInvestorPositionField" context="_818" access="public" location="f2:719" file="f2" line="719" inline="1" artificial="1"/>
  <Constructor id="_1646" name="CThostFtdcInvestorPositionField" context="_818" access="public" location="f2:719" file="f2" line="719" inline="1" artificial="1">
    <Argument type="_6802" location="f2:719" file="f2" line="719"/>
  </Constructor>
  <OperatorMethod id="_1647" name="=" returns="_6803" context="_818" access="public" location="f2:719" file="f2" line="719" inline="1" artificial="1" mangled="_ZN31CThostFtdcInvestorPositionFieldaSERKS_">
    <Argument type="_6802" location="f2:719" file="f2" line="719"/>
  </OperatorMethod>
  <Destructor id="_1648" name="CThostFtdcInvestorPositionField" context="_818" access="public" location="f2:719" file="f2" line="719" inline="1" artificial="1"/>
  <Field id="_1649" name="InstrumentID" type="_19" context="_819" access="public" location="f2:821" file="f2" line="821" offset="0"/>
  <Field id="_1650" name="InvestorRange" type="_54" context="_819" access="public" location="f2:823" file="f2" line="823" offset="248"/>
  <Field id="_1651" name="BrokerID" type="_10" context="_819" access="public" location="f2:825" file="f2" line="825" offset="256"/>
  <Field id="_1652" name="InvestorID" type="_9" context="_819" access="public" location="f2:827" file="f2" line="827" offset="344"/>
  <Field id="_1653" name="HedgeFlag" type="_75" context="_819" access="public" location="f2:829" file="f2" line="829" offset="448"/>
  <Field id="_1654" name="LongMarginRatioByMoney" type="_112" context="_819" access="public" location="f2:831" file="f2" line="831" offset="512"/>
  <Field id="_1655" name="LongMarginRatioByVolume" type="_113" context="_819" access="public" location="f2:833" file="f2" line="833" offset="576"/>
  <Field id="_1656" name="ShortMarginRatioByMoney" type="_112" context="_819" access="public" location="f2:835" file="f2" line="835" offset="640"/>
  <Field id="_1657" name="ShortMarginRatioByVolume" type="_113" context="_819" access="public" location="f2:837" file="f2" line="837" offset="704"/>
  <Field id="_1658" name="IsRelative" type="_108" context="_819" access="public" location="f2:839" file="f2" line="839" offset="768"/>
  <Field id="_1659" name="ExchangeID" type="_23" context="_819" access="public" location="f2:841" file="f2" line="841" offset="800"/>
  <Field id="_1660" name="InvestUnitID" type="_748" context="_819" access="public" location="f2:843" file="f2" line="843" offset="872"/>
  <Constructor id="_1661" name="CThostFtdcInstrumentMarginRateField" context="_819" access="public" location="f2:818" file="f2" line="818" inline="1" artificial="1"/>
  <Constructor id="_1662" name="CThostFtdcInstrumentMarginRateField" context="_819" access="public" location="f2:818" file="f2" line="818" inline="1" artificial="1">
    <Argument type="_6804" location="f2:818" file="f2" line="818"/>
  </Constructor>
  <OperatorMethod id="_1663" name="=" returns="_6805" context="_819" access="public" location="f2:818" file="f2" line="818" inline="1" artificial="1" mangled="_ZN35CThostFtdcInstrumentMarginRateFieldaSERKS_">
    <Argument type="_6804" location="f2:818" file="f2" line="818"/>
  </OperatorMethod>
  <Destructor id="_1664" name="CThostFtdcInstrumentMarginRateField" context="_819" access="public" location="f2:818" file="f2" line="818" inline="1" artificial="1"/>
  <Field id="_1665" name="InstrumentID" type="_19" context="_820" access="public" location="f2:850" file="f2" line="850" offset="0"/>
  <Field id="_1666" name="InvestorRange" type="_54" context="_820" access="public" location="f2:852" file="f2" line="852" offset="248"/>
  <Field id="_1667" name="BrokerID" type="_10" context="_820" access="public" location="f2:854" file="f2" line="854" offset="256"/>
  <Field id="_1668" name="InvestorID" type="_9" context="_820" access="public" location="f2:856" file="f2" line="856" offset="344"/>
  <Field id="_1669" name="OpenRatioByMoney" type="_112" context="_820" access="public" location="f2:858" file="f2" line="858" offset="448"/>
  <Field id="_1670" name="OpenRatioByVolume" type="_112" context="_820" access="public" location="f2:860" file="f2" line="860" offset="512"/>
  <Field id="_1671" name="CloseRatioByMoney" type="_112" context="_820" access="public" location="f2:862" file="f2" line="862" offset="576"/>
  <Field id="_1672" name="CloseRatioByVolume" type="_112" context="_820" access="public" location="f2:864" file="f2" line="864" offset="640"/>
  <Field id="_1673" name="CloseTodayRatioByMoney" type="_112" context="_820" access="public" location="f2:866" file="f2" line="866" offset="704"/>
  <Field id="_1674" name="CloseTodayRatioByVolume" type="_112" context="_820" access="public" location="f2:868" file="f2" line="868" offset="768"/>
  <Field id="_1675" name="ExchangeID" type="_23" context="_820" access="public" location="f2:870" file="f2" line="870" offset="832"/>
  <Field id="_1676" name="BizType" type="_761" context="_820" access="public" location="f2:872" file="f2" line="872" offset="904"/>
  <Field id="_1677" name="InvestUnitID" type="_748" context="_820" access="public" location="f2:874" file="f2" line="874" offset="912"/>
  <Constructor id="_1678" name="CThostFtdcInstrumentCommissionRateField" context="_820" access="public" location="f2:847" file="f2" line="847" inline="1" artificial="1"/>
  <Constructor id="_1679" name="CThostFtdcInstrumentCommissionRateField" context="_820" access="public" location="f2:847" file="f2" line="847" inline="1" artificial="1">
    <Argument type="_6806" location="f2:847" file="f2" line="847"/>
  </Constructor>
  <OperatorMethod id="_1680" name="=" returns="_6807" context="_820" access="public" location="f2:847" file="f2" line="847" inline="1" artificial="1" mangled="_ZN39CThostFtdcInstrumentCommissionRateFieldaSERKS_">
    <Argument type="_6806" location="f2:847" file="f2" line="847"/>
  </OperatorMethod>
  <Destructor id="_1681" name="CThostFtdcInstrumentCommissionRateField" context="_820" access="public" location="f2:847" file="f2" line="847" inline="1" artificial="1"/>
  <Field id="_1682" name="TradingDay" type="_30" context="_821" access="public" location="f2:881" file="f2" line="881" offset="0"/>
  <Field id="_1683" name="InstrumentID" type="_19" context="_821" access="public" location="f2:883" file="f2" line="883" offset="72"/>
  <Field id="_1684" name="ExchangeID" type="_23" context="_821" access="public" location="f2:885" file="f2" line="885" offset="320"/>
  <Field id="_1685" name="ExchangeInstID" type="_13" context="_821" access="public" location="f2:887" file="f2" line="887" offset="392"/>
  <Field id="_1686" name="LastPrice" type="_109" context="_821" access="public" location="f2:889" file="f2" line="889" offset="640"/>
  <Field id="_1687" name="PreSettlementPrice" type="_109" context="_821" access="public" location="f2:891" file="f2" line="891" offset="704"/>
  <Field id="_1688" name="PreClosePrice" type="_109" context="_821" access="public" location="f2:893" file="f2" line="893" offset="768"/>
  <Field id="_1689" name="PreOpenInterest" type="_114" context="_821" access="public" location="f2:895" file="f2" line="895" offset="832"/>
  <Field id="_1690" name="OpenPrice" type="_109" context="_821" access="public" location="f2:897" file="f2" line="897" offset="896"/>
  <Field id="_1691" name="HighestPrice" type="_109" context="_821" access="public" location="f2:899" file="f2" line="899" offset="960"/>
  <Field id="_1692" name="LowestPrice" type="_109" context="_821" access="public" location="f2:901" file="f2" line="901" offset="1024"/>
  <Field id="_1693" name="Volume" type="_97" context="_821" access="public" location="f2:903" file="f2" line="903" offset="1088"/>
  <Field id="_1694" name="Turnover" type="_113" context="_821" access="public" location="f2:905" file="f2" line="905" offset="1152"/>
  <Field id="_1695" name="OpenInterest" type="_114" context="_821" access="public" location="f2:907" file="f2" line="907" offset="1216"/>
  <Field id="_1696" name="ClosePrice" type="_109" context="_821" access="public" location="f2:909" file="f2" line="909" offset="1280"/>
  <Field id="_1697" name="SettlementPrice" type="_109" context="_821" access="public" location="f2:911" file="f2" line="911" offset="1344"/>
  <Field id="_1698" name="UpperLimitPrice" type="_109" context="_821" access="public" location="f2:913" file="f2" line="913" offset="1408"/>
  <Field id="_1699" name="LowerLimitPrice" type="_109" context="_821" access="public" location="f2:915" file="f2" line="915" offset="1472"/>
  <Field id="_1700" name="PreDelta" type="_112" context="_821" access="public" location="f2:917" file="f2" line="917" offset="1536"/>
  <Field id="_1701" name="CurrDelta" type="_112" context="_821" access="public" location="f2:919" file="f2" line="919" offset="1600"/>
  <Field id="_1702" name="UpdateTime" type="_31" context="_821" access="public" location="f2:921" file="f2" line="921" offset="1664"/>
  <Field id="_1703" name="UpdateMillisec" type="_102" context="_821" access="public" location="f2:923" file="f2" line="923" offset="1760"/>
  <Field id="_1704" name="BidPrice1" type="_109" context="_821" access="public" location="f2:925" file="f2" line="925" offset="1792"/>
  <Field id="_1705" name="BidVolume1" type="_97" context="_821" access="public" location="f2:927" file="f2" line="927" offset="1856"/>
  <Field id="_1706" name="AskPrice1" type="_109" context="_821" access="public" location="f2:929" file="f2" line="929" offset="1920"/>
  <Field id="_1707" name="AskVolume1" type="_97" context="_821" access="public" location="f2:931" file="f2" line="931" offset="1984"/>
  <Field id="_1708" name="BidPrice2" type="_109" context="_821" access="public" location="f2:933" file="f2" line="933" offset="2048"/>
  <Field id="_1709" name="BidVolume2" type="_97" context="_821" access="public" location="f2:935" file="f2" line="935" offset="2112"/>
  <Field id="_1710" name="AskPrice2" type="_109" context="_821" access="public" location="f2:937" file="f2" line="937" offset="2176"/>
  <Field id="_1711" name="AskVolume2" type="_97" context="_821" access="public" location="f2:939" file="f2" line="939" offset="2240"/>
  <Field id="_1712" name="BidPrice3" type="_109" context="_821" access="public" location="f2:941" file="f2" line="941" offset="2304"/>
  <Field id="_1713" name="BidVolume3" type="_97" context="_821" access="public" location="f2:943" file="f2" line="943" offset="2368"/>
  <Field id="_1714" name="AskPrice3" type="_109" context="_821" access="public" location="f2:945" file="f2" line="945" offset="2432"/>
  <Field id="_1715" name="AskVolume3" type="_97" context="_821" access="public" location="f2:947" file="f2" line="947" offset="2496"/>
  <Field id="_1716" name="BidPrice4" type="_109" context="_821" access="public" location="f2:949" file="f2" line="949" offset="2560"/>
  <Field id="_1717" name="BidVolume4" type="_97" context="_821" access="public" location="f2:951" file="f2" line="951" offset="2624"/>
  <Field id="_1718" name="AskPrice4" type="_109" context="_821" access="public" location="f2:953" file="f2" line="953" offset="2688"/>
  <Field id="_1719" name="AskVolume4" type="_97" context="_821" access="public" location="f2:955" file="f2" line="955" offset="2752"/>
  <Field id="_1720" name="BidPrice5" type="_109" context="_821" access="public" location="f2:957" file="f2" line="957" offset="2816"/>
  <Field id="_1721" name="BidVolume5" type="_97" context="_821" access="public" location="f2:959" file="f2" line="959" offset="2880"/>
  <Field id="_1722" name="AskPrice5" type="_109" context="_821" access="public" location="f2:961" file="f2" line="961" offset="2944"/>
  <Field id="_1723" name="AskVolume5" type="_97" context="_821" access="public" location="f2:963" file="f2" line="963" offset="3008"/>
  <Field id="_1724" name="AveragePrice" type="_109" context="_821" access="public" location="f2:965" file="f2" line="965" offset="3072"/>
  <Field id="_1725" name="ActionDay" type="_30" context="_821" access="public" location="f2:967" file="f2" line="967" offset="3136"/>
  <Constructor id="_1726" name="CThostFtdcDepthMarketDataField" context="_821" access="public" location="f2:878" file="f2" line="878" inline="1" artificial="1"/>
  <Constructor id="_1727" name="CThostFtdcDepthMarketDataField" context="_821" access="public" location="f2:878" file="f2" line="878" inline="1" artificial="1">
    <Argument type="_6808" location="f2:878" file="f2" line="878"/>
  </Constructor>
  <OperatorMethod id="_1728" name="=" returns="_6809" context="_821" access="public" location="f2:878" file="f2" line="878" inline="1" artificial="1" mangled="_ZN30CThostFtdcDepthMarketDataFieldaSERKS_">
    <Argument type="_6808" location="f2:878" file="f2" line="878"/>
  </OperatorMethod>
  <Destructor id="_1729" name="CThostFtdcDepthMarketDataField" context="_821" access="public" location="f2:878" file="f2" line="878" inline="1" artificial="1"/>
  <Field id="_1730" name="InstrumentID" type="_19" context="_822" access="public" location="f2:974" file="f2" line="974" offset="0"/>
  <Field id="_1731" name="InvestorRange" type="_54" context="_822" access="public" location="f2:976" file="f2" line="976" offset="248"/>
  <Field id="_1732" name="BrokerID" type="_10" context="_822" access="public" location="f2:978" file="f2" line="978" offset="256"/>
  <Field id="_1733" name="InvestorID" type="_9" context="_822" access="public" location="f2:980" file="f2" line="980" offset="344"/>
  <Field id="_1734" name="TradingRight" type="_86" context="_822" access="public" location="f2:982" file="f2" line="982" offset="448"/>
  <Constructor id="_1735" name="CThostFtdcInstrumentTradingRightField" context="_822" access="public" location="f2:971" file="f2" line="971" inline="1" artificial="1"/>
  <Constructor id="_1736" name="CThostFtdcInstrumentTradingRightField" context="_822" access="public" location="f2:971" file="f2" line="971" inline="1" artificial="1">
    <Argument type="_6810" location="f2:971" file="f2" line="971"/>
  </Constructor>
  <OperatorMethod id="_1737" name="=" returns="_6811" context="_822" access="public" location="f2:971" file="f2" line="971" inline="1" artificial="1" mangled="_ZN37CThostFtdcInstrumentTradingRightFieldaSERKS_">
    <Argument type="_6810" location="f2:971" file="f2" line="971"/>
  </OperatorMethod>
  <Destructor id="_1738" name="CThostFtdcInstrumentTradingRightField" context="_822" access="public" location="f2:971" file="f2" line="971" inline="1" artificial="1"/>
  <Field id="_1739" name="BrokerID" type="_10" context="_823" access="public" location="f2:989" file="f2" line="989" offset="0"/>
  <Field id="_1740" name="UserID" type="_16" context="_823" access="public" location="f2:991" file="f2" line="991" offset="88"/>
  <Field id="_1741" name="UserName" type="_47" context="_823" access="public" location="f2:993" file="f2" line="993" offset="216"/>
  <Field id="_1742" name="UserType" type="_260" context="_823" access="public" location="f2:995" file="f2" line="995" offset="864"/>
  <Field id="_1743" name="IsActive" type="_108" context="_823" access="public" location="f2:997" file="f2" line="997" offset="896"/>
  <Field id="_1744" name="IsUsingOTP" type="_108" context="_823" access="public" location="f2:999" file="f2" line="999" offset="928"/>
  <Field id="_1745" name="IsAuthForce" type="_108" context="_823" access="public" location="f2:1001" file="f2" line="1001" offset="960"/>
  <Constructor id="_1746" name="CThostFtdcBrokerUserField" context="_823" access="public" location="f2:986" file="f2" line="986" inline="1" artificial="1"/>
  <Constructor id="_1747" name="CThostFtdcBrokerUserField" context="_823" access="public" location="f2:986" file="f2" line="986" inline="1" artificial="1">
    <Argument type="_6812" location="f2:986" file="f2" line="986"/>
  </Constructor>
  <OperatorMethod id="_1748" name="=" returns="_6813" context="_823" access="public" location="f2:986" file="f2" line="986" inline="1" artificial="1" mangled="_ZN25CThostFtdcBrokerUserFieldaSERKS_">
    <Argument type="_6812" location="f2:986" file="f2" line="986"/>
  </OperatorMethod>
  <Destructor id="_1749" name="CThostFtdcBrokerUserField" context="_823" access="public" location="f2:986" file="f2" line="986" inline="1" artificial="1"/>
  <Field id="_1750" name="BrokerID" type="_10" context="_824" access="public" location="f2:1008" file="f2" line="1008" offset="0"/>
  <Field id="_1751" name="UserID" type="_16" context="_824" access="public" location="f2:1010" file="f2" line="1010" offset="88"/>
  <Field id="_1752" name="Password" type="_17" context="_824" access="public" location="f2:1012" file="f2" line="1012" offset="216"/>
  <Field id="_1753" name="LastUpdateTime" type="_757" context="_824" access="public" location="f2:1014" file="f2" line="1014" offset="544"/>
  <Field id="_1754" name="LastLoginTime" type="_757" context="_824" access="public" location="f2:1016" file="f2" line="1016" offset="680"/>
  <Field id="_1755" name="ExpireDate" type="_30" context="_824" access="public" location="f2:1018" file="f2" line="1018" offset="816"/>
  <Field id="_1756" name="WeakExpireDate" type="_30" context="_824" access="public" location="f2:1020" file="f2" line="1020" offset="888"/>
  <Constructor id="_1757" name="CThostFtdcBrokerUserPasswordField" context="_824" access="public" location="f2:1005" file="f2" line="1005" inline="1" artificial="1"/>
  <Constructor id="_1758" name="CThostFtdcBrokerUserPasswordField" context="_824" access="public" location="f2:1005" file="f2" line="1005" inline="1" artificial="1">
    <Argument type="_6814" location="f2:1005" file="f2" line="1005"/>
  </Constructor>
  <OperatorMethod id="_1759" name="=" returns="_6815" context="_824" access="public" location="f2:1005" file="f2" line="1005" inline="1" artificial="1" mangled="_ZN33CThostFtdcBrokerUserPasswordFieldaSERKS_">
    <Argument type="_6814" location="f2:1005" file="f2" line="1005"/>
  </OperatorMethod>
  <Destructor id="_1760" name="CThostFtdcBrokerUserPasswordField" context="_824" access="public" location="f2:1005" file="f2" line="1005" inline="1" artificial="1"/>
  <Field id="_1761" name="BrokerID" type="_10" context="_825" access="public" location="f2:1027" file="f2" line="1027" offset="0"/>
  <Field id="_1762" name="UserID" type="_16" context="_825" access="public" location="f2:1029" file="f2" line="1029" offset="88"/>
  <Field id="_1763" name="BrokerFunctionCode" type="_61" context="_825" access="public" location="f2:1031" file="f2" line="1031" offset="216"/>
  <Constructor id="_1764" name="CThostFtdcBrokerUserFunctionField" context="_825" access="public" location="f2:1024" file="f2" line="1024" inline="1" artificial="1"/>
  <Constructor id="_1765" name="CThostFtdcBrokerUserFunctionField" context="_825" access="public" location="f2:1024" file="f2" line="1024" inline="1" artificial="1">
    <Argument type="_6816" location="f2:1024" file="f2" line="1024"/>
  </Constructor>
  <OperatorMethod id="_1766" name="=" returns="_6817" context="_825" access="public" location="f2:1024" file="f2" line="1024" inline="1" artificial="1" mangled="_ZN33CThostFtdcBrokerUserFunctionFieldaSERKS_">
    <Argument type="_6816" location="f2:1024" file="f2" line="1024"/>
  </OperatorMethod>
  <Destructor id="_1767" name="CThostFtdcBrokerUserFunctionField" context="_825" access="public" location="f2:1024" file="f2" line="1024" inline="1" artificial="1"/>
  <Field id="_1768" name="ExchangeID" type="_23" context="_826" access="public" location="f2:1038" file="f2" line="1038" offset="0"/>
  <Field id="_1769" name="TraderID" type="_8" context="_826" access="public" location="f2:1040" file="f2" line="1040" offset="72"/>
  <Field id="_1770" name="ParticipantID" type="_15" context="_826" access="public" location="f2:1042" file="f2" line="1042" offset="240"/>
  <Field id="_1771" name="Password" type="_17" context="_826" access="public" location="f2:1044" file="f2" line="1044" offset="328"/>
  <Field id="_1772" name="InstallID" type="_94" context="_826" access="public" location="f2:1046" file="f2" line="1046" offset="672"/>
  <Field id="_1773" name="OrderLocalID" type="_46" context="_826" access="public" location="f2:1048" file="f2" line="1048" offset="704"/>
  <Field id="_1774" name="TraderConnectStatus" type="_59" context="_826" access="public" location="f2:1050" file="f2" line="1050" offset="808"/>
  <Field id="_1775" name="ConnectRequestDate" type="_30" context="_826" access="public" location="f2:1052" file="f2" line="1052" offset="816"/>
  <Field id="_1776" name="ConnectRequestTime" type="_31" context="_826" access="public" location="f2:1054" file="f2" line="1054" offset="888"/>
  <Field id="_1777" name="LastReportDate" type="_30" context="_826" access="public" location="f2:1056" file="f2" line="1056" offset="960"/>
  <Field id="_1778" name="LastReportTime" type="_31" context="_826" access="public" location="f2:1058" file="f2" line="1058" offset="1032"/>
  <Field id="_1779" name="ConnectDate" type="_30" context="_826" access="public" location="f2:1060" file="f2" line="1060" offset="1104"/>
  <Field id="_1780" name="ConnectTime" type="_31" context="_826" access="public" location="f2:1062" file="f2" line="1062" offset="1176"/>
  <Field id="_1781" name="StartDate" type="_30" context="_826" access="public" location="f2:1064" file="f2" line="1064" offset="1248"/>
  <Field id="_1782" name="StartTime" type="_31" context="_826" access="public" location="f2:1066" file="f2" line="1066" offset="1320"/>
  <Field id="_1783" name="TradingDay" type="_30" context="_826" access="public" location="f2:1068" file="f2" line="1068" offset="1392"/>
  <Field id="_1784" name="BrokerID" type="_10" context="_826" access="public" location="f2:1070" file="f2" line="1070" offset="1464"/>
  <Field id="_1785" name="MaxTradeID" type="_36" context="_826" access="public" location="f2:1072" file="f2" line="1072" offset="1552"/>
  <Field id="_1786" name="MaxOrderMessageReference" type="_350" context="_826" access="public" location="f2:1074" file="f2" line="1074" offset="1720"/>
  <Constructor id="_1787" name="CThostFtdcTraderOfferField" context="_826" access="public" location="f2:1035" file="f2" line="1035" inline="1" artificial="1"/>
  <Constructor id="_1788" name="CThostFtdcTraderOfferField" context="_826" access="public" location="f2:1035" file="f2" line="1035" inline="1" artificial="1">
    <Argument type="_6818" location="f2:1035" file="f2" line="1035"/>
  </Constructor>
  <OperatorMethod id="_1789" name="=" returns="_6819" context="_826" access="public" location="f2:1035" file="f2" line="1035" inline="1" artificial="1" mangled="_ZN26CThostFtdcTraderOfferFieldaSERKS_">
    <Argument type="_6818" location="f2:1035" file="f2" line="1035"/>
  </OperatorMethod>
  <Destructor id="_1790" name="CThostFtdcTraderOfferField" context="_826" access="public" location="f2:1035" file="f2" line="1035" inline="1" artificial="1"/>
  <Field id="_1791" name="TradingDay" type="_30" context="_827" access="public" location="f2:1081" file="f2" line="1081" offset="0"/>
  <Field id="_1792" name="SettlementID" type="_96" context="_827" access="public" location="f2:1083" file="f2" line="1083" offset="96"/>
  <Field id="_1793" name="BrokerID" type="_10" context="_827" access="public" location="f2:1085" file="f2" line="1085" offset="128"/>
  <Field id="_1794" name="InvestorID" type="_9" context="_827" access="public" location="f2:1087" file="f2" line="1087" offset="216"/>
  <Field id="_1795" name="SequenceNo" type="_100" context="_827" access="public" location="f2:1089" file="f2" line="1089" offset="320"/>
  <Field id="_1796" name="Content" type="_53" context="_827" access="public" location="f2:1091" file="f2" line="1091" offset="352"/>
  <Field id="_1797" name="AccountID" type="_170" context="_827" access="public" location="f2:1093" file="f2" line="1093" offset="4360"/>
  <Field id="_1798" name="CurrencyID" type="_335" context="_827" access="public" location="f2:1095" file="f2" line="1095" offset="4464"/>
  <Constructor id="_1799" name="CThostFtdcSettlementInfoField" context="_827" access="public" location="f2:1078" file="f2" line="1078" inline="1" artificial="1"/>
  <Constructor id="_1800" name="CThostFtdcSettlementInfoField" context="_827" access="public" location="f2:1078" file="f2" line="1078" inline="1" artificial="1">
    <Argument type="_6820" location="f2:1078" file="f2" line="1078"/>
  </Constructor>
  <OperatorMethod id="_1801" name="=" returns="_6821" context="_827" access="public" location="f2:1078" file="f2" line="1078" inline="1" artificial="1" mangled="_ZN29CThostFtdcSettlementInfoFieldaSERKS_">
    <Argument type="_6820" location="f2:1078" file="f2" line="1078"/>
  </OperatorMethod>
  <Destructor id="_1802" name="CThostFtdcSettlementInfoField" context="_827" access="public" location="f2:1078" file="f2" line="1078" inline="1" artificial="1"/>
  <Field id="_1803" name="InstrumentID" type="_19" context="_828" access="public" location="f2:1102" file="f2" line="1102" offset="0"/>
  <Field id="_1804" name="InvestorRange" type="_54" context="_828" access="public" location="f2:1104" file="f2" line="1104" offset="248"/>
  <Field id="_1805" name="BrokerID" type="_10" context="_828" access="public" location="f2:1106" file="f2" line="1106" offset="256"/>
  <Field id="_1806" name="InvestorID" type="_9" context="_828" access="public" location="f2:1108" file="f2" line="1108" offset="344"/>
  <Field id="_1807" name="HedgeFlag" type="_75" context="_828" access="public" location="f2:1110" file="f2" line="1110" offset="448"/>
  <Field id="_1808" name="LongMarginRatioByMoney" type="_112" context="_828" access="public" location="f2:1112" file="f2" line="1112" offset="512"/>
  <Field id="_1809" name="LongMarginRatioByVolume" type="_113" context="_828" access="public" location="f2:1114" file="f2" line="1114" offset="576"/>
  <Field id="_1810" name="ShortMarginRatioByMoney" type="_112" context="_828" access="public" location="f2:1116" file="f2" line="1116" offset="640"/>
  <Field id="_1811" name="ShortMarginRatioByVolume" type="_113" context="_828" access="public" location="f2:1118" file="f2" line="1118" offset="704"/>
  <Field id="_1812" name="IsRelative" type="_108" context="_828" access="public" location="f2:1120" file="f2" line="1120" offset="768"/>
  <Constructor id="_1813" name="CThostFtdcInstrumentMarginRateAdjustField" context="_828" access="public" location="f2:1099" file="f2" line="1099" inline="1" artificial="1"/>
  <Constructor id="_1814" name="CThostFtdcInstrumentMarginRateAdjustField" context="_828" access="public" location="f2:1099" file="f2" line="1099" inline="1" artificial="1">
    <Argument type="_6822" location="f2:1099" file="f2" line="1099"/>
  </Constructor>
  <OperatorMethod id="_1815" name="=" returns="_6823" context="_828" access="public" location="f2:1099" file="f2" line="1099" inline="1" artificial="1" mangled="_ZN41CThostFtdcInstrumentMarginRateAdjustFieldaSERKS_">
    <Argument type="_6822" location="f2:1099" file="f2" line="1099"/>
  </OperatorMethod>
  <Destructor id="_1816" name="CThostFtdcInstrumentMarginRateAdjustField" context="_828" access="public" location="f2:1099" file="f2" line="1099" inline="1" artificial="1"/>
  <Field id="_1817" name="BrokerID" type="_10" context="_829" access="public" location="f2:1127" file="f2" line="1127" offset="0"/>
  <Field id="_1818" name="InstrumentID" type="_19" context="_829" access="public" location="f2:1129" file="f2" line="1129" offset="88"/>
  <Field id="_1819" name="HedgeFlag" type="_75" context="_829" access="public" location="f2:1131" file="f2" line="1131" offset="336"/>
  <Field id="_1820" name="LongMarginRatioByMoney" type="_112" context="_829" access="public" location="f2:1133" file="f2" line="1133" offset="384"/>
  <Field id="_1821" name="LongMarginRatioByVolume" type="_113" context="_829" access="public" location="f2:1135" file="f2" line="1135" offset="448"/>
  <Field id="_1822" name="ShortMarginRatioByMoney" type="_112" context="_829" access="public" location="f2:1137" file="f2" line="1137" offset="512"/>
  <Field id="_1823" name="ShortMarginRatioByVolume" type="_113" context="_829" access="public" location="f2:1139" file="f2" line="1139" offset="576"/>
  <Field id="_1824" name="ExchangeID" type="_23" context="_829" access="public" location="f2:1141" file="f2" line="1141" offset="640"/>
  <Constructor id="_1825" name="CThostFtdcExchangeMarginRateField" context="_829" access="public" location="f2:1124" file="f2" line="1124" inline="1" artificial="1"/>
  <Constructor id="_1826" name="CThostFtdcExchangeMarginRateField" context="_829" access="public" location="f2:1124" file="f2" line="1124" inline="1" artificial="1">
    <Argument type="_6824" location="f2:1124" file="f2" line="1124"/>
  </Constructor>
  <OperatorMethod id="_1827" name="=" returns="_6825" context="_829" access="public" location="f2:1124" file="f2" line="1124" inline="1" artificial="1" mangled="_ZN33CThostFtdcExchangeMarginRateFieldaSERKS_">
    <Argument type="_6824" location="f2:1124" file="f2" line="1124"/>
  </OperatorMethod>
  <Destructor id="_1828" name="CThostFtdcExchangeMarginRateField" context="_829" access="public" location="f2:1124" file="f2" line="1124" inline="1" artificial="1"/>
  <Field id="_1829" name="BrokerID" type="_10" context="_830" access="public" location="f2:1148" file="f2" line="1148" offset="0"/>
  <Field id="_1830" name="InstrumentID" type="_19" context="_830" access="public" location="f2:1150" file="f2" line="1150" offset="88"/>
  <Field id="_1831" name="HedgeFlag" type="_75" context="_830" access="public" location="f2:1152" file="f2" line="1152" offset="336"/>
  <Field id="_1832" name="LongMarginRatioByMoney" type="_112" context="_830" access="public" location="f2:1154" file="f2" line="1154" offset="384"/>
  <Field id="_1833" name="LongMarginRatioByVolume" type="_113" context="_830" access="public" location="f2:1156" file="f2" line="1156" offset="448"/>
  <Field id="_1834" name="ShortMarginRatioByMoney" type="_112" context="_830" access="public" location="f2:1158" file="f2" line="1158" offset="512"/>
  <Field id="_1835" name="ShortMarginRatioByVolume" type="_113" context="_830" access="public" location="f2:1160" file="f2" line="1160" offset="576"/>
  <Field id="_1836" name="ExchLongMarginRatioByMoney" type="_112" context="_830" access="public" location="f2:1162" file="f2" line="1162" offset="640"/>
  <Field id="_1837" name="ExchLongMarginRatioByVolume" type="_113" context="_830" access="public" location="f2:1164" file="f2" line="1164" offset="704"/>
  <Field id="_1838" name="ExchShortMarginRatioByMoney" type="_112" context="_830" access="public" location="f2:1166" file="f2" line="1166" offset="768"/>
  <Field id="_1839" name="ExchShortMarginRatioByVolume" type="_113" context="_830" access="public" location="f2:1168" file="f2" line="1168" offset="832"/>
  <Field id="_1840" name="NoLongMarginRatioByMoney" type="_112" context="_830" access="public" location="f2:1170" file="f2" line="1170" offset="896"/>
  <Field id="_1841" name="NoLongMarginRatioByVolume" type="_113" context="_830" access="public" location="f2:1172" file="f2" line="1172" offset="960"/>
  <Field id="_1842" name="NoShortMarginRatioByMoney" type="_112" context="_830" access="public" location="f2:1174" file="f2" line="1174" offset="1024"/>
  <Field id="_1843" name="NoShortMarginRatioByVolume" type="_113" context="_830" access="public" location="f2:1176" file="f2" line="1176" offset="1088"/>
  <Constructor id="_1844" name="CThostFtdcExchangeMarginRateAdjustField" context="_830" access="public" location="f2:1145" file="f2" line="1145" inline="1" artificial="1"/>
  <Constructor id="_1845" name="CThostFtdcExchangeMarginRateAdjustField" context="_830" access="public" location="f2:1145" file="f2" line="1145" inline="1" artificial="1">
    <Argument type="_6826" location="f2:1145" file="f2" line="1145"/>
  </Constructor>
  <OperatorMethod id="_1846" name="=" returns="_6827" context="_830" access="public" location="f2:1145" file="f2" line="1145" inline="1" artificial="1" mangled="_ZN39CThostFtdcExchangeMarginRateAdjustFieldaSERKS_">
    <Argument type="_6826" location="f2:1145" file="f2" line="1145"/>
  </OperatorMethod>
  <Destructor id="_1847" name="CThostFtdcExchangeMarginRateAdjustField" context="_830" access="public" location="f2:1145" file="f2" line="1145" inline="1" artificial="1"/>
  <Field id="_1848" name="BrokerID" type="_10" context="_831" access="public" location="f2:1183" file="f2" line="1183" offset="0"/>
  <Field id="_1849" name="FromCurrencyID" type="_335" context="_831" access="public" location="f2:1185" file="f2" line="1185" offset="88"/>
  <Field id="_1850" name="FromCurrencyUnit" type="_639" context="_831" access="public" location="f2:1187" file="f2" line="1187" offset="128"/>
  <Field id="_1851" name="ToCurrencyID" type="_335" context="_831" access="public" location="f2:1189" file="f2" line="1189" offset="192"/>
  <Field id="_1852" name="ExchangeRate" type="_640" context="_831" access="public" location="f2:1191" file="f2" line="1191" offset="256"/>
  <Constructor id="_1853" name="CThostFtdcExchangeRateField" context="_831" access="public" location="f2:1180" file="f2" line="1180" inline="1" artificial="1"/>
  <Constructor id="_1854" name="CThostFtdcExchangeRateField" context="_831" access="public" location="f2:1180" file="f2" line="1180" inline="1" artificial="1">
    <Argument type="_6828" location="f2:1180" file="f2" line="1180"/>
  </Constructor>
  <OperatorMethod id="_1855" name="=" returns="_6829" context="_831" access="public" location="f2:1180" file="f2" line="1180" inline="1" artificial="1" mangled="_ZN27CThostFtdcExchangeRateFieldaSERKS_">
    <Argument type="_6828" location="f2:1180" file="f2" line="1180"/>
  </OperatorMethod>
  <Destructor id="_1856" name="CThostFtdcExchangeRateField" context="_831" access="public" location="f2:1180" file="f2" line="1180" inline="1" artificial="1"/>
  <Field id="_1857" name="TradingDay" type="_30" context="_832" access="public" location="f2:1198" file="f2" line="1198" offset="0"/>
  <Field id="_1858" name="SettlementID" type="_96" context="_832" access="public" location="f2:1200" file="f2" line="1200" offset="96"/>
  <Constructor id="_1859" name="CThostFtdcSettlementRefField" context="_832" access="public" location="f2:1195" file="f2" line="1195" inline="1" artificial="1"/>
  <Constructor id="_1860" name="CThostFtdcSettlementRefField" context="_832" access="public" location="f2:1195" file="f2" line="1195" inline="1" artificial="1">
    <Argument type="_6830" location="f2:1195" file="f2" line="1195"/>
  </Constructor>
  <OperatorMethod id="_1861" name="=" returns="_6831" context="_832" access="public" location="f2:1195" file="f2" line="1195" inline="1" artificial="1" mangled="_ZN28CThostFtdcSettlementRefFieldaSERKS_">
    <Argument type="_6830" location="f2:1195" file="f2" line="1195"/>
  </OperatorMethod>
  <Destructor id="_1862" name="CThostFtdcSettlementRefField" context="_832" access="public" location="f2:1195" file="f2" line="1195" inline="1" artificial="1"/>
  <Field id="_1863" name="CurrDate" type="_30" context="_833" access="public" location="f2:1207" file="f2" line="1207" offset="0"/>
  <Field id="_1864" name="CurrTime" type="_31" context="_833" access="public" location="f2:1209" file="f2" line="1209" offset="72"/>
  <Field id="_1865" name="CurrMillisec" type="_102" context="_833" access="public" location="f2:1211" file="f2" line="1211" offset="160"/>
  <Field id="_1866" name="ActionDay" type="_30" context="_833" access="public" location="f2:1213" file="f2" line="1213" offset="192"/>
  <Constructor id="_1867" name="CThostFtdcCurrentTimeField" context="_833" access="public" location="f2:1204" file="f2" line="1204" inline="1" artificial="1"/>
  <Constructor id="_1868" name="CThostFtdcCurrentTimeField" context="_833" access="public" location="f2:1204" file="f2" line="1204" inline="1" artificial="1">
    <Argument type="_6832" location="f2:1204" file="f2" line="1204"/>
  </Constructor>
  <OperatorMethod id="_1869" name="=" returns="_6833" context="_833" access="public" location="f2:1204" file="f2" line="1204" inline="1" artificial="1" mangled="_ZN26CThostFtdcCurrentTimeFieldaSERKS_">
    <Argument type="_6832" location="f2:1204" file="f2" line="1204"/>
  </OperatorMethod>
  <Destructor id="_1870" name="CThostFtdcCurrentTimeField" context="_833" access="public" location="f2:1204" file="f2" line="1204" inline="1" artificial="1"/>
  <Field id="_1871" name="TradingDay" type="_30" context="_834" access="public" location="f2:1220" file="f2" line="1220" offset="0"/>
  <Field id="_1872" name="CommPhaseNo" type="_116" context="_834" access="public" location="f2:1222" file="f2" line="1222" offset="80"/>
  <Field id="_1873" name="SystemID" type="_28" context="_834" access="public" location="f2:1224" file="f2" line="1224" offset="96"/>
  <Constructor id="_1874" name="CThostFtdcCommPhaseField" context="_834" access="public" location="f2:1217" file="f2" line="1217" inline="1" artificial="1"/>
  <Constructor id="_1875" name="CThostFtdcCommPhaseField" context="_834" access="public" location="f2:1217" file="f2" line="1217" inline="1" artificial="1">
    <Argument type="_6834" location="f2:1217" file="f2" line="1217"/>
  </Constructor>
  <OperatorMethod id="_1876" name="=" returns="_6835" context="_834" access="public" location="f2:1217" file="f2" line="1217" inline="1" artificial="1" mangled="_ZN24CThostFtdcCommPhaseFieldaSERKS_">
    <Argument type="_6834" location="f2:1217" file="f2" line="1217"/>
  </OperatorMethod>
  <Destructor id="_1877" name="CThostFtdcCommPhaseField" context="_834" access="public" location="f2:1217" file="f2" line="1217" inline="1" artificial="1"/>
  <Field id="_1878" name="FrontID" type="_98" context="_835" access="public" location="f2:1231" file="f2" line="1231" offset="0"/>
  <Field id="_1879" name="SessionID" type="_99" context="_835" access="public" location="f2:1233" file="f2" line="1233" offset="32"/>
  <Field id="_1880" name="BrokerID" type="_10" context="_835" access="public" location="f2:1235" file="f2" line="1235" offset="64"/>
  <Field id="_1881" name="UserID" type="_16" context="_835" access="public" location="f2:1237" file="f2" line="1237" offset="152"/>
  <Field id="_1882" name="LoginDate" type="_30" context="_835" access="public" location="f2:1239" file="f2" line="1239" offset="280"/>
  <Field id="_1883" name="LoginTime" type="_31" context="_835" access="public" location="f2:1241" file="f2" line="1241" offset="352"/>
  <Field id="_1884" name="IPAddress" type="_38" context="_835" access="public" location="f2:1243" file="f2" line="1243" offset="424"/>
  <Field id="_1885" name="UserProductInfo" type="_40" context="_835" access="public" location="f2:1245" file="f2" line="1245" offset="552"/>
  <Field id="_1886" name="InterfaceProductInfo" type="_40" context="_835" access="public" location="f2:1247" file="f2" line="1247" offset="640"/>
  <Field id="_1887" name="ProtocolInfo" type="_41" context="_835" access="public" location="f2:1249" file="f2" line="1249" offset="728"/>
  <Field id="_1888" name="SystemName" type="_52" context="_835" access="public" location="f2:1251" file="f2" line="1251" offset="816"/>
  <Field id="_1889" name="PasswordDeprecated" type="_17" context="_835" access="public" location="f2:1253" file="f2" line="1253" offset="1144"/>
  <Field id="_1890" name="MaxOrderRef" type="_14" context="_835" access="public" location="f2:1255" file="f2" line="1255" offset="1472"/>
  <Field id="_1891" name="SHFETime" type="_31" context="_835" access="public" location="f2:1257" file="f2" line="1257" offset="1576"/>
  <Field id="_1892" name="DCETime" type="_31" context="_835" access="public" location="f2:1259" file="f2" line="1259" offset="1648"/>
  <Field id="_1893" name="CZCETime" type="_31" context="_835" access="public" location="f2:1261" file="f2" line="1261" offset="1720"/>
  <Field id="_1894" name="FFEXTime" type="_31" context="_835" access="public" location="f2:1263" file="f2" line="1263" offset="1792"/>
  <Field id="_1895" name="MacAddress" type="_27" context="_835" access="public" location="f2:1265" file="f2" line="1265" offset="1864"/>
  <Field id="_1896" name="OneTimePassword" type="_17" context="_835" access="public" location="f2:1267" file="f2" line="1267" offset="2032"/>
  <Field id="_1897" name="INETime" type="_31" context="_835" access="public" location="f2:1269" file="f2" line="1269" offset="2360"/>
  <Field id="_1898" name="IsQryControl" type="_108" context="_835" access="public" location="f2:1271" file="f2" line="1271" offset="2432"/>
  <Field id="_1899" name="LoginRemark" type="_747" context="_835" access="public" location="f2:1273" file="f2" line="1273" offset="2464"/>
  <Field id="_1900" name="Password" type="_17" context="_835" access="public" location="f2:1275" file="f2" line="1275" offset="2752"/>
  <Constructor id="_1901" name="CThostFtdcLoginInfoField" context="_835" access="public" location="f2:1228" file="f2" line="1228" inline="1" artificial="1"/>
  <Constructor id="_1902" name="CThostFtdcLoginInfoField" context="_835" access="public" location="f2:1228" file="f2" line="1228" inline="1" artificial="1">
    <Argument type="_6836" location="f2:1228" file="f2" line="1228"/>
  </Constructor>
  <OperatorMethod id="_1903" name="=" returns="_6837" context="_835" access="public" location="f2:1228" file="f2" line="1228" inline="1" artificial="1" mangled="_ZN24CThostFtdcLoginInfoFieldaSERKS_">
    <Argument type="_6836" location="f2:1228" file="f2" line="1228"/>
  </OperatorMethod>
  <Destructor id="_1904" name="CThostFtdcLoginInfoField" context="_835" access="public" location="f2:1228" file="f2" line="1228" inline="1" artificial="1"/>
  <Field id="_1905" name="FrontID" type="_98" context="_836" access="public" location="f2:1282" file="f2" line="1282" offset="0"/>
  <Field id="_1906" name="SessionID" type="_99" context="_836" access="public" location="f2:1284" file="f2" line="1284" offset="32"/>
  <Field id="_1907" name="SystemName" type="_52" context="_836" access="public" location="f2:1286" file="f2" line="1286" offset="64"/>
  <Constructor id="_1908" name="CThostFtdcLogoutAllField" context="_836" access="public" location="f2:1279" file="f2" line="1279" inline="1" artificial="1"/>
  <Constructor id="_1909" name="CThostFtdcLogoutAllField" context="_836" access="public" location="f2:1279" file="f2" line="1279" inline="1" artificial="1">
    <Argument type="_6838" location="f2:1279" file="f2" line="1279"/>
  </Constructor>
  <OperatorMethod id="_1910" name="=" returns="_6839" context="_836" access="public" location="f2:1279" file="f2" line="1279" inline="1" artificial="1" mangled="_ZN24CThostFtdcLogoutAllFieldaSERKS_">
    <Argument type="_6838" location="f2:1279" file="f2" line="1279"/>
  </OperatorMethod>
  <Destructor id="_1911" name="CThostFtdcLogoutAllField" context="_836" access="public" location="f2:1279" file="f2" line="1279" inline="1" artificial="1"/>
  <Field id="_1912" name="FrontID" type="_98" context="_837" access="public" location="f2:1293" file="f2" line="1293" offset="0"/>
  <Field id="_1913" name="LastReportDate" type="_30" context="_837" access="public" location="f2:1295" file="f2" line="1295" offset="32"/>
  <Field id="_1914" name="LastReportTime" type="_31" context="_837" access="public" location="f2:1297" file="f2" line="1297" offset="104"/>
  <Field id="_1915" name="IsActive" type="_108" context="_837" access="public" location="f2:1299" file="f2" line="1299" offset="192"/>
  <Constructor id="_1916" name="CThostFtdcFrontStatusField" context="_837" access="public" location="f2:1290" file="f2" line="1290" inline="1" artificial="1"/>
  <Constructor id="_1917" name="CThostFtdcFrontStatusField" context="_837" access="public" location="f2:1290" file="f2" line="1290" inline="1" artificial="1">
    <Argument type="_6840" location="f2:1290" file="f2" line="1290"/>
  </Constructor>
  <OperatorMethod id="_1918" name="=" returns="_6841" context="_837" access="public" location="f2:1290" file="f2" line="1290" inline="1" artificial="1" mangled="_ZN26CThostFtdcFrontStatusFieldaSERKS_">
    <Argument type="_6840" location="f2:1290" file="f2" line="1290"/>
  </OperatorMethod>
  <Destructor id="_1919" name="CThostFtdcFrontStatusField" context="_837" access="public" location="f2:1290" file="f2" line="1290" inline="1" artificial="1"/>
  <Field id="_1920" name="BrokerID" type="_10" context="_838" access="public" location="f2:1306" file="f2" line="1306" offset="0"/>
  <Field id="_1921" name="UserID" type="_16" context="_838" access="public" location="f2:1308" file="f2" line="1308" offset="88"/>
  <Field id="_1922" name="OldPassword" type="_17" context="_838" access="public" location="f2:1310" file="f2" line="1310" offset="216"/>
  <Field id="_1923" name="NewPassword" type="_17" context="_838" access="public" location="f2:1312" file="f2" line="1312" offset="544"/>
  <Constructor id="_1924" name="CThostFtdcUserPasswordUpdateField" context="_838" access="public" location="f2:1303" file="f2" line="1303" inline="1" artificial="1"/>
  <Constructor id="_1925" name="CThostFtdcUserPasswordUpdateField" context="_838" access="public" location="f2:1303" file="f2" line="1303" inline="1" artificial="1">
    <Argument type="_6842" location="f2:1303" file="f2" line="1303"/>
  </Constructor>
  <OperatorMethod id="_1926" name="=" returns="_6843" context="_838" access="public" location="f2:1303" file="f2" line="1303" inline="1" artificial="1" mangled="_ZN33CThostFtdcUserPasswordUpdateFieldaSERKS_">
    <Argument type="_6842" location="f2:1303" file="f2" line="1303"/>
  </OperatorMethod>
  <Destructor id="_1927" name="CThostFtdcUserPasswordUpdateField" context="_838" access="public" location="f2:1303" file="f2" line="1303" inline="1" artificial="1"/>
  <Field id="_1928" name="BrokerID" type="_10" context="_839" access="public" location="f2:1319" file="f2" line="1319" offset="0"/>
  <Field id="_1929" name="InvestorID" type="_9" context="_839" access="public" location="f2:1321" file="f2" line="1321" offset="88"/>
  <Field id="_1930" name="InstrumentID" type="_19" context="_839" access="public" location="f2:1323" file="f2" line="1323" offset="192"/>
  <Field id="_1931" name="OrderRef" type="_14" context="_839" access="public" location="f2:1325" file="f2" line="1325" offset="440"/>
  <Field id="_1932" name="UserID" type="_16" context="_839" access="public" location="f2:1327" file="f2" line="1327" offset="544"/>
  <Field id="_1933" name="OrderPriceType" type="_78" context="_839" access="public" location="f2:1329" file="f2" line="1329" offset="672"/>
  <Field id="_1934" name="Direction" type="_70" context="_839" access="public" location="f2:1331" file="f2" line="1331" offset="680"/>
  <Field id="_1935" name="CombOffsetFlag" type="_110" context="_839" access="public" location="f2:1333" file="f2" line="1333" offset="688"/>
  <Field id="_1936" name="CombHedgeFlag" type="_111" context="_839" access="public" location="f2:1335" file="f2" line="1335" offset="728"/>
  <Field id="_1937" name="LimitPrice" type="_109" context="_839" access="public" location="f2:1337" file="f2" line="1337" offset="768"/>
  <Field id="_1938" name="VolumeTotalOriginal" type="_97" context="_839" access="public" location="f2:1339" file="f2" line="1339" offset="832"/>
  <Field id="_1939" name="TimeCondition" type="_82" context="_839" access="public" location="f2:1341" file="f2" line="1341" offset="864"/>
  <Field id="_1940" name="GTDDate" type="_30" context="_839" access="public" location="f2:1343" file="f2" line="1343" offset="872"/>
  <Field id="_1941" name="VolumeCondition" type="_83" context="_839" access="public" location="f2:1345" file="f2" line="1345" offset="944"/>
  <Field id="_1942" name="MinVolume" type="_97" context="_839" access="public" location="f2:1347" file="f2" line="1347" offset="960"/>
  <Field id="_1943" name="ContingentCondition" type="_84" context="_839" access="public" location="f2:1349" file="f2" line="1349" offset="992"/>
  <Field id="_1944" name="StopPrice" type="_109" context="_839" access="public" location="f2:1351" file="f2" line="1351" offset="1024"/>
  <Field id="_1945" name="ForceCloseReason" type="_80" context="_839" access="public" location="f2:1353" file="f2" line="1353" offset="1088"/>
  <Field id="_1946" name="IsAutoSuspend" type="_108" context="_839" access="public" location="f2:1355" file="f2" line="1355" offset="1120"/>
  <Field id="_1947" name="BusinessUnit" type="_42" context="_839" access="public" location="f2:1357" file="f2" line="1357" offset="1152"/>
  <Field id="_1948" name="RequestID" type="_105" context="_839" access="public" location="f2:1359" file="f2" line="1359" offset="1344"/>
  <Field id="_1949" name="UserForceClose" type="_108" context="_839" access="public" location="f2:1361" file="f2" line="1361" offset="1376"/>
  <Field id="_1950" name="IsSwapOrder" type="_108" context="_839" access="public" location="f2:1363" file="f2" line="1363" offset="1408"/>
  <Field id="_1951" name="ExchangeID" type="_23" context="_839" access="public" location="f2:1365" file="f2" line="1365" offset="1440"/>
  <Field id="_1952" name="InvestUnitID" type="_748" context="_839" access="public" location="f2:1367" file="f2" line="1367" offset="1512"/>
  <Field id="_1953" name="AccountID" type="_170" context="_839" access="public" location="f2:1369" file="f2" line="1369" offset="1648"/>
  <Field id="_1954" name="CurrencyID" type="_335" context="_839" access="public" location="f2:1371" file="f2" line="1371" offset="1752"/>
  <Field id="_1955" name="ClientID" type="_18" context="_839" access="public" location="f2:1373" file="f2" line="1373" offset="1784"/>
  <Field id="_1956" name="IPAddress" type="_38" context="_839" access="public" location="f2:1375" file="f2" line="1375" offset="1872"/>
  <Field id="_1957" name="MacAddress" type="_27" context="_839" access="public" location="f2:1377" file="f2" line="1377" offset="2000"/>
  <Constructor id="_1958" name="CThostFtdcInputOrderField" context="_839" access="public" location="f2:1316" file="f2" line="1316" inline="1" artificial="1"/>
  <Constructor id="_1959" name="CThostFtdcInputOrderField" context="_839" access="public" location="f2:1316" file="f2" line="1316" inline="1" artificial="1">
    <Argument type="_6844" location="f2:1316" file="f2" line="1316"/>
  </Constructor>
  <OperatorMethod id="_1960" name="=" returns="_6845" context="_839" access="public" location="f2:1316" file="f2" line="1316" inline="1" artificial="1" mangled="_ZN25CThostFtdcInputOrderFieldaSERKS_">
    <Argument type="_6844" location="f2:1316" file="f2" line="1316"/>
  </OperatorMethod>
  <Destructor id="_1961" name="CThostFtdcInputOrderField" context="_839" access="public" location="f2:1316" file="f2" line="1316" inline="1" artificial="1"/>
  <Field id="_1962" name="BrokerID" type="_10" context="_840" access="public" location="f2:1384" file="f2" line="1384" offset="0"/>
  <Field id="_1963" name="InvestorID" type="_9" context="_840" access="public" location="f2:1386" file="f2" line="1386" offset="88"/>
  <Field id="_1964" name="InstrumentID" type="_19" context="_840" access="public" location="f2:1388" file="f2" line="1388" offset="192"/>
  <Field id="_1965" name="OrderRef" type="_14" context="_840" access="public" location="f2:1390" file="f2" line="1390" offset="440"/>
  <Field id="_1966" name="UserID" type="_16" context="_840" access="public" location="f2:1392" file="f2" line="1392" offset="544"/>
  <Field id="_1967" name="OrderPriceType" type="_78" context="_840" access="public" location="f2:1394" file="f2" line="1394" offset="672"/>
  <Field id="_1968" name="Direction" type="_70" context="_840" access="public" location="f2:1396" file="f2" line="1396" offset="680"/>
  <Field id="_1969" name="CombOffsetFlag" type="_110" context="_840" access="public" location="f2:1398" file="f2" line="1398" offset="688"/>
  <Field id="_1970" name="CombHedgeFlag" type="_111" context="_840" access="public" location="f2:1400" file="f2" line="1400" offset="728"/>
  <Field id="_1971" name="LimitPrice" type="_109" context="_840" access="public" location="f2:1402" file="f2" line="1402" offset="768"/>
  <Field id="_1972" name="VolumeTotalOriginal" type="_97" context="_840" access="public" location="f2:1404" file="f2" line="1404" offset="832"/>
  <Field id="_1973" name="TimeCondition" type="_82" context="_840" access="public" location="f2:1406" file="f2" line="1406" offset="864"/>
  <Field id="_1974" name="GTDDate" type="_30" context="_840" access="public" location="f2:1408" file="f2" line="1408" offset="872"/>
  <Field id="_1975" name="VolumeCondition" type="_83" context="_840" access="public" location="f2:1410" file="f2" line="1410" offset="944"/>
  <Field id="_1976" name="MinVolume" type="_97" context="_840" access="public" location="f2:1412" file="f2" line="1412" offset="960"/>
  <Field id="_1977" name="ContingentCondition" type="_84" context="_840" access="public" location="f2:1414" file="f2" line="1414" offset="992"/>
  <Field id="_1978" name="StopPrice" type="_109" context="_840" access="public" location="f2:1416" file="f2" line="1416" offset="1024"/>
  <Field id="_1979" name="ForceCloseReason" type="_80" context="_840" access="public" location="f2:1418" file="f2" line="1418" offset="1088"/>
  <Field id="_1980" name="IsAutoSuspend" type="_108" context="_840" access="public" location="f2:1420" file="f2" line="1420" offset="1120"/>
  <Field id="_1981" name="BusinessUnit" type="_42" context="_840" access="public" location="f2:1422" file="f2" line="1422" offset="1152"/>
  <Field id="_1982" name="RequestID" type="_105" context="_840" access="public" location="f2:1424" file="f2" line="1424" offset="1344"/>
  <Field id="_1983" name="OrderLocalID" type="_46" context="_840" access="public" location="f2:1426" file="f2" line="1426" offset="1376"/>
  <Field id="_1984" name="ExchangeID" type="_23" context="_840" access="public" location="f2:1428" file="f2" line="1428" offset="1480"/>
  <Field id="_1985" name="ParticipantID" type="_15" context="_840" access="public" location="f2:1430" file="f2" line="1430" offset="1552"/>
  <Field id="_1986" name="ClientID" type="_18" context="_840" access="public" location="f2:1432" file="f2" line="1432" offset="1640"/>
  <Field id="_1987" name="ExchangeInstID" type="_13" context="_840" access="public" location="f2:1434" file="f2" line="1434" offset="1728"/>
  <Field id="_1988" name="TraderID" type="_8" context="_840" access="public" location="f2:1436" file="f2" line="1436" offset="1976"/>
  <Field id="_1989" name="InstallID" type="_94" context="_840" access="public" location="f2:1438" file="f2" line="1438" offset="2144"/>
  <Field id="_1990" name="OrderSubmitStatus" type="_64" context="_840" access="public" location="f2:1440" file="f2" line="1440" offset="2176"/>
  <Field id="_1991" name="NotifySequence" type="_100" context="_840" access="public" location="f2:1442" file="f2" line="1442" offset="2208"/>
  <Field id="_1992" name="TradingDay" type="_30" context="_840" access="public" location="f2:1444" file="f2" line="1444" offset="2240"/>
  <Field id="_1993" name="SettlementID" type="_96" context="_840" access="public" location="f2:1446" file="f2" line="1446" offset="2336"/>
  <Field id="_1994" name="OrderSysID" type="_35" context="_840" access="public" location="f2:1448" file="f2" line="1448" offset="2368"/>
  <Field id="_1995" name="OrderSource" type="_87" context="_840" access="public" location="f2:1450" file="f2" line="1450" offset="2536"/>
  <Field id="_1996" name="OrderStatus" type="_63" context="_840" access="public" location="f2:1452" file="f2" line="1452" offset="2544"/>
  <Field id="_1997" name="OrderType" type="_81" context="_840" access="public" location="f2:1454" file="f2" line="1454" offset="2552"/>
  <Field id="_1998" name="VolumeTraded" type="_97" context="_840" access="public" location="f2:1456" file="f2" line="1456" offset="2560"/>
  <Field id="_1999" name="VolumeTotal" type="_97" context="_840" access="public" location="f2:1458" file="f2" line="1458" offset="2592"/>
  <Field id="_2000" name="InsertDate" type="_30" context="_840" access="public" location="f2:1460" file="f2" line="1460" offset="2624"/>
  <Field id="_2001" name="InsertTime" type="_31" context="_840" access="public" location="f2:1462" file="f2" line="1462" offset="2696"/>
  <Field id="_2002" name="ActiveTime" type="_31" context="_840" access="public" location="f2:1464" file="f2" line="1464" offset="2768"/>
  <Field id="_2003" name="SuspendTime" type="_31" context="_840" access="public" location="f2:1466" file="f2" line="1466" offset="2840"/>
  <Field id="_2004" name="UpdateTime" type="_31" context="_840" access="public" location="f2:1468" file="f2" line="1468" offset="2912"/>
  <Field id="_2005" name="CancelTime" type="_31" context="_840" access="public" location="f2:1470" file="f2" line="1470" offset="2984"/>
  <Field id="_2006" name="ActiveTraderID" type="_8" context="_840" access="public" location="f2:1472" file="f2" line="1472" offset="3056"/>
  <Field id="_2007" name="ClearingPartID" type="_15" context="_840" access="public" location="f2:1474" file="f2" line="1474" offset="3224"/>
  <Field id="_2008" name="SequenceNo" type="_100" context="_840" access="public" location="f2:1476" file="f2" line="1476" offset="3328"/>
  <Field id="_2009" name="FrontID" type="_98" context="_840" access="public" location="f2:1478" file="f2" line="1478" offset="3360"/>
  <Field id="_2010" name="SessionID" type="_99" context="_840" access="public" location="f2:1480" file="f2" line="1480" offset="3392"/>
  <Field id="_2011" name="UserProductInfo" type="_40" context="_840" access="public" location="f2:1482" file="f2" line="1482" offset="3424"/>
  <Field id="_2012" name="StatusMsg" type="_49" context="_840" access="public" location="f2:1484" file="f2" line="1484" offset="3512"/>
  <Field id="_2013" name="UserForceClose" type="_108" context="_840" access="public" location="f2:1486" file="f2" line="1486" offset="4160"/>
  <Field id="_2014" name="ActiveUserID" type="_16" context="_840" access="public" location="f2:1488" file="f2" line="1488" offset="4192"/>
  <Field id="_2015" name="BrokerOrderSeq" type="_100" context="_840" access="public" location="f2:1490" file="f2" line="1490" offset="4320"/>
  <Field id="_2016" name="RelativeOrderSysID" type="_35" context="_840" access="public" location="f2:1492" file="f2" line="1492" offset="4352"/>
  <Field id="_2017" name="ZCETotalTradedVolume" type="_97" context="_840" access="public" location="f2:1494" file="f2" line="1494" offset="4544"/>
  <Field id="_2018" name="IsSwapOrder" type="_108" context="_840" access="public" location="f2:1496" file="f2" line="1496" offset="4576"/>
  <Field id="_2019" name="BranchID" type="_261" context="_840" access="public" location="f2:1498" file="f2" line="1498" offset="4608"/>
  <Field id="_2020" name="InvestUnitID" type="_748" context="_840" access="public" location="f2:1500" file="f2" line="1500" offset="4680"/>
  <Field id="_2021" name="AccountID" type="_170" context="_840" access="public" location="f2:1502" file="f2" line="1502" offset="4816"/>
  <Field id="_2022" name="CurrencyID" type="_335" context="_840" access="public" location="f2:1504" file="f2" line="1504" offset="4920"/>
  <Field id="_2023" name="IPAddress" type="_38" context="_840" access="public" location="f2:1506" file="f2" line="1506" offset="4952"/>
  <Field id="_2024" name="MacAddress" type="_27" context="_840" access="public" location="f2:1508" file="f2" line="1508" offset="5080"/>
  <Constructor id="_2025" name="CThostFtdcOrderField" context="_840" access="public" location="f2:1381" file="f2" line="1381" inline="1" artificial="1"/>
  <Constructor id="_2026" name="CThostFtdcOrderField" context="_840" access="public" location="f2:1381" file="f2" line="1381" inline="1" artificial="1">
    <Argument type="_6846" location="f2:1381" file="f2" line="1381"/>
  </Constructor>
  <OperatorMethod id="_2027" name="=" returns="_6847" context="_840" access="public" location="f2:1381" file="f2" line="1381" inline="1" artificial="1" mangled="_ZN20CThostFtdcOrderFieldaSERKS_">
    <Argument type="_6846" location="f2:1381" file="f2" line="1381"/>
  </OperatorMethod>
  <Destructor id="_2028" name="CThostFtdcOrderField" context="_840" access="public" location="f2:1381" file="f2" line="1381" inline="1" artificial="1"/>
  <Field id="_2029" name="OrderPriceType" type="_78" context="_841" access="public" location="f2:1515" file="f2" line="1515" offset="0"/>
  <Field id="_2030" name="Direction" type="_70" context="_841" access="public" location="f2:1517" file="f2" line="1517" offset="8"/>
  <Field id="_2031" name="CombOffsetFlag" type="_110" context="_841" access="public" location="f2:1519" file="f2" line="1519" offset="16"/>
  <Field id="_2032" name="CombHedgeFlag" type="_111" context="_841" access="public" location="f2:1521" file="f2" line="1521" offset="56"/>
  <Field id="_2033" name="LimitPrice" type="_109" context="_841" access="public" location="f2:1523" file="f2" line="1523" offset="128"/>
  <Field id="_2034" name="VolumeTotalOriginal" type="_97" context="_841" access="public" location="f2:1525" file="f2" line="1525" offset="192"/>
  <Field id="_2035" name="TimeCondition" type="_82" context="_841" access="public" location="f2:1527" file="f2" line="1527" offset="224"/>
  <Field id="_2036" name="GTDDate" type="_30" context="_841" access="public" location="f2:1529" file="f2" line="1529" offset="232"/>
  <Field id="_2037" name="VolumeCondition" type="_83" context="_841" access="public" location="f2:1531" file="f2" line="1531" offset="304"/>
  <Field id="_2038" name="MinVolume" type="_97" context="_841" access="public" location="f2:1533" file="f2" line="1533" offset="320"/>
  <Field id="_2039" name="ContingentCondition" type="_84" context="_841" access="public" location="f2:1535" file="f2" line="1535" offset="352"/>
  <Field id="_2040" name="StopPrice" type="_109" context="_841" access="public" location="f2:1537" file="f2" line="1537" offset="384"/>
  <Field id="_2041" name="ForceCloseReason" type="_80" context="_841" access="public" location="f2:1539" file="f2" line="1539" offset="448"/>
  <Field id="_2042" name="IsAutoSuspend" type="_108" context="_841" access="public" location="f2:1541" file="f2" line="1541" offset="480"/>
  <Field id="_2043" name="BusinessUnit" type="_42" context="_841" access="public" location="f2:1543" file="f2" line="1543" offset="512"/>
  <Field id="_2044" name="RequestID" type="_105" context="_841" access="public" location="f2:1545" file="f2" line="1545" offset="704"/>
  <Field id="_2045" name="OrderLocalID" type="_46" context="_841" access="public" location="f2:1547" file="f2" line="1547" offset="736"/>
  <Field id="_2046" name="ExchangeID" type="_23" context="_841" access="public" location="f2:1549" file="f2" line="1549" offset="840"/>
  <Field id="_2047" name="ParticipantID" type="_15" context="_841" access="public" location="f2:1551" file="f2" line="1551" offset="912"/>
  <Field id="_2048" name="ClientID" type="_18" context="_841" access="public" location="f2:1553" file="f2" line="1553" offset="1000"/>
  <Field id="_2049" name="ExchangeInstID" type="_13" context="_841" access="public" location="f2:1555" file="f2" line="1555" offset="1088"/>
  <Field id="_2050" name="TraderID" type="_8" context="_841" access="public" location="f2:1557" file="f2" line="1557" offset="1336"/>
  <Field id="_2051" name="InstallID" type="_94" context="_841" access="public" location="f2:1559" file="f2" line="1559" offset="1504"/>
  <Field id="_2052" name="OrderSubmitStatus" type="_64" context="_841" access="public" location="f2:1561" file="f2" line="1561" offset="1536"/>
  <Field id="_2053" name="NotifySequence" type="_100" context="_841" access="public" location="f2:1563" file="f2" line="1563" offset="1568"/>
  <Field id="_2054" name="TradingDay" type="_30" context="_841" access="public" location="f2:1565" file="f2" line="1565" offset="1600"/>
  <Field id="_2055" name="SettlementID" type="_96" context="_841" access="public" location="f2:1567" file="f2" line="1567" offset="1696"/>
  <Field id="_2056" name="OrderSysID" type="_35" context="_841" access="public" location="f2:1569" file="f2" line="1569" offset="1728"/>
  <Field id="_2057" name="OrderSource" type="_87" context="_841" access="public" location="f2:1571" file="f2" line="1571" offset="1896"/>
  <Field id="_2058" name="OrderStatus" type="_63" context="_841" access="public" location="f2:1573" file="f2" line="1573" offset="1904"/>
  <Field id="_2059" name="OrderType" type="_81" context="_841" access="public" location="f2:1575" file="f2" line="1575" offset="1912"/>
  <Field id="_2060" name="VolumeTraded" type="_97" context="_841" access="public" location="f2:1577" file="f2" line="1577" offset="1920"/>
  <Field id="_2061" name="VolumeTotal" type="_97" context="_841" access="public" location="f2:1579" file="f2" line="1579" offset="1952"/>
  <Field id="_2062" name="InsertDate" type="_30" context="_841" access="public" location="f2:1581" file="f2" line="1581" offset="1984"/>
  <Field id="_2063" name="InsertTime" type="_31" context="_841" access="public" location="f2:1583" file="f2" line="1583" offset="2056"/>
  <Field id="_2064" name="ActiveTime" type="_31" context="_841" access="public" location="f2:1585" file="f2" line="1585" offset="2128"/>
  <Field id="_2065" name="SuspendTime" type="_31" context="_841" access="public" location="f2:1587" file="f2" line="1587" offset="2200"/>
  <Field id="_2066" name="UpdateTime" type="_31" context="_841" access="public" location="f2:1589" file="f2" line="1589" offset="2272"/>
  <Field id="_2067" name="CancelTime" type="_31" context="_841" access="public" location="f2:1591" file="f2" line="1591" offset="2344"/>
  <Field id="_2068" name="ActiveTraderID" type="_8" context="_841" access="public" location="f2:1593" file="f2" line="1593" offset="2416"/>
  <Field id="_2069" name="ClearingPartID" type="_15" context="_841" access="public" location="f2:1595" file="f2" line="1595" offset="2584"/>
  <Field id="_2070" name="SequenceNo" type="_100" context="_841" access="public" location="f2:1597" file="f2" line="1597" offset="2688"/>
  <Field id="_2071" name="BranchID" type="_261" context="_841" access="public" location="f2:1599" file="f2" line="1599" offset="2720"/>
  <Field id="_2072" name="IPAddress" type="_38" context="_841" access="public" location="f2:1601" file="f2" line="1601" offset="2792"/>
  <Field id="_2073" name="MacAddress" type="_27" context="_841" access="public" location="f2:1603" file="f2" line="1603" offset="2920"/>
  <Constructor id="_2074" name="CThostFtdcExchangeOrderField" context="_841" access="public" location="f2:1512" file="f2" line="1512" inline="1" artificial="1"/>
  <Constructor id="_2075" name="CThostFtdcExchangeOrderField" context="_841" access="public" location="f2:1512" file="f2" line="1512" inline="1" artificial="1">
    <Argument type="_6848" location="f2:1512" file="f2" line="1512"/>
  </Constructor>
  <OperatorMethod id="_2076" name="=" returns="_6849" context="_841" access="public" location="f2:1512" file="f2" line="1512" inline="1" artificial="1" mangled="_ZN28CThostFtdcExchangeOrderFieldaSERKS_">
    <Argument type="_6848" location="f2:1512" file="f2" line="1512"/>
  </OperatorMethod>
  <Destructor id="_2077" name="CThostFtdcExchangeOrderField" context="_841" access="public" location="f2:1512" file="f2" line="1512" inline="1" artificial="1"/>
  <Field id="_2078" name="ExchangeID" type="_23" context="_842" access="public" location="f2:1610" file="f2" line="1610" offset="0"/>
  <Field id="_2079" name="ParticipantID" type="_15" context="_842" access="public" location="f2:1612" file="f2" line="1612" offset="72"/>
  <Field id="_2080" name="TraderID" type="_8" context="_842" access="public" location="f2:1614" file="f2" line="1614" offset="160"/>
  <Field id="_2081" name="InstallID" type="_94" context="_842" access="public" location="f2:1616" file="f2" line="1616" offset="352"/>
  <Field id="_2082" name="OrderLocalID" type="_46" context="_842" access="public" location="f2:1618" file="f2" line="1618" offset="384"/>
  <Field id="_2083" name="ErrorID" type="_95" context="_842" access="public" location="f2:1620" file="f2" line="1620" offset="512"/>
  <Field id="_2084" name="ErrorMsg" type="_49" context="_842" access="public" location="f2:1622" file="f2" line="1622" offset="544"/>
  <Constructor id="_2085" name="CThostFtdcExchangeOrderInsertErrorField" context="_842" access="public" location="f2:1607" file="f2" line="1607" inline="1" artificial="1"/>
  <Constructor id="_2086" name="CThostFtdcExchangeOrderInsertErrorField" context="_842" access="public" location="f2:1607" file="f2" line="1607" inline="1" artificial="1">
    <Argument type="_6850" location="f2:1607" file="f2" line="1607"/>
  </Constructor>
  <OperatorMethod id="_2087" name="=" returns="_6851" context="_842" access="public" location="f2:1607" file="f2" line="1607" inline="1" artificial="1" mangled="_ZN39CThostFtdcExchangeOrderInsertErrorFieldaSERKS_">
    <Argument type="_6850" location="f2:1607" file="f2" line="1607"/>
  </OperatorMethod>
  <Destructor id="_2088" name="CThostFtdcExchangeOrderInsertErrorField" context="_842" access="public" location="f2:1607" file="f2" line="1607" inline="1" artificial="1"/>
  <Field id="_2089" name="BrokerID" type="_10" context="_843" access="public" location="f2:1629" file="f2" line="1629" offset="0"/>
  <Field id="_2090" name="InvestorID" type="_9" context="_843" access="public" location="f2:1631" file="f2" line="1631" offset="88"/>
  <Field id="_2091" name="OrderActionRef" type="_92" context="_843" access="public" location="f2:1633" file="f2" line="1633" offset="192"/>
  <Field id="_2092" name="OrderRef" type="_14" context="_843" access="public" location="f2:1635" file="f2" line="1635" offset="224"/>
  <Field id="_2093" name="RequestID" type="_105" context="_843" access="public" location="f2:1637" file="f2" line="1637" offset="352"/>
  <Field id="_2094" name="FrontID" type="_98" context="_843" access="public" location="f2:1639" file="f2" line="1639" offset="384"/>
  <Field id="_2095" name="SessionID" type="_99" context="_843" access="public" location="f2:1641" file="f2" line="1641" offset="416"/>
  <Field id="_2096" name="ExchangeID" type="_23" context="_843" access="public" location="f2:1643" file="f2" line="1643" offset="448"/>
  <Field id="_2097" name="OrderSysID" type="_35" context="_843" access="public" location="f2:1645" file="f2" line="1645" offset="520"/>
  <Field id="_2098" name="ActionFlag" type="_85" context="_843" access="public" location="f2:1647" file="f2" line="1647" offset="688"/>
  <Field id="_2099" name="LimitPrice" type="_109" context="_843" access="public" location="f2:1649" file="f2" line="1649" offset="704"/>
  <Field id="_2100" name="VolumeChange" type="_97" context="_843" access="public" location="f2:1651" file="f2" line="1651" offset="768"/>
  <Field id="_2101" name="UserID" type="_16" context="_843" access="public" location="f2:1653" file="f2" line="1653" offset="800"/>
  <Field id="_2102" name="InstrumentID" type="_19" context="_843" access="public" location="f2:1655" file="f2" line="1655" offset="928"/>
  <Field id="_2103" name="InvestUnitID" type="_748" context="_843" access="public" location="f2:1657" file="f2" line="1657" offset="1176"/>
  <Field id="_2104" name="IPAddress" type="_38" context="_843" access="public" location="f2:1659" file="f2" line="1659" offset="1312"/>
  <Field id="_2105" name="MacAddress" type="_27" context="_843" access="public" location="f2:1661" file="f2" line="1661" offset="1440"/>
  <Constructor id="_2106" name="CThostFtdcInputOrderActionField" context="_843" access="public" location="f2:1626" file="f2" line="1626" inline="1" artificial="1"/>
  <Constructor id="_2107" name="CThostFtdcInputOrderActionField" context="_843" access="public" location="f2:1626" file="f2" line="1626" inline="1" artificial="1">
    <Argument type="_6852" location="f2:1626" file="f2" line="1626"/>
  </Constructor>
  <OperatorMethod id="_2108" name="=" returns="_6853" context="_843" access="public" location="f2:1626" file="f2" line="1626" inline="1" artificial="1" mangled="_ZN31CThostFtdcInputOrderActionFieldaSERKS_">
    <Argument type="_6852" location="f2:1626" file="f2" line="1626"/>
  </OperatorMethod>
  <Destructor id="_2109" name="CThostFtdcInputOrderActionField" context="_843" access="public" location="f2:1626" file="f2" line="1626" inline="1" artificial="1"/>
  <Field id="_2110" name="BrokerID" type="_10" context="_844" access="public" location="f2:1668" file="f2" line="1668" offset="0"/>
  <Field id="_2111" name="InvestorID" type="_9" context="_844" access="public" location="f2:1670" file="f2" line="1670" offset="88"/>
  <Field id="_2112" name="OrderActionRef" type="_92" context="_844" access="public" location="f2:1672" file="f2" line="1672" offset="192"/>
  <Field id="_2113" name="OrderRef" type="_14" context="_844" access="public" location="f2:1674" file="f2" line="1674" offset="224"/>
  <Field id="_2114" name="RequestID" type="_105" context="_844" access="public" location="f2:1676" file="f2" line="1676" offset="352"/>
  <Field id="_2115" name="FrontID" type="_98" context="_844" access="public" location="f2:1678" file="f2" line="1678" offset="384"/>
  <Field id="_2116" name="SessionID" type="_99" context="_844" access="public" location="f2:1680" file="f2" line="1680" offset="416"/>
  <Field id="_2117" name="ExchangeID" type="_23" context="_844" access="public" location="f2:1682" file="f2" line="1682" offset="448"/>
  <Field id="_2118" name="OrderSysID" type="_35" context="_844" access="public" location="f2:1684" file="f2" line="1684" offset="520"/>
  <Field id="_2119" name="ActionFlag" type="_85" context="_844" access="public" location="f2:1686" file="f2" line="1686" offset="688"/>
  <Field id="_2120" name="LimitPrice" type="_109" context="_844" access="public" location="f2:1688" file="f2" line="1688" offset="704"/>
  <Field id="_2121" name="VolumeChange" type="_97" context="_844" access="public" location="f2:1690" file="f2" line="1690" offset="768"/>
  <Field id="_2122" name="ActionDate" type="_30" context="_844" access="public" location="f2:1692" file="f2" line="1692" offset="800"/>
  <Field id="_2123" name="ActionTime" type="_31" context="_844" access="public" location="f2:1694" file="f2" line="1694" offset="872"/>
  <Field id="_2124" name="TraderID" type="_8" context="_844" access="public" location="f2:1696" file="f2" line="1696" offset="944"/>
  <Field id="_2125" name="InstallID" type="_94" context="_844" access="public" location="f2:1698" file="f2" line="1698" offset="1120"/>
  <Field id="_2126" name="OrderLocalID" type="_46" context="_844" access="public" location="f2:1700" file="f2" line="1700" offset="1152"/>
  <Field id="_2127" name="ActionLocalID" type="_46" context="_844" access="public" location="f2:1702" file="f2" line="1702" offset="1256"/>
  <Field id="_2128" name="ParticipantID" type="_15" context="_844" access="public" location="f2:1704" file="f2" line="1704" offset="1360"/>
  <Field id="_2129" name="ClientID" type="_18" context="_844" access="public" location="f2:1706" file="f2" line="1706" offset="1448"/>
  <Field id="_2130" name="BusinessUnit" type="_42" context="_844" access="public" location="f2:1708" file="f2" line="1708" offset="1536"/>
  <Field id="_2131" name="OrderActionStatus" type="_62" context="_844" access="public" location="f2:1710" file="f2" line="1710" offset="1704"/>
  <Field id="_2132" name="UserID" type="_16" context="_844" access="public" location="f2:1712" file="f2" line="1712" offset="1712"/>
  <Field id="_2133" name="StatusMsg" type="_49" context="_844" access="public" location="f2:1714" file="f2" line="1714" offset="1840"/>
  <Field id="_2134" name="InstrumentID" type="_19" context="_844" access="public" location="f2:1716" file="f2" line="1716" offset="2488"/>
  <Field id="_2135" name="BranchID" type="_261" context="_844" access="public" location="f2:1718" file="f2" line="1718" offset="2736"/>
  <Field id="_2136" name="InvestUnitID" type="_748" context="_844" access="public" location="f2:1720" file="f2" line="1720" offset="2808"/>
  <Field id="_2137" name="IPAddress" type="_38" context="_844" access="public" location="f2:1722" file="f2" line="1722" offset="2944"/>
  <Field id="_2138" name="MacAddress" type="_27" context="_844" access="public" location="f2:1724" file="f2" line="1724" offset="3072"/>
  <Constructor id="_2139" name="CThostFtdcOrderActionField" context="_844" access="public" location="f2:1665" file="f2" line="1665" inline="1" artificial="1"/>
  <Constructor id="_2140" name="CThostFtdcOrderActionField" context="_844" access="public" location="f2:1665" file="f2" line="1665" inline="1" artificial="1">
    <Argument type="_6854" location="f2:1665" file="f2" line="1665"/>
  </Constructor>
  <OperatorMethod id="_2141" name="=" returns="_6855" context="_844" access="public" location="f2:1665" file="f2" line="1665" inline="1" artificial="1" mangled="_ZN26CThostFtdcOrderActionFieldaSERKS_">
    <Argument type="_6854" location="f2:1665" file="f2" line="1665"/>
  </OperatorMethod>
  <Destructor id="_2142" name="CThostFtdcOrderActionField" context="_844" access="public" location="f2:1665" file="f2" line="1665" inline="1" artificial="1"/>
  <Field id="_2143" name="ExchangeID" type="_23" context="_845" access="public" location="f2:1731" file="f2" line="1731" offset="0"/>
  <Field id="_2144" name="OrderSysID" type="_35" context="_845" access="public" location="f2:1733" file="f2" line="1733" offset="72"/>
  <Field id="_2145" name="ActionFlag" type="_85" context="_845" access="public" location="f2:1735" file="f2" line="1735" offset="240"/>
  <Field id="_2146" name="LimitPrice" type="_109" context="_845" access="public" location="f2:1737" file="f2" line="1737" offset="256"/>
  <Field id="_2147" name="VolumeChange" type="_97" context="_845" access="public" location="f2:1739" file="f2" line="1739" offset="320"/>
  <Field id="_2148" name="ActionDate" type="_30" context="_845" access="public" location="f2:1741" file="f2" line="1741" offset="352"/>
  <Field id="_2149" name="ActionTime" type="_31" context="_845" access="public" location="f2:1743" file="f2" line="1743" offset="424"/>
  <Field id="_2150" name="TraderID" type="_8" context="_845" access="public" location="f2:1745" file="f2" line="1745" offset="496"/>
  <Field id="_2151" name="InstallID" type="_94" context="_845" access="public" location="f2:1747" file="f2" line="1747" offset="672"/>
  <Field id="_2152" name="OrderLocalID" type="_46" context="_845" access="public" location="f2:1749" file="f2" line="1749" offset="704"/>
  <Field id="_2153" name="ActionLocalID" type="_46" context="_845" access="public" location="f2:1751" file="f2" line="1751" offset="808"/>
  <Field id="_2154" name="ParticipantID" type="_15" context="_845" access="public" location="f2:1753" file="f2" line="1753" offset="912"/>
  <Field id="_2155" name="ClientID" type="_18" context="_845" access="public" location="f2:1755" file="f2" line="1755" offset="1000"/>
  <Field id="_2156" name="BusinessUnit" type="_42" context="_845" access="public" location="f2:1757" file="f2" line="1757" offset="1088"/>
  <Field id="_2157" name="OrderActionStatus" type="_62" context="_845" access="public" location="f2:1759" file="f2" line="1759" offset="1256"/>
  <Field id="_2158" name="UserID" type="_16" context="_845" access="public" location="f2:1761" file="f2" line="1761" offset="1264"/>
  <Field id="_2159" name="BranchID" type="_261" context="_845" access="public" location="f2:1763" file="f2" line="1763" offset="1392"/>
  <Field id="_2160" name="IPAddress" type="_38" context="_845" access="public" location="f2:1765" file="f2" line="1765" offset="1464"/>
  <Field id="_2161" name="MacAddress" type="_27" context="_845" access="public" location="f2:1767" file="f2" line="1767" offset="1592"/>
  <Constructor id="_2162" name="CThostFtdcExchangeOrderActionField" context="_845" access="public" location="f2:1728" file="f2" line="1728" inline="1" artificial="1"/>
  <Constructor id="_2163" name="CThostFtdcExchangeOrderActionField" context="_845" access="public" location="f2:1728" file="f2" line="1728" inline="1" artificial="1">
    <Argument type="_6856" location="f2:1728" file="f2" line="1728"/>
  </Constructor>
  <OperatorMethod id="_2164" name="=" returns="_6857" context="_845" access="public" location="f2:1728" file="f2" line="1728" inline="1" artificial="1" mangled="_ZN34CThostFtdcExchangeOrderActionFieldaSERKS_">
    <Argument type="_6856" location="f2:1728" file="f2" line="1728"/>
  </OperatorMethod>
  <Destructor id="_2165" name="CThostFtdcExchangeOrderActionField" context="_845" access="public" location="f2:1728" file="f2" line="1728" inline="1" artificial="1"/>
  <Field id="_2166" name="ExchangeID" type="_23" context="_846" access="public" location="f2:1774" file="f2" line="1774" offset="0"/>
  <Field id="_2167" name="OrderSysID" type="_35" context="_846" access="public" location="f2:1776" file="f2" line="1776" offset="72"/>
  <Field id="_2168" name="TraderID" type="_8" context="_846" access="public" location="f2:1778" file="f2" line="1778" offset="240"/>
  <Field id="_2169" name="InstallID" type="_94" context="_846" access="public" location="f2:1780" file="f2" line="1780" offset="416"/>
  <Field id="_2170" name="OrderLocalID" type="_46" context="_846" access="public" location="f2:1782" file="f2" line="1782" offset="448"/>
  <Field id="_2171" name="ActionLocalID" type="_46" context="_846" access="public" location="f2:1784" file="f2" line="1784" offset="552"/>
  <Field id="_2172" name="ErrorID" type="_95" context="_846" access="public" location="f2:1786" file="f2" line="1786" offset="672"/>
  <Field id="_2173" name="ErrorMsg" type="_49" context="_846" access="public" location="f2:1788" file="f2" line="1788" offset="704"/>
  <Constructor id="_2174" name="CThostFtdcExchangeOrderActionErrorField" context="_846" access="public" location="f2:1771" file="f2" line="1771" inline="1" artificial="1"/>
  <Constructor id="_2175" name="CThostFtdcExchangeOrderActionErrorField" context="_846" access="public" location="f2:1771" file="f2" line="1771" inline="1" artificial="1">
    <Argument type="_6858" location="f2:1771" file="f2" line="1771"/>
  </Constructor>
  <OperatorMethod id="_2176" name="=" returns="_6859" context="_846" access="public" location="f2:1771" file="f2" line="1771" inline="1" artificial="1" mangled="_ZN39CThostFtdcExchangeOrderActionErrorFieldaSERKS_">
    <Argument type="_6858" location="f2:1771" file="f2" line="1771"/>
  </OperatorMethod>
  <Destructor id="_2177" name="CThostFtdcExchangeOrderActionErrorField" context="_846" access="public" location="f2:1771" file="f2" line="1771" inline="1" artificial="1"/>
  <Field id="_2178" name="ExchangeID" type="_23" context="_847" access="public" location="f2:1795" file="f2" line="1795" offset="0"/>
  <Field id="_2179" name="TradeID" type="_36" context="_847" access="public" location="f2:1797" file="f2" line="1797" offset="72"/>
  <Field id="_2180" name="Direction" type="_70" context="_847" access="public" location="f2:1799" file="f2" line="1799" offset="240"/>
  <Field id="_2181" name="OrderSysID" type="_35" context="_847" access="public" location="f2:1801" file="f2" line="1801" offset="248"/>
  <Field id="_2182" name="ParticipantID" type="_15" context="_847" access="public" location="f2:1803" file="f2" line="1803" offset="416"/>
  <Field id="_2183" name="ClientID" type="_18" context="_847" access="public" location="f2:1805" file="f2" line="1805" offset="504"/>
  <Field id="_2184" name="TradingRole" type="_67" context="_847" access="public" location="f2:1807" file="f2" line="1807" offset="592"/>
  <Field id="_2185" name="ExchangeInstID" type="_13" context="_847" access="public" location="f2:1809" file="f2" line="1809" offset="600"/>
  <Field id="_2186" name="OffsetFlag" type="_79" context="_847" access="public" location="f2:1811" file="f2" line="1811" offset="848"/>
  <Field id="_2187" name="HedgeFlag" type="_75" context="_847" access="public" location="f2:1813" file="f2" line="1813" offset="856"/>
  <Field id="_2188" name="Price" type="_109" context="_847" access="public" location="f2:1815" file="f2" line="1815" offset="896"/>
  <Field id="_2189" name="Volume" type="_97" context="_847" access="public" location="f2:1817" file="f2" line="1817" offset="960"/>
  <Field id="_2190" name="TradeDate" type="_30" context="_847" access="public" location="f2:1819" file="f2" line="1819" offset="992"/>
  <Field id="_2191" name="TradeTime" type="_31" context="_847" access="public" location="f2:1821" file="f2" line="1821" offset="1064"/>
  <Field id="_2192" name="TradeType" type="_88" context="_847" access="public" location="f2:1823" file="f2" line="1823" offset="1136"/>
  <Field id="_2193" name="PriceSource" type="_89" context="_847" access="public" location="f2:1825" file="f2" line="1825" offset="1144"/>
  <Field id="_2194" name="TraderID" type="_8" context="_847" access="public" location="f2:1827" file="f2" line="1827" offset="1152"/>
  <Field id="_2195" name="OrderLocalID" type="_46" context="_847" access="public" location="f2:1829" file="f2" line="1829" offset="1320"/>
  <Field id="_2196" name="ClearingPartID" type="_15" context="_847" access="public" location="f2:1831" file="f2" line="1831" offset="1424"/>
  <Field id="_2197" name="BusinessUnit" type="_42" context="_847" access="public" location="f2:1833" file="f2" line="1833" offset="1512"/>
  <Field id="_2198" name="SequenceNo" type="_100" context="_847" access="public" location="f2:1835" file="f2" line="1835" offset="1696"/>
  <Field id="_2199" name="TradeSource" type="_591" context="_847" access="public" location="f2:1837" file="f2" line="1837" offset="1728"/>
  <Constructor id="_2200" name="CThostFtdcExchangeTradeField" context="_847" access="public" location="f2:1792" file="f2" line="1792" inline="1" artificial="1"/>
  <Constructor id="_2201" name="CThostFtdcExchangeTradeField" context="_847" access="public" location="f2:1792" file="f2" line="1792" inline="1" artificial="1">
    <Argument type="_6860" location="f2:1792" file="f2" line="1792"/>
  </Constructor>
  <OperatorMethod id="_2202" name="=" returns="_6861" context="_847" access="public" location="f2:1792" file="f2" line="1792" inline="1" artificial="1" mangled="_ZN28CThostFtdcExchangeTradeFieldaSERKS_">
    <Argument type="_6860" location="f2:1792" file="f2" line="1792"/>
  </OperatorMethod>
  <Destructor id="_2203" name="CThostFtdcExchangeTradeField" context="_847" access="public" location="f2:1792" file="f2" line="1792" inline="1" artificial="1"/>
  <Field id="_2204" name="BrokerID" type="_10" context="_848" access="public" location="f2:1844" file="f2" line="1844" offset="0"/>
  <Field id="_2205" name="InvestorID" type="_9" context="_848" access="public" location="f2:1846" file="f2" line="1846" offset="88"/>
  <Field id="_2206" name="InstrumentID" type="_19" context="_848" access="public" location="f2:1848" file="f2" line="1848" offset="192"/>
  <Field id="_2207" name="OrderRef" type="_14" context="_848" access="public" location="f2:1850" file="f2" line="1850" offset="440"/>
  <Field id="_2208" name="UserID" type="_16" context="_848" access="public" location="f2:1852" file="f2" line="1852" offset="544"/>
  <Field id="_2209" name="ExchangeID" type="_23" context="_848" access="public" location="f2:1854" file="f2" line="1854" offset="672"/>
  <Field id="_2210" name="TradeID" type="_36" context="_848" access="public" location="f2:1856" file="f2" line="1856" offset="744"/>
  <Field id="_2211" name="Direction" type="_70" context="_848" access="public" location="f2:1858" file="f2" line="1858" offset="912"/>
  <Field id="_2212" name="OrderSysID" type="_35" context="_848" access="public" location="f2:1860" file="f2" line="1860" offset="920"/>
  <Field id="_2213" name="ParticipantID" type="_15" context="_848" access="public" location="f2:1862" file="f2" line="1862" offset="1088"/>
  <Field id="_2214" name="ClientID" type="_18" context="_848" access="public" location="f2:1864" file="f2" line="1864" offset="1176"/>
  <Field id="_2215" name="TradingRole" type="_67" context="_848" access="public" location="f2:1866" file="f2" line="1866" offset="1264"/>
  <Field id="_2216" name="ExchangeInstID" type="_13" context="_848" access="public" location="f2:1868" file="f2" line="1868" offset="1272"/>
  <Field id="_2217" name="OffsetFlag" type="_79" context="_848" access="public" location="f2:1870" file="f2" line="1870" offset="1520"/>
  <Field id="_2218" name="HedgeFlag" type="_75" context="_848" access="public" location="f2:1872" file="f2" line="1872" offset="1528"/>
  <Field id="_2219" name="Price" type="_109" context="_848" access="public" location="f2:1874" file="f2" line="1874" offset="1536"/>
  <Field id="_2220" name="Volume" type="_97" context="_848" access="public" location="f2:1876" file="f2" line="1876" offset="1600"/>
  <Field id="_2221" name="TradeDate" type="_30" context="_848" access="public" location="f2:1878" file="f2" line="1878" offset="1632"/>
  <Field id="_2222" name="TradeTime" type="_31" context="_848" access="public" location="f2:1880" file="f2" line="1880" offset="1704"/>
  <Field id="_2223" name="TradeType" type="_88" context="_848" access="public" location="f2:1882" file="f2" line="1882" offset="1776"/>
  <Field id="_2224" name="PriceSource" type="_89" context="_848" access="public" location="f2:1884" file="f2" line="1884" offset="1784"/>
  <Field id="_2225" name="TraderID" type="_8" context="_848" access="public" location="f2:1886" file="f2" line="1886" offset="1792"/>
  <Field id="_2226" name="OrderLocalID" type="_46" context="_848" access="public" location="f2:1888" file="f2" line="1888" offset="1960"/>
  <Field id="_2227" name="ClearingPartID" type="_15" context="_848" access="public" location="f2:1890" file="f2" line="1890" offset="2064"/>
  <Field id="_2228" name="BusinessUnit" type="_42" context="_848" access="public" location="f2:1892" file="f2" line="1892" offset="2152"/>
  <Field id="_2229" name="SequenceNo" type="_100" context="_848" access="public" location="f2:1894" file="f2" line="1894" offset="2336"/>
  <Field id="_2230" name="TradingDay" type="_30" context="_848" access="public" location="f2:1896" file="f2" line="1896" offset="2368"/>
  <Field id="_2231" name="SettlementID" type="_96" context="_848" access="public" location="f2:1898" file="f2" line="1898" offset="2464"/>
  <Field id="_2232" name="BrokerOrderSeq" type="_100" context="_848" access="public" location="f2:1900" file="f2" line="1900" offset="2496"/>
  <Field id="_2233" name="TradeSource" type="_591" context="_848" access="public" location="f2:1902" file="f2" line="1902" offset="2528"/>
  <Field id="_2234" name="InvestUnitID" type="_748" context="_848" access="public" location="f2:1904" file="f2" line="1904" offset="2536"/>
  <Constructor id="_2235" name="CThostFtdcTradeField" context="_848" access="public" location="f2:1841" file="f2" line="1841" inline="1" artificial="1"/>
  <Constructor id="_2236" name="CThostFtdcTradeField" context="_848" access="public" location="f2:1841" file="f2" line="1841" inline="1" artificial="1">
    <Argument type="_6862" location="f2:1841" file="f2" line="1841"/>
  </Constructor>
  <OperatorMethod id="_2237" name="=" returns="_6863" context="_848" access="public" location="f2:1841" file="f2" line="1841" inline="1" artificial="1" mangled="_ZN20CThostFtdcTradeFieldaSERKS_">
    <Argument type="_6862" location="f2:1841" file="f2" line="1841"/>
  </OperatorMethod>
  <Destructor id="_2238" name="CThostFtdcTradeField" context="_848" access="public" location="f2:1841" file="f2" line="1841" inline="1" artificial="1"/>
  <Field id="_2239" name="FrontID" type="_98" context="_849" access="public" location="f2:1911" file="f2" line="1911" offset="0"/>
  <Field id="_2240" name="SessionID" type="_99" context="_849" access="public" location="f2:1913" file="f2" line="1913" offset="32"/>
  <Field id="_2241" name="BrokerID" type="_10" context="_849" access="public" location="f2:1915" file="f2" line="1915" offset="64"/>
  <Field id="_2242" name="UserID" type="_16" context="_849" access="public" location="f2:1917" file="f2" line="1917" offset="152"/>
  <Field id="_2243" name="LoginDate" type="_30" context="_849" access="public" location="f2:1919" file="f2" line="1919" offset="280"/>
  <Field id="_2244" name="LoginTime" type="_31" context="_849" access="public" location="f2:1921" file="f2" line="1921" offset="352"/>
  <Field id="_2245" name="IPAddress" type="_38" context="_849" access="public" location="f2:1923" file="f2" line="1923" offset="424"/>
  <Field id="_2246" name="UserProductInfo" type="_40" context="_849" access="public" location="f2:1925" file="f2" line="1925" offset="552"/>
  <Field id="_2247" name="InterfaceProductInfo" type="_40" context="_849" access="public" location="f2:1927" file="f2" line="1927" offset="640"/>
  <Field id="_2248" name="ProtocolInfo" type="_41" context="_849" access="public" location="f2:1929" file="f2" line="1929" offset="728"/>
  <Field id="_2249" name="MacAddress" type="_27" context="_849" access="public" location="f2:1931" file="f2" line="1931" offset="816"/>
  <Field id="_2250" name="LoginRemark" type="_747" context="_849" access="public" location="f2:1933" file="f2" line="1933" offset="984"/>
  <Constructor id="_2251" name="CThostFtdcUserSessionField" context="_849" access="public" location="f2:1908" file="f2" line="1908" inline="1" artificial="1"/>
  <Constructor id="_2252" name="CThostFtdcUserSessionField" context="_849" access="public" location="f2:1908" file="f2" line="1908" inline="1" artificial="1">
    <Argument type="_6864" location="f2:1908" file="f2" line="1908"/>
  </Constructor>
  <OperatorMethod id="_2253" name="=" returns="_6865" context="_849" access="public" location="f2:1908" file="f2" line="1908" inline="1" artificial="1" mangled="_ZN26CThostFtdcUserSessionFieldaSERKS_">
    <Argument type="_6864" location="f2:1908" file="f2" line="1908"/>
  </OperatorMethod>
  <Destructor id="_2254" name="CThostFtdcUserSessionField" context="_849" access="public" location="f2:1908" file="f2" line="1908" inline="1" artificial="1"/>
  <Field id="_2255" name="BrokerID" type="_10" context="_850" access="public" location="f2:1940" file="f2" line="1940" offset="0"/>
  <Field id="_2256" name="InvestorID" type="_9" context="_850" access="public" location="f2:1942" file="f2" line="1942" offset="88"/>
  <Field id="_2257" name="InstrumentID" type="_19" context="_850" access="public" location="f2:1944" file="f2" line="1944" offset="192"/>
  <Field id="_2258" name="Direction" type="_70" context="_850" access="public" location="f2:1946" file="f2" line="1946" offset="440"/>
  <Field id="_2259" name="OffsetFlag" type="_79" context="_850" access="public" location="f2:1948" file="f2" line="1948" offset="448"/>
  <Field id="_2260" name="HedgeFlag" type="_75" context="_850" access="public" location="f2:1950" file="f2" line="1950" offset="456"/>
  <Field id="_2261" name="MaxVolume" type="_97" context="_850" access="public" location="f2:1952" file="f2" line="1952" offset="480"/>
  <Field id="_2262" name="ExchangeID" type="_23" context="_850" access="public" location="f2:1954" file="f2" line="1954" offset="512"/>
  <Field id="_2263" name="InvestUnitID" type="_748" context="_850" access="public" location="f2:1956" file="f2" line="1956" offset="584"/>
  <Constructor id="_2264" name="CThostFtdcQueryMaxOrderVolumeField" context="_850" access="public" location="f2:1937" file="f2" line="1937" inline="1" artificial="1"/>
  <Constructor id="_2265" name="CThostFtdcQueryMaxOrderVolumeField" context="_850" access="public" location="f2:1937" file="f2" line="1937" inline="1" artificial="1">
    <Argument type="_6866" location="f2:1937" file="f2" line="1937"/>
  </Constructor>
  <OperatorMethod id="_2266" name="=" returns="_6867" context="_850" access="public" location="f2:1937" file="f2" line="1937" inline="1" artificial="1" mangled="_ZN34CThostFtdcQueryMaxOrderVolumeFieldaSERKS_">
    <Argument type="_6866" location="f2:1937" file="f2" line="1937"/>
  </OperatorMethod>
  <Destructor id="_2267" name="CThostFtdcQueryMaxOrderVolumeField" context="_850" access="public" location="f2:1937" file="f2" line="1937" inline="1" artificial="1"/>
  <Field id="_2268" name="BrokerID" type="_10" context="_851" access="public" location="f2:1963" file="f2" line="1963" offset="0"/>
  <Field id="_2269" name="InvestorID" type="_9" context="_851" access="public" location="f2:1965" file="f2" line="1965" offset="88"/>
  <Field id="_2270" name="ConfirmDate" type="_30" context="_851" access="public" location="f2:1967" file="f2" line="1967" offset="192"/>
  <Field id="_2271" name="ConfirmTime" type="_31" context="_851" access="public" location="f2:1969" file="f2" line="1969" offset="264"/>
  <Field id="_2272" name="SettlementID" type="_96" context="_851" access="public" location="f2:1971" file="f2" line="1971" offset="352"/>
  <Field id="_2273" name="AccountID" type="_170" context="_851" access="public" location="f2:1973" file="f2" line="1973" offset="384"/>
  <Field id="_2274" name="CurrencyID" type="_335" context="_851" access="public" location="f2:1975" file="f2" line="1975" offset="488"/>
  <Constructor id="_2275" name="CThostFtdcSettlementInfoConfirmField" context="_851" access="public" location="f2:1960" file="f2" line="1960" inline="1" artificial="1"/>
  <Constructor id="_2276" name="CThostFtdcSettlementInfoConfirmField" context="_851" access="public" location="f2:1960" file="f2" line="1960" inline="1" artificial="1">
    <Argument type="_6868" location="f2:1960" file="f2" line="1960"/>
  </Constructor>
  <OperatorMethod id="_2277" name="=" returns="_6869" context="_851" access="public" location="f2:1960" file="f2" line="1960" inline="1" artificial="1" mangled="_ZN36CThostFtdcSettlementInfoConfirmFieldaSERKS_">
    <Argument type="_6868" location="f2:1960" file="f2" line="1960"/>
  </OperatorMethod>
  <Destructor id="_2278" name="CThostFtdcSettlementInfoConfirmField" context="_851" access="public" location="f2:1960" file="f2" line="1960" inline="1" artificial="1"/>
  <Field id="_2279" name="DepositSeqNo" type="_43" context="_852" access="public" location="f2:1982" file="f2" line="1982" offset="0"/>
  <Field id="_2280" name="BrokerID" type="_10" context="_852" access="public" location="f2:1984" file="f2" line="1984" offset="120"/>
  <Field id="_2281" name="InvestorID" type="_9" context="_852" access="public" location="f2:1986" file="f2" line="1986" offset="208"/>
  <Field id="_2282" name="Deposit" type="_113" context="_852" access="public" location="f2:1988" file="f2" line="1988" offset="320"/>
  <Field id="_2283" name="IsForce" type="_108" context="_852" access="public" location="f2:1990" file="f2" line="1990" offset="384"/>
  <Field id="_2284" name="CurrencyID" type="_335" context="_852" access="public" location="f2:1992" file="f2" line="1992" offset="416"/>
  <Constructor id="_2285" name="CThostFtdcSyncDepositField" context="_852" access="public" location="f2:1979" file="f2" line="1979" inline="1" artificial="1"/>
  <Constructor id="_2286" name="CThostFtdcSyncDepositField" context="_852" access="public" location="f2:1979" file="f2" line="1979" inline="1" artificial="1">
    <Argument type="_6870" location="f2:1979" file="f2" line="1979"/>
  </Constructor>
  <OperatorMethod id="_2287" name="=" returns="_6871" context="_852" access="public" location="f2:1979" file="f2" line="1979" inline="1" artificial="1" mangled="_ZN26CThostFtdcSyncDepositFieldaSERKS_">
    <Argument type="_6870" location="f2:1979" file="f2" line="1979"/>
  </OperatorMethod>
  <Destructor id="_2288" name="CThostFtdcSyncDepositField" context="_852" access="public" location="f2:1979" file="f2" line="1979" inline="1" artificial="1"/>
  <Field id="_2289" name="MortgageSeqNo" type="_43" context="_853" access="public" location="f2:1999" file="f2" line="1999" offset="0"/>
  <Field id="_2290" name="BrokerID" type="_10" context="_853" access="public" location="f2:2001" file="f2" line="2001" offset="120"/>
  <Field id="_2291" name="InvestorID" type="_9" context="_853" access="public" location="f2:2003" file="f2" line="2003" offset="208"/>
  <Field id="_2292" name="FromCurrencyID" type="_335" context="_853" access="public" location="f2:2005" file="f2" line="2005" offset="312"/>
  <Field id="_2293" name="MortgageAmount" type="_113" context="_853" access="public" location="f2:2007" file="f2" line="2007" offset="384"/>
  <Field id="_2294" name="ToCurrencyID" type="_335" context="_853" access="public" location="f2:2009" file="f2" line="2009" offset="448"/>
  <Constructor id="_2295" name="CThostFtdcSyncFundMortgageField" context="_853" access="public" location="f2:1996" file="f2" line="1996" inline="1" artificial="1"/>
  <Constructor id="_2296" name="CThostFtdcSyncFundMortgageField" context="_853" access="public" location="f2:1996" file="f2" line="1996" inline="1" artificial="1">
    <Argument type="_6872" location="f2:1996" file="f2" line="1996"/>
  </Constructor>
  <OperatorMethod id="_2297" name="=" returns="_6873" context="_853" access="public" location="f2:1996" file="f2" line="1996" inline="1" artificial="1" mangled="_ZN31CThostFtdcSyncFundMortgageFieldaSERKS_">
    <Argument type="_6872" location="f2:1996" file="f2" line="1996"/>
  </OperatorMethod>
  <Destructor id="_2298" name="CThostFtdcSyncFundMortgageField" context="_853" access="public" location="f2:1996" file="f2" line="1996" inline="1" artificial="1"/>
  <Field id="_2299" name="BrokerID" type="_10" context="_854" access="public" location="f2:2016" file="f2" line="2016" offset="0"/>
  <Constructor id="_2300" name="CThostFtdcBrokerSyncField" context="_854" access="public" location="f2:2013" file="f2" line="2013" inline="1" artificial="1"/>
  <Constructor id="_2301" name="CThostFtdcBrokerSyncField" context="_854" access="public" location="f2:2013" file="f2" line="2013" inline="1" artificial="1">
    <Argument type="_6874" location="f2:2013" file="f2" line="2013"/>
  </Constructor>
  <OperatorMethod id="_2302" name="=" returns="_6875" context="_854" access="public" location="f2:2013" file="f2" line="2013" inline="1" artificial="1" mangled="_ZN25CThostFtdcBrokerSyncFieldaSERKS_">
    <Argument type="_6874" location="f2:2013" file="f2" line="2013"/>
  </OperatorMethod>
  <Destructor id="_2303" name="CThostFtdcBrokerSyncField" context="_854" access="public" location="f2:2013" file="f2" line="2013" inline="1" artificial="1"/>
  <Field id="_2304" name="InvestorID" type="_9" context="_855" access="public" location="f2:2023" file="f2" line="2023" offset="0"/>
  <Field id="_2305" name="BrokerID" type="_10" context="_855" access="public" location="f2:2025" file="f2" line="2025" offset="104"/>
  <Field id="_2306" name="InvestorGroupID" type="_9" context="_855" access="public" location="f2:2027" file="f2" line="2027" offset="192"/>
  <Field id="_2307" name="InvestorName" type="_48" context="_855" access="public" location="f2:2029" file="f2" line="2029" offset="296"/>
  <Field id="_2308" name="IdentifiedCardType" type="_45" context="_855" access="public" location="f2:2031" file="f2" line="2031" offset="944"/>
  <Field id="_2309" name="IdentifiedCardNo" type="_44" context="_855" access="public" location="f2:2033" file="f2" line="2033" offset="952"/>
  <Field id="_2310" name="IsActive" type="_108" context="_855" access="public" location="f2:2035" file="f2" line="2035" offset="1376"/>
  <Field id="_2311" name="Telephone" type="_126" context="_855" access="public" location="f2:2037" file="f2" line="2037" offset="1408"/>
  <Field id="_2312" name="Address" type="_124" context="_855" access="public" location="f2:2039" file="f2" line="2039" offset="1736"/>
  <Field id="_2313" name="OpenDate" type="_30" context="_855" access="public" location="f2:2041" file="f2" line="2041" offset="2544"/>
  <Field id="_2314" name="Mobile" type="_128" context="_855" access="public" location="f2:2043" file="f2" line="2043" offset="2616"/>
  <Field id="_2315" name="CommModelID" type="_9" context="_855" access="public" location="f2:2045" file="f2" line="2045" offset="2944"/>
  <Field id="_2316" name="MarginModelID" type="_9" context="_855" access="public" location="f2:2047" file="f2" line="2047" offset="3048"/>
  <Constructor id="_2317" name="CThostFtdcSyncingInvestorField" context="_855" access="public" location="f2:2020" file="f2" line="2020" inline="1" artificial="1"/>
  <Constructor id="_2318" name="CThostFtdcSyncingInvestorField" context="_855" access="public" location="f2:2020" file="f2" line="2020" inline="1" artificial="1">
    <Argument type="_6876" location="f2:2020" file="f2" line="2020"/>
  </Constructor>
  <OperatorMethod id="_2319" name="=" returns="_6877" context="_855" access="public" location="f2:2020" file="f2" line="2020" inline="1" artificial="1" mangled="_ZN30CThostFtdcSyncingInvestorFieldaSERKS_">
    <Argument type="_6876" location="f2:2020" file="f2" line="2020"/>
  </OperatorMethod>
  <Destructor id="_2320" name="CThostFtdcSyncingInvestorField" context="_855" access="public" location="f2:2020" file="f2" line="2020" inline="1" artificial="1"/>
  <Field id="_2321" name="InvestorID" type="_9" context="_856" access="public" location="f2:2054" file="f2" line="2054" offset="0"/>
  <Field id="_2322" name="BrokerID" type="_10" context="_856" access="public" location="f2:2056" file="f2" line="2056" offset="104"/>
  <Field id="_2323" name="ExchangeID" type="_23" context="_856" access="public" location="f2:2058" file="f2" line="2058" offset="192"/>
  <Field id="_2324" name="ClientID" type="_18" context="_856" access="public" location="f2:2060" file="f2" line="2060" offset="264"/>
  <Field id="_2325" name="IsActive" type="_108" context="_856" access="public" location="f2:2062" file="f2" line="2062" offset="352"/>
  <Field id="_2326" name="ClientIDType" type="_77" context="_856" access="public" location="f2:2064" file="f2" line="2064" offset="384"/>
  <Constructor id="_2327" name="CThostFtdcSyncingTradingCodeField" context="_856" access="public" location="f2:2051" file="f2" line="2051" inline="1" artificial="1"/>
  <Constructor id="_2328" name="CThostFtdcSyncingTradingCodeField" context="_856" access="public" location="f2:2051" file="f2" line="2051" inline="1" artificial="1">
    <Argument type="_6878" location="f2:2051" file="f2" line="2051"/>
  </Constructor>
  <OperatorMethod id="_2329" name="=" returns="_6879" context="_856" access="public" location="f2:2051" file="f2" line="2051" inline="1" artificial="1" mangled="_ZN33CThostFtdcSyncingTradingCodeFieldaSERKS_">
    <Argument type="_6878" location="f2:2051" file="f2" line="2051"/>
  </OperatorMethod>
  <Destructor id="_2330" name="CThostFtdcSyncingTradingCodeField" context="_856" access="public" location="f2:2051" file="f2" line="2051" inline="1" artificial="1"/>
  <Field id="_2331" name="BrokerID" type="_10" context="_857" access="public" location="f2:2071" file="f2" line="2071" offset="0"/>
  <Field id="_2332" name="InvestorGroupID" type="_9" context="_857" access="public" location="f2:2073" file="f2" line="2073" offset="88"/>
  <Field id="_2333" name="InvestorGroupName" type="_153" context="_857" access="public" location="f2:2075" file="f2" line="2075" offset="192"/>
  <Constructor id="_2334" name="CThostFtdcSyncingInvestorGroupField" context="_857" access="public" location="f2:2068" file="f2" line="2068" inline="1" artificial="1"/>
  <Constructor id="_2335" name="CThostFtdcSyncingInvestorGroupField" context="_857" access="public" location="f2:2068" file="f2" line="2068" inline="1" artificial="1">
    <Argument type="_6880" location="f2:2068" file="f2" line="2068"/>
  </Constructor>
  <OperatorMethod id="_2336" name="=" returns="_6881" context="_857" access="public" location="f2:2068" file="f2" line="2068" inline="1" artificial="1" mangled="_ZN35CThostFtdcSyncingInvestorGroupFieldaSERKS_">
    <Argument type="_6880" location="f2:2068" file="f2" line="2068"/>
  </OperatorMethod>
  <Destructor id="_2337" name="CThostFtdcSyncingInvestorGroupField" context="_857" access="public" location="f2:2068" file="f2" line="2068" inline="1" artificial="1"/>
  <Field id="_2338" name="BrokerID" type="_10" context="_858" access="public" location="f2:2082" file="f2" line="2082" offset="0"/>
  <Field id="_2339" name="AccountID" type="_170" context="_858" access="public" location="f2:2084" file="f2" line="2084" offset="88"/>
  <Field id="_2340" name="PreMortgage" type="_113" context="_858" access="public" location="f2:2086" file="f2" line="2086" offset="192"/>
  <Field id="_2341" name="PreCredit" type="_113" context="_858" access="public" location="f2:2088" file="f2" line="2088" offset="256"/>
  <Field id="_2342" name="PreDeposit" type="_113" context="_858" access="public" location="f2:2090" file="f2" line="2090" offset="320"/>
  <Field id="_2343" name="PreBalance" type="_113" context="_858" access="public" location="f2:2092" file="f2" line="2092" offset="384"/>
  <Field id="_2344" name="PreMargin" type="_113" context="_858" access="public" location="f2:2094" file="f2" line="2094" offset="448"/>
  <Field id="_2345" name="InterestBase" type="_113" context="_858" access="public" location="f2:2096" file="f2" line="2096" offset="512"/>
  <Field id="_2346" name="Interest" type="_113" context="_858" access="public" location="f2:2098" file="f2" line="2098" offset="576"/>
  <Field id="_2347" name="Deposit" type="_113" context="_858" access="public" location="f2:2100" file="f2" line="2100" offset="640"/>
  <Field id="_2348" name="Withdraw" type="_113" context="_858" access="public" location="f2:2102" file="f2" line="2102" offset="704"/>
  <Field id="_2349" name="FrozenMargin" type="_113" context="_858" access="public" location="f2:2104" file="f2" line="2104" offset="768"/>
  <Field id="_2350" name="FrozenCash" type="_113" context="_858" access="public" location="f2:2106" file="f2" line="2106" offset="832"/>
  <Field id="_2351" name="FrozenCommission" type="_113" context="_858" access="public" location="f2:2108" file="f2" line="2108" offset="896"/>
  <Field id="_2352" name="CurrMargin" type="_113" context="_858" access="public" location="f2:2110" file="f2" line="2110" offset="960"/>
  <Field id="_2353" name="CashIn" type="_113" context="_858" access="public" location="f2:2112" file="f2" line="2112" offset="1024"/>
  <Field id="_2354" name="Commission" type="_113" context="_858" access="public" location="f2:2114" file="f2" line="2114" offset="1088"/>
  <Field id="_2355" name="CloseProfit" type="_113" context="_858" access="public" location="f2:2116" file="f2" line="2116" offset="1152"/>
  <Field id="_2356" name="PositionProfit" type="_113" context="_858" access="public" location="f2:2118" file="f2" line="2118" offset="1216"/>
  <Field id="_2357" name="Balance" type="_113" context="_858" access="public" location="f2:2120" file="f2" line="2120" offset="1280"/>
  <Field id="_2358" name="Available" type="_113" context="_858" access="public" location="f2:2122" file="f2" line="2122" offset="1344"/>
  <Field id="_2359" name="WithdrawQuota" type="_113" context="_858" access="public" location="f2:2124" file="f2" line="2124" offset="1408"/>
  <Field id="_2360" name="Reserve" type="_113" context="_858" access="public" location="f2:2126" file="f2" line="2126" offset="1472"/>
  <Field id="_2361" name="TradingDay" type="_30" context="_858" access="public" location="f2:2128" file="f2" line="2128" offset="1536"/>
  <Field id="_2362" name="SettlementID" type="_96" context="_858" access="public" location="f2:2130" file="f2" line="2130" offset="1632"/>
  <Field id="_2363" name="Credit" type="_113" context="_858" access="public" location="f2:2132" file="f2" line="2132" offset="1664"/>
  <Field id="_2364" name="Mortgage" type="_113" context="_858" access="public" location="f2:2134" file="f2" line="2134" offset="1728"/>
  <Field id="_2365" name="ExchangeMargin" type="_113" context="_858" access="public" location="f2:2136" file="f2" line="2136" offset="1792"/>
  <Field id="_2366" name="DeliveryMargin" type="_113" context="_858" access="public" location="f2:2138" file="f2" line="2138" offset="1856"/>
  <Field id="_2367" name="ExchangeDeliveryMargin" type="_113" context="_858" access="public" location="f2:2140" file="f2" line="2140" offset="1920"/>
  <Field id="_2368" name="ReserveBalance" type="_113" context="_858" access="public" location="f2:2142" file="f2" line="2142" offset="1984"/>
  <Field id="_2369" name="CurrencyID" type="_335" context="_858" access="public" location="f2:2144" file="f2" line="2144" offset="2048"/>
  <Field id="_2370" name="PreFundMortgageIn" type="_113" context="_858" access="public" location="f2:2146" file="f2" line="2146" offset="2112"/>
  <Field id="_2371" name="PreFundMortgageOut" type="_113" context="_858" access="public" location="f2:2148" file="f2" line="2148" offset="2176"/>
  <Field id="_2372" name="FundMortgageIn" type="_113" context="_858" access="public" location="f2:2150" file="f2" line="2150" offset="2240"/>
  <Field id="_2373" name="FundMortgageOut" type="_113" context="_858" access="public" location="f2:2152" file="f2" line="2152" offset="2304"/>
  <Field id="_2374" name="FundMortgageAvailable" type="_113" context="_858" access="public" location="f2:2154" file="f2" line="2154" offset="2368"/>
  <Field id="_2375" name="MortgageableFund" type="_113" context="_858" access="public" location="f2:2156" file="f2" line="2156" offset="2432"/>
  <Field id="_2376" name="SpecProductMargin" type="_113" context="_858" access="public" location="f2:2158" file="f2" line="2158" offset="2496"/>
  <Field id="_2377" name="SpecProductFrozenMargin" type="_113" context="_858" access="public" location="f2:2160" file="f2" line="2160" offset="2560"/>
  <Field id="_2378" name="SpecProductCommission" type="_113" context="_858" access="public" location="f2:2162" file="f2" line="2162" offset="2624"/>
  <Field id="_2379" name="SpecProductFrozenCommission" type="_113" context="_858" access="public" location="f2:2164" file="f2" line="2164" offset="2688"/>
  <Field id="_2380" name="SpecProductPositionProfit" type="_113" context="_858" access="public" location="f2:2166" file="f2" line="2166" offset="2752"/>
  <Field id="_2381" name="SpecProductCloseProfit" type="_113" context="_858" access="public" location="f2:2168" file="f2" line="2168" offset="2816"/>
  <Field id="_2382" name="SpecProductPositionProfitByAlg" type="_113" context="_858" access="public" location="f2:2170" file="f2" line="2170" offset="2880"/>
  <Field id="_2383" name="SpecProductExchangeMargin" type="_113" context="_858" access="public" location="f2:2172" file="f2" line="2172" offset="2944"/>
  <Field id="_2384" name="FrozenSwap" type="_113" context="_858" access="public" location="f2:2174" file="f2" line="2174" offset="3008"/>
  <Field id="_2385" name="RemainSwap" type="_113" context="_858" access="public" location="f2:2176" file="f2" line="2176" offset="3072"/>
  <Constructor id="_2386" name="CThostFtdcSyncingTradingAccountField" context="_858" access="public" location="f2:2079" file="f2" line="2079" inline="1" artificial="1"/>
  <Constructor id="_2387" name="CThostFtdcSyncingTradingAccountField" context="_858" access="public" location="f2:2079" file="f2" line="2079" inline="1" artificial="1">
    <Argument type="_6882" location="f2:2079" file="f2" line="2079"/>
  </Constructor>
  <OperatorMethod id="_2388" name="=" returns="_6883" context="_858" access="public" location="f2:2079" file="f2" line="2079" inline="1" artificial="1" mangled="_ZN36CThostFtdcSyncingTradingAccountFieldaSERKS_">
    <Argument type="_6882" location="f2:2079" file="f2" line="2079"/>
  </OperatorMethod>
  <Destructor id="_2389" name="CThostFtdcSyncingTradingAccountField" context="_858" access="public" location="f2:2079" file="f2" line="2079" inline="1" artificial="1"/>
  <Field id="_2390" name="InstrumentID" type="_19" context="_859" access="public" location="f2:2183" file="f2" line="2183" offset="0"/>
  <Field id="_2391" name="BrokerID" type="_10" context="_859" access="public" location="f2:2185" file="f2" line="2185" offset="248"/>
  <Field id="_2392" name="InvestorID" type="_9" context="_859" access="public" location="f2:2187" file="f2" line="2187" offset="336"/>
  <Field id="_2393" name="PosiDirection" type="_72" context="_859" access="public" location="f2:2189" file="f2" line="2189" offset="440"/>
  <Field id="_2394" name="HedgeFlag" type="_75" context="_859" access="public" location="f2:2191" file="f2" line="2191" offset="448"/>
  <Field id="_2395" name="PositionDate" type="_65" context="_859" access="public" location="f2:2193" file="f2" line="2193" offset="456"/>
  <Field id="_2396" name="YdPosition" type="_97" context="_859" access="public" location="f2:2195" file="f2" line="2195" offset="480"/>
  <Field id="_2397" name="Position" type="_97" context="_859" access="public" location="f2:2197" file="f2" line="2197" offset="512"/>
  <Field id="_2398" name="LongFrozen" type="_97" context="_859" access="public" location="f2:2199" file="f2" line="2199" offset="544"/>
  <Field id="_2399" name="ShortFrozen" type="_97" context="_859" access="public" location="f2:2201" file="f2" line="2201" offset="576"/>
  <Field id="_2400" name="LongFrozenAmount" type="_113" context="_859" access="public" location="f2:2203" file="f2" line="2203" offset="640"/>
  <Field id="_2401" name="ShortFrozenAmount" type="_113" context="_859" access="public" location="f2:2205" file="f2" line="2205" offset="704"/>
  <Field id="_2402" name="OpenVolume" type="_97" context="_859" access="public" location="f2:2207" file="f2" line="2207" offset="768"/>
  <Field id="_2403" name="CloseVolume" type="_97" context="_859" access="public" location="f2:2209" file="f2" line="2209" offset="800"/>
  <Field id="_2404" name="OpenAmount" type="_113" context="_859" access="public" location="f2:2211" file="f2" line="2211" offset="832"/>
  <Field id="_2405" name="CloseAmount" type="_113" context="_859" access="public" location="f2:2213" file="f2" line="2213" offset="896"/>
  <Field id="_2406" name="PositionCost" type="_113" context="_859" access="public" location="f2:2215" file="f2" line="2215" offset="960"/>
  <Field id="_2407" name="PreMargin" type="_113" context="_859" access="public" location="f2:2217" file="f2" line="2217" offset="1024"/>
  <Field id="_2408" name="UseMargin" type="_113" context="_859" access="public" location="f2:2219" file="f2" line="2219" offset="1088"/>
  <Field id="_2409" name="FrozenMargin" type="_113" context="_859" access="public" location="f2:2221" file="f2" line="2221" offset="1152"/>
  <Field id="_2410" name="FrozenCash" type="_113" context="_859" access="public" location="f2:2223" file="f2" line="2223" offset="1216"/>
  <Field id="_2411" name="FrozenCommission" type="_113" context="_859" access="public" location="f2:2225" file="f2" line="2225" offset="1280"/>
  <Field id="_2412" name="CashIn" type="_113" context="_859" access="public" location="f2:2227" file="f2" line="2227" offset="1344"/>
  <Field id="_2413" name="Commission" type="_113" context="_859" access="public" location="f2:2229" file="f2" line="2229" offset="1408"/>
  <Field id="_2414" name="CloseProfit" type="_113" context="_859" access="public" location="f2:2231" file="f2" line="2231" offset="1472"/>
  <Field id="_2415" name="PositionProfit" type="_113" context="_859" access="public" location="f2:2233" file="f2" line="2233" offset="1536"/>
  <Field id="_2416" name="PreSettlementPrice" type="_109" context="_859" access="public" location="f2:2235" file="f2" line="2235" offset="1600"/>
  <Field id="_2417" name="SettlementPrice" type="_109" context="_859" access="public" location="f2:2237" file="f2" line="2237" offset="1664"/>
  <Field id="_2418" name="TradingDay" type="_30" context="_859" access="public" location="f2:2239" file="f2" line="2239" offset="1728"/>
  <Field id="_2419" name="SettlementID" type="_96" context="_859" access="public" location="f2:2241" file="f2" line="2241" offset="1824"/>
  <Field id="_2420" name="OpenCost" type="_113" context="_859" access="public" location="f2:2243" file="f2" line="2243" offset="1856"/>
  <Field id="_2421" name="ExchangeMargin" type="_113" context="_859" access="public" location="f2:2245" file="f2" line="2245" offset="1920"/>
  <Field id="_2422" name="CombPosition" type="_97" context="_859" access="public" location="f2:2247" file="f2" line="2247" offset="1984"/>
  <Field id="_2423" name="CombLongFrozen" type="_97" context="_859" access="public" location="f2:2249" file="f2" line="2249" offset="2016"/>
  <Field id="_2424" name="CombShortFrozen" type="_97" context="_859" access="public" location="f2:2251" file="f2" line="2251" offset="2048"/>
  <Field id="_2425" name="CloseProfitByDate" type="_113" context="_859" access="public" location="f2:2253" file="f2" line="2253" offset="2112"/>
  <Field id="_2426" name="CloseProfitByTrade" type="_113" context="_859" access="public" location="f2:2255" file="f2" line="2255" offset="2176"/>
  <Field id="_2427" name="TodayPosition" type="_97" context="_859" access="public" location="f2:2257" file="f2" line="2257" offset="2240"/>
  <Field id="_2428" name="MarginRateByMoney" type="_112" context="_859" access="public" location="f2:2259" file="f2" line="2259" offset="2304"/>
  <Field id="_2429" name="MarginRateByVolume" type="_112" context="_859" access="public" location="f2:2261" file="f2" line="2261" offset="2368"/>
  <Field id="_2430" name="StrikeFrozen" type="_97" context="_859" access="public" location="f2:2263" file="f2" line="2263" offset="2432"/>
  <Field id="_2431" name="StrikeFrozenAmount" type="_113" context="_859" access="public" location="f2:2265" file="f2" line="2265" offset="2496"/>
  <Field id="_2432" name="AbandonFrozen" type="_97" context="_859" access="public" location="f2:2267" file="f2" line="2267" offset="2560"/>
  <Field id="_2433" name="ExchangeID" type="_23" context="_859" access="public" location="f2:2269" file="f2" line="2269" offset="2592"/>
  <Field id="_2434" name="YdStrikeFrozen" type="_97" context="_859" access="public" location="f2:2271" file="f2" line="2271" offset="2688"/>
  <Field id="_2435" name="InvestUnitID" type="_748" context="_859" access="public" location="f2:2273" file="f2" line="2273" offset="2720"/>
  <Field id="_2436" name="PositionCostOffset" type="_113" context="_859" access="public" location="f2:2275" file="f2" line="2275" offset="2880"/>
  <Constructor id="_2437" name="CThostFtdcSyncingInvestorPositionField" context="_859" access="public" location="f2:2180" file="f2" line="2180" inline="1" artificial="1"/>
  <Constructor id="_2438" name="CThostFtdcSyncingInvestorPositionField" context="_859" access="public" location="f2:2180" file="f2" line="2180" inline="1" artificial="1">
    <Argument type="_6884" location="f2:2180" file="f2" line="2180"/>
  </Constructor>
  <OperatorMethod id="_2439" name="=" returns="_6885" context="_859" access="public" location="f2:2180" file="f2" line="2180" inline="1" artificial="1" mangled="_ZN38CThostFtdcSyncingInvestorPositionFieldaSERKS_">
    <Argument type="_6884" location="f2:2180" file="f2" line="2180"/>
  </OperatorMethod>
  <Destructor id="_2440" name="CThostFtdcSyncingInvestorPositionField" context="_859" access="public" location="f2:2180" file="f2" line="2180" inline="1" artificial="1"/>
  <Field id="_2441" name="InstrumentID" type="_19" context="_860" access="public" location="f2:2282" file="f2" line="2282" offset="0"/>
  <Field id="_2442" name="InvestorRange" type="_54" context="_860" access="public" location="f2:2284" file="f2" line="2284" offset="248"/>
  <Field id="_2443" name="BrokerID" type="_10" context="_860" access="public" location="f2:2286" file="f2" line="2286" offset="256"/>
  <Field id="_2444" name="InvestorID" type="_9" context="_860" access="public" location="f2:2288" file="f2" line="2288" offset="344"/>
  <Field id="_2445" name="HedgeFlag" type="_75" context="_860" access="public" location="f2:2290" file="f2" line="2290" offset="448"/>
  <Field id="_2446" name="LongMarginRatioByMoney" type="_112" context="_860" access="public" location="f2:2292" file="f2" line="2292" offset="512"/>
  <Field id="_2447" name="LongMarginRatioByVolume" type="_113" context="_860" access="public" location="f2:2294" file="f2" line="2294" offset="576"/>
  <Field id="_2448" name="ShortMarginRatioByMoney" type="_112" context="_860" access="public" location="f2:2296" file="f2" line="2296" offset="640"/>
  <Field id="_2449" name="ShortMarginRatioByVolume" type="_113" context="_860" access="public" location="f2:2298" file="f2" line="2298" offset="704"/>
  <Field id="_2450" name="IsRelative" type="_108" context="_860" access="public" location="f2:2300" file="f2" line="2300" offset="768"/>
  <Constructor id="_2451" name="CThostFtdcSyncingInstrumentMarginRateField" context="_860" access="public" location="f2:2279" file="f2" line="2279" inline="1" artificial="1"/>
  <Constructor id="_2452" name="CThostFtdcSyncingInstrumentMarginRateField" context="_860" access="public" location="f2:2279" file="f2" line="2279" inline="1" artificial="1">
    <Argument type="_6886" location="f2:2279" file="f2" line="2279"/>
  </Constructor>
  <OperatorMethod id="_2453" name="=" returns="_6887" context="_860" access="public" location="f2:2279" file="f2" line="2279" inline="1" artificial="1" mangled="_ZN42CThostFtdcSyncingInstrumentMarginRateFieldaSERKS_">
    <Argument type="_6886" location="f2:2279" file="f2" line="2279"/>
  </OperatorMethod>
  <Destructor id="_2454" name="CThostFtdcSyncingInstrumentMarginRateField" context="_860" access="public" location="f2:2279" file="f2" line="2279" inline="1" artificial="1"/>
  <Field id="_2455" name="InstrumentID" type="_19" context="_861" access="public" location="f2:2307" file="f2" line="2307" offset="0"/>
  <Field id="_2456" name="InvestorRange" type="_54" context="_861" access="public" location="f2:2309" file="f2" line="2309" offset="248"/>
  <Field id="_2457" name="BrokerID" type="_10" context="_861" access="public" location="f2:2311" file="f2" line="2311" offset="256"/>
  <Field id="_2458" name="InvestorID" type="_9" context="_861" access="public" location="f2:2313" file="f2" line="2313" offset="344"/>
  <Field id="_2459" name="OpenRatioByMoney" type="_112" context="_861" access="public" location="f2:2315" file="f2" line="2315" offset="448"/>
  <Field id="_2460" name="OpenRatioByVolume" type="_112" context="_861" access="public" location="f2:2317" file="f2" line="2317" offset="512"/>
  <Field id="_2461" name="CloseRatioByMoney" type="_112" context="_861" access="public" location="f2:2319" file="f2" line="2319" offset="576"/>
  <Field id="_2462" name="CloseRatioByVolume" type="_112" context="_861" access="public" location="f2:2321" file="f2" line="2321" offset="640"/>
  <Field id="_2463" name="CloseTodayRatioByMoney" type="_112" context="_861" access="public" location="f2:2323" file="f2" line="2323" offset="704"/>
  <Field id="_2464" name="CloseTodayRatioByVolume" type="_112" context="_861" access="public" location="f2:2325" file="f2" line="2325" offset="768"/>
  <Constructor id="_2465" name="CThostFtdcSyncingInstrumentCommissionRateField" context="_861" access="public" location="f2:2304" file="f2" line="2304" inline="1" artificial="1"/>
  <Constructor id="_2466" name="CThostFtdcSyncingInstrumentCommissionRateField" context="_861" access="public" location="f2:2304" file="f2" line="2304" inline="1" artificial="1">
    <Argument type="_6888" location="f2:2304" file="f2" line="2304"/>
  </Constructor>
  <OperatorMethod id="_2467" name="=" returns="_6889" context="_861" access="public" location="f2:2304" file="f2" line="2304" inline="1" artificial="1" mangled="_ZN46CThostFtdcSyncingInstrumentCommissionRateFieldaSERKS_">
    <Argument type="_6888" location="f2:2304" file="f2" line="2304"/>
  </OperatorMethod>
  <Destructor id="_2468" name="CThostFtdcSyncingInstrumentCommissionRateField" context="_861" access="public" location="f2:2304" file="f2" line="2304" inline="1" artificial="1"/>
  <Field id="_2469" name="InstrumentID" type="_19" context="_862" access="public" location="f2:2332" file="f2" line="2332" offset="0"/>
  <Field id="_2470" name="InvestorRange" type="_54" context="_862" access="public" location="f2:2334" file="f2" line="2334" offset="248"/>
  <Field id="_2471" name="BrokerID" type="_10" context="_862" access="public" location="f2:2336" file="f2" line="2336" offset="256"/>
  <Field id="_2472" name="InvestorID" type="_9" context="_862" access="public" location="f2:2338" file="f2" line="2338" offset="344"/>
  <Field id="_2473" name="TradingRight" type="_86" context="_862" access="public" location="f2:2340" file="f2" line="2340" offset="448"/>
  <Constructor id="_2474" name="CThostFtdcSyncingInstrumentTradingRightField" context="_862" access="public" location="f2:2329" file="f2" line="2329" inline="1" artificial="1"/>
  <Constructor id="_2475" name="CThostFtdcSyncingInstrumentTradingRightField" context="_862" access="public" location="f2:2329" file="f2" line="2329" inline="1" artificial="1">
    <Argument type="_6890" location="f2:2329" file="f2" line="2329"/>
  </Constructor>
  <OperatorMethod id="_2476" name="=" returns="_6891" context="_862" access="public" location="f2:2329" file="f2" line="2329" inline="1" artificial="1" mangled="_ZN44CThostFtdcSyncingInstrumentTradingRightFieldaSERKS_">
    <Argument type="_6890" location="f2:2329" file="f2" line="2329"/>
  </OperatorMethod>
  <Destructor id="_2477" name="CThostFtdcSyncingInstrumentTradingRightField" context="_862" access="public" location="f2:2329" file="f2" line="2329" inline="1" artificial="1"/>
  <Field id="_2478" name="BrokerID" type="_10" context="_863" access="public" location="f2:2347" file="f2" line="2347" offset="0"/>
  <Field id="_2479" name="InvestorID" type="_9" context="_863" access="public" location="f2:2349" file="f2" line="2349" offset="88"/>
  <Field id="_2480" name="InstrumentID" type="_19" context="_863" access="public" location="f2:2351" file="f2" line="2351" offset="192"/>
  <Field id="_2481" name="ExchangeID" type="_23" context="_863" access="public" location="f2:2353" file="f2" line="2353" offset="440"/>
  <Field id="_2482" name="OrderSysID" type="_35" context="_863" access="public" location="f2:2355" file="f2" line="2355" offset="512"/>
  <Field id="_2483" name="InsertTimeStart" type="_31" context="_863" access="public" location="f2:2357" file="f2" line="2357" offset="680"/>
  <Field id="_2484" name="InsertTimeEnd" type="_31" context="_863" access="public" location="f2:2359" file="f2" line="2359" offset="752"/>
  <Field id="_2485" name="InvestUnitID" type="_748" context="_863" access="public" location="f2:2361" file="f2" line="2361" offset="824"/>
  <Constructor id="_2486" name="CThostFtdcQryOrderField" context="_863" access="public" location="f2:2344" file="f2" line="2344" inline="1" artificial="1"/>
  <Constructor id="_2487" name="CThostFtdcQryOrderField" context="_863" access="public" location="f2:2344" file="f2" line="2344" inline="1" artificial="1">
    <Argument type="_6892" location="f2:2344" file="f2" line="2344"/>
  </Constructor>
  <OperatorMethod id="_2488" name="=" returns="_6893" context="_863" access="public" location="f2:2344" file="f2" line="2344" inline="1" artificial="1" mangled="_ZN23CThostFtdcQryOrderFieldaSERKS_">
    <Argument type="_6892" location="f2:2344" file="f2" line="2344"/>
  </OperatorMethod>
  <Destructor id="_2489" name="CThostFtdcQryOrderField" context="_863" access="public" location="f2:2344" file="f2" line="2344" inline="1" artificial="1"/>
  <Field id="_2490" name="BrokerID" type="_10" context="_864" access="public" location="f2:2368" file="f2" line="2368" offset="0"/>
  <Field id="_2491" name="InvestorID" type="_9" context="_864" access="public" location="f2:2370" file="f2" line="2370" offset="88"/>
  <Field id="_2492" name="InstrumentID" type="_19" context="_864" access="public" location="f2:2372" file="f2" line="2372" offset="192"/>
  <Field id="_2493" name="ExchangeID" type="_23" context="_864" access="public" location="f2:2374" file="f2" line="2374" offset="440"/>
  <Field id="_2494" name="TradeID" type="_36" context="_864" access="public" location="f2:2376" file="f2" line="2376" offset="512"/>
  <Field id="_2495" name="TradeTimeStart" type="_31" context="_864" access="public" location="f2:2378" file="f2" line="2378" offset="680"/>
  <Field id="_2496" name="TradeTimeEnd" type="_31" context="_864" access="public" location="f2:2380" file="f2" line="2380" offset="752"/>
  <Field id="_2497" name="InvestUnitID" type="_748" context="_864" access="public" location="f2:2382" file="f2" line="2382" offset="824"/>
  <Constructor id="_2498" name="CThostFtdcQryTradeField" context="_864" access="public" location="f2:2365" file="f2" line="2365" inline="1" artificial="1"/>
  <Constructor id="_2499" name="CThostFtdcQryTradeField" context="_864" access="public" location="f2:2365" file="f2" line="2365" inline="1" artificial="1">
    <Argument type="_6894" location="f2:2365" file="f2" line="2365"/>
  </Constructor>
  <OperatorMethod id="_2500" name="=" returns="_6895" context="_864" access="public" location="f2:2365" file="f2" line="2365" inline="1" artificial="1" mangled="_ZN23CThostFtdcQryTradeFieldaSERKS_">
    <Argument type="_6894" location="f2:2365" file="f2" line="2365"/>
  </OperatorMethod>
  <Destructor id="_2501" name="CThostFtdcQryTradeField" context="_864" access="public" location="f2:2365" file="f2" line="2365" inline="1" artificial="1"/>
  <Field id="_2502" name="BrokerID" type="_10" context="_865" access="public" location="f2:2389" file="f2" line="2389" offset="0"/>
  <Field id="_2503" name="InvestorID" type="_9" context="_865" access="public" location="f2:2391" file="f2" line="2391" offset="88"/>
  <Field id="_2504" name="InstrumentID" type="_19" context="_865" access="public" location="f2:2393" file="f2" line="2393" offset="192"/>
  <Field id="_2505" name="ExchangeID" type="_23" context="_865" access="public" location="f2:2395" file="f2" line="2395" offset="440"/>
  <Field id="_2506" name="InvestUnitID" type="_748" context="_865" access="public" location="f2:2397" file="f2" line="2397" offset="512"/>
  <Constructor id="_2507" name="CThostFtdcQryInvestorPositionField" context="_865" access="public" location="f2:2386" file="f2" line="2386" inline="1" artificial="1"/>
  <Constructor id="_2508" name="CThostFtdcQryInvestorPositionField" context="_865" access="public" location="f2:2386" file="f2" line="2386" inline="1" artificial="1">
    <Argument type="_6896" location="f2:2386" file="f2" line="2386"/>
  </Constructor>
  <OperatorMethod id="_2509" name="=" returns="_6897" context="_865" access="public" location="f2:2386" file="f2" line="2386" inline="1" artificial="1" mangled="_ZN34CThostFtdcQryInvestorPositionFieldaSERKS_">
    <Argument type="_6896" location="f2:2386" file="f2" line="2386"/>
  </OperatorMethod>
  <Destructor id="_2510" name="CThostFtdcQryInvestorPositionField" context="_865" access="public" location="f2:2386" file="f2" line="2386" inline="1" artificial="1"/>
  <Field id="_2511" name="BrokerID" type="_10" context="_866" access="public" location="f2:2404" file="f2" line="2404" offset="0"/>
  <Field id="_2512" name="InvestorID" type="_9" context="_866" access="public" location="f2:2406" file="f2" line="2406" offset="88"/>
  <Field id="_2513" name="CurrencyID" type="_335" context="_866" access="public" location="f2:2408" file="f2" line="2408" offset="192"/>
  <Field id="_2514" name="BizType" type="_761" context="_866" access="public" location="f2:2410" file="f2" line="2410" offset="224"/>
  <Field id="_2515" name="AccountID" type="_170" context="_866" access="public" location="f2:2412" file="f2" line="2412" offset="232"/>
  <Constructor id="_2516" name="CThostFtdcQryTradingAccountField" context="_866" access="public" location="f2:2401" file="f2" line="2401" inline="1" artificial="1"/>
  <Constructor id="_2517" name="CThostFtdcQryTradingAccountField" context="_866" access="public" location="f2:2401" file="f2" line="2401" inline="1" artificial="1">
    <Argument type="_6898" location="f2:2401" file="f2" line="2401"/>
  </Constructor>
  <OperatorMethod id="_2518" name="=" returns="_6899" context="_866" access="public" location="f2:2401" file="f2" line="2401" inline="1" artificial="1" mangled="_ZN32CThostFtdcQryTradingAccountFieldaSERKS_">
    <Argument type="_6898" location="f2:2401" file="f2" line="2401"/>
  </OperatorMethod>
  <Destructor id="_2519" name="CThostFtdcQryTradingAccountField" context="_866" access="public" location="f2:2401" file="f2" line="2401" inline="1" artificial="1"/>
  <Field id="_2520" name="BrokerID" type="_10" context="_867" access="public" location="f2:2419" file="f2" line="2419" offset="0"/>
  <Field id="_2521" name="InvestorID" type="_9" context="_867" access="public" location="f2:2421" file="f2" line="2421" offset="88"/>
  <Constructor id="_2522" name="CThostFtdcQryInvestorField" context="_867" access="public" location="f2:2416" file="f2" line="2416" inline="1" artificial="1"/>
  <Constructor id="_2523" name="CThostFtdcQryInvestorField" context="_867" access="public" location="f2:2416" file="f2" line="2416" inline="1" artificial="1">
    <Argument type="_6900" location="f2:2416" file="f2" line="2416"/>
  </Constructor>
  <OperatorMethod id="_2524" name="=" returns="_6901" context="_867" access="public" location="f2:2416" file="f2" line="2416" inline="1" artificial="1" mangled="_ZN26CThostFtdcQryInvestorFieldaSERKS_">
    <Argument type="_6900" location="f2:2416" file="f2" line="2416"/>
  </OperatorMethod>
  <Destructor id="_2525" name="CThostFtdcQryInvestorField" context="_867" access="public" location="f2:2416" file="f2" line="2416" inline="1" artificial="1"/>
  <Field id="_2526" name="BrokerID" type="_10" context="_868" access="public" location="f2:2428" file="f2" line="2428" offset="0"/>
  <Field id="_2527" name="InvestorID" type="_9" context="_868" access="public" location="f2:2430" file="f2" line="2430" offset="88"/>
  <Field id="_2528" name="ExchangeID" type="_23" context="_868" access="public" location="f2:2432" file="f2" line="2432" offset="192"/>
  <Field id="_2529" name="ClientID" type="_18" context="_868" access="public" location="f2:2434" file="f2" line="2434" offset="264"/>
  <Field id="_2530" name="ClientIDType" type="_77" context="_868" access="public" location="f2:2436" file="f2" line="2436" offset="352"/>
  <Field id="_2531" name="InvestUnitID" type="_748" context="_868" access="public" location="f2:2438" file="f2" line="2438" offset="360"/>
  <Constructor id="_2532" name="CThostFtdcQryTradingCodeField" context="_868" access="public" location="f2:2425" file="f2" line="2425" inline="1" artificial="1"/>
  <Constructor id="_2533" name="CThostFtdcQryTradingCodeField" context="_868" access="public" location="f2:2425" file="f2" line="2425" inline="1" artificial="1">
    <Argument type="_6902" location="f2:2425" file="f2" line="2425"/>
  </Constructor>
  <OperatorMethod id="_2534" name="=" returns="_6903" context="_868" access="public" location="f2:2425" file="f2" line="2425" inline="1" artificial="1" mangled="_ZN29CThostFtdcQryTradingCodeFieldaSERKS_">
    <Argument type="_6902" location="f2:2425" file="f2" line="2425"/>
  </OperatorMethod>
  <Destructor id="_2535" name="CThostFtdcQryTradingCodeField" context="_868" access="public" location="f2:2425" file="f2" line="2425" inline="1" artificial="1"/>
  <Field id="_2536" name="BrokerID" type="_10" context="_869" access="public" location="f2:2445" file="f2" line="2445" offset="0"/>
  <Constructor id="_2537" name="CThostFtdcQryInvestorGroupField" context="_869" access="public" location="f2:2442" file="f2" line="2442" inline="1" artificial="1"/>
  <Constructor id="_2538" name="CThostFtdcQryInvestorGroupField" context="_869" access="public" location="f2:2442" file="f2" line="2442" inline="1" artificial="1">
    <Argument type="_6904" location="f2:2442" file="f2" line="2442"/>
  </Constructor>
  <OperatorMethod id="_2539" name="=" returns="_6905" context="_869" access="public" location="f2:2442" file="f2" line="2442" inline="1" artificial="1" mangled="_ZN31CThostFtdcQryInvestorGroupFieldaSERKS_">
    <Argument type="_6904" location="f2:2442" file="f2" line="2442"/>
  </OperatorMethod>
  <Destructor id="_2540" name="CThostFtdcQryInvestorGroupField" context="_869" access="public" location="f2:2442" file="f2" line="2442" inline="1" artificial="1"/>
  <Field id="_2541" name="BrokerID" type="_10" context="_870" access="public" location="f2:2452" file="f2" line="2452" offset="0"/>
  <Field id="_2542" name="InvestorID" type="_9" context="_870" access="public" location="f2:2454" file="f2" line="2454" offset="88"/>
  <Field id="_2543" name="InstrumentID" type="_19" context="_870" access="public" location="f2:2456" file="f2" line="2456" offset="192"/>
  <Field id="_2544" name="HedgeFlag" type="_75" context="_870" access="public" location="f2:2458" file="f2" line="2458" offset="440"/>
  <Field id="_2545" name="ExchangeID" type="_23" context="_870" access="public" location="f2:2460" file="f2" line="2460" offset="448"/>
  <Field id="_2546" name="InvestUnitID" type="_748" context="_870" access="public" location="f2:2462" file="f2" line="2462" offset="520"/>
  <Constructor id="_2547" name="CThostFtdcQryInstrumentMarginRateField" context="_870" access="public" location="f2:2449" file="f2" line="2449" inline="1" artificial="1"/>
  <Constructor id="_2548" name="CThostFtdcQryInstrumentMarginRateField" context="_870" access="public" location="f2:2449" file="f2" line="2449" inline="1" artificial="1">
    <Argument type="_6906" location="f2:2449" file="f2" line="2449"/>
  </Constructor>
  <OperatorMethod id="_2549" name="=" returns="_6907" context="_870" access="public" location="f2:2449" file="f2" line="2449" inline="1" artificial="1" mangled="_ZN38CThostFtdcQryInstrumentMarginRateFieldaSERKS_">
    <Argument type="_6906" location="f2:2449" file="f2" line="2449"/>
  </OperatorMethod>
  <Destructor id="_2550" name="CThostFtdcQryInstrumentMarginRateField" context="_870" access="public" location="f2:2449" file="f2" line="2449" inline="1" artificial="1"/>
  <Field id="_2551" name="BrokerID" type="_10" context="_871" access="public" location="f2:2469" file="f2" line="2469" offset="0"/>
  <Field id="_2552" name="InvestorID" type="_9" context="_871" access="public" location="f2:2471" file="f2" line="2471" offset="88"/>
  <Field id="_2553" name="InstrumentID" type="_19" context="_871" access="public" location="f2:2473" file="f2" line="2473" offset="192"/>
  <Field id="_2554" name="ExchangeID" type="_23" context="_871" access="public" location="f2:2475" file="f2" line="2475" offset="440"/>
  <Field id="_2555" name="InvestUnitID" type="_748" context="_871" access="public" location="f2:2477" file="f2" line="2477" offset="512"/>
  <Constructor id="_2556" name="CThostFtdcQryInstrumentCommissionRateField" context="_871" access="public" location="f2:2466" file="f2" line="2466" inline="1" artificial="1"/>
  <Constructor id="_2557" name="CThostFtdcQryInstrumentCommissionRateField" context="_871" access="public" location="f2:2466" file="f2" line="2466" inline="1" artificial="1">
    <Argument type="_6908" location="f2:2466" file="f2" line="2466"/>
  </Constructor>
  <OperatorMethod id="_2558" name="=" returns="_6909" context="_871" access="public" location="f2:2466" file="f2" line="2466" inline="1" artificial="1" mangled="_ZN42CThostFtdcQryInstrumentCommissionRateFieldaSERKS_">
    <Argument type="_6908" location="f2:2466" file="f2" line="2466"/>
  </OperatorMethod>
  <Destructor id="_2559" name="CThostFtdcQryInstrumentCommissionRateField" context="_871" access="public" location="f2:2466" file="f2" line="2466" inline="1" artificial="1"/>
  <Field id="_2560" name="BrokerID" type="_10" context="_872" access="public" location="f2:2484" file="f2" line="2484" offset="0"/>
  <Field id="_2561" name="InvestorID" type="_9" context="_872" access="public" location="f2:2486" file="f2" line="2486" offset="88"/>
  <Field id="_2562" name="InstrumentID" type="_19" context="_872" access="public" location="f2:2488" file="f2" line="2488" offset="192"/>
  <Constructor id="_2563" name="CThostFtdcQryInstrumentTradingRightField" context="_872" access="public" location="f2:2481" file="f2" line="2481" inline="1" artificial="1"/>
  <Constructor id="_2564" name="CThostFtdcQryInstrumentTradingRightField" context="_872" access="public" location="f2:2481" file="f2" line="2481" inline="1" artificial="1">
    <Argument type="_6910" location="f2:2481" file="f2" line="2481"/>
  </Constructor>
  <OperatorMethod id="_2565" name="=" returns="_6911" context="_872" access="public" location="f2:2481" file="f2" line="2481" inline="1" artificial="1" mangled="_ZN40CThostFtdcQryInstrumentTradingRightFieldaSERKS_">
    <Argument type="_6910" location="f2:2481" file="f2" line="2481"/>
  </OperatorMethod>
  <Destructor id="_2566" name="CThostFtdcQryInstrumentTradingRightField" context="_872" access="public" location="f2:2481" file="f2" line="2481" inline="1" artificial="1"/>
  <Field id="_2567" name="BrokerID" type="_10" context="_873" access="public" location="f2:2495" file="f2" line="2495" offset="0"/>
  <Constructor id="_2568" name="CThostFtdcQryBrokerField" context="_873" access="public" location="f2:2492" file="f2" line="2492" inline="1" artificial="1"/>
  <Constructor id="_2569" name="CThostFtdcQryBrokerField" context="_873" access="public" location="f2:2492" file="f2" line="2492" inline="1" artificial="1">
    <Argument type="_6912" location="f2:2492" file="f2" line="2492"/>
  </Constructor>
  <OperatorMethod id="_2570" name="=" returns="_6913" context="_873" access="public" location="f2:2492" file="f2" line="2492" inline="1" artificial="1" mangled="_ZN24CThostFtdcQryBrokerFieldaSERKS_">
    <Argument type="_6912" location="f2:2492" file="f2" line="2492"/>
  </OperatorMethod>
  <Destructor id="_2571" name="CThostFtdcQryBrokerField" context="_873" access="public" location="f2:2492" file="f2" line="2492" inline="1" artificial="1"/>
  <Field id="_2572" name="ExchangeID" type="_23" context="_874" access="public" location="f2:2502" file="f2" line="2502" offset="0"/>
  <Field id="_2573" name="ParticipantID" type="_15" context="_874" access="public" location="f2:2504" file="f2" line="2504" offset="72"/>
  <Field id="_2574" name="TraderID" type="_8" context="_874" access="public" location="f2:2506" file="f2" line="2506" offset="160"/>
  <Constructor id="_2575" name="CThostFtdcQryTraderField" context="_874" access="public" location="f2:2499" file="f2" line="2499" inline="1" artificial="1"/>
  <Constructor id="_2576" name="CThostFtdcQryTraderField" context="_874" access="public" location="f2:2499" file="f2" line="2499" inline="1" artificial="1">
    <Argument type="_6914" location="f2:2499" file="f2" line="2499"/>
  </Constructor>
  <OperatorMethod id="_2577" name="=" returns="_6915" context="_874" access="public" location="f2:2499" file="f2" line="2499" inline="1" artificial="1" mangled="_ZN24CThostFtdcQryTraderFieldaSERKS_">
    <Argument type="_6914" location="f2:2499" file="f2" line="2499"/>
  </OperatorMethod>
  <Destructor id="_2578" name="CThostFtdcQryTraderField" context="_874" access="public" location="f2:2499" file="f2" line="2499" inline="1" artificial="1"/>
  <Field id="_2579" name="UserID" type="_16" context="_875" access="public" location="f2:2513" file="f2" line="2513" offset="0"/>
  <Constructor id="_2580" name="CThostFtdcQrySuperUserFunctionField" context="_875" access="public" location="f2:2510" file="f2" line="2510" inline="1" artificial="1"/>
  <Constructor id="_2581" name="CThostFtdcQrySuperUserFunctionField" context="_875" access="public" location="f2:2510" file="f2" line="2510" inline="1" artificial="1">
    <Argument type="_6916" location="f2:2510" file="f2" line="2510"/>
  </Constructor>
  <OperatorMethod id="_2582" name="=" returns="_6917" context="_875" access="public" location="f2:2510" file="f2" line="2510" inline="1" artificial="1" mangled="_ZN35CThostFtdcQrySuperUserFunctionFieldaSERKS_">
    <Argument type="_6916" location="f2:2510" file="f2" line="2510"/>
  </OperatorMethod>
  <Destructor id="_2583" name="CThostFtdcQrySuperUserFunctionField" context="_875" access="public" location="f2:2510" file="f2" line="2510" inline="1" artificial="1"/>
  <Field id="_2584" name="FrontID" type="_98" context="_876" access="public" location="f2:2520" file="f2" line="2520" offset="0"/>
  <Field id="_2585" name="SessionID" type="_99" context="_876" access="public" location="f2:2522" file="f2" line="2522" offset="32"/>
  <Field id="_2586" name="BrokerID" type="_10" context="_876" access="public" location="f2:2524" file="f2" line="2524" offset="64"/>
  <Field id="_2587" name="UserID" type="_16" context="_876" access="public" location="f2:2526" file="f2" line="2526" offset="152"/>
  <Constructor id="_2588" name="CThostFtdcQryUserSessionField" context="_876" access="public" location="f2:2517" file="f2" line="2517" inline="1" artificial="1"/>
  <Constructor id="_2589" name="CThostFtdcQryUserSessionField" context="_876" access="public" location="f2:2517" file="f2" line="2517" inline="1" artificial="1">
    <Argument type="_6918" location="f2:2517" file="f2" line="2517"/>
  </Constructor>
  <OperatorMethod id="_2590" name="=" returns="_6919" context="_876" access="public" location="f2:2517" file="f2" line="2517" inline="1" artificial="1" mangled="_ZN29CThostFtdcQryUserSessionFieldaSERKS_">
    <Argument type="_6918" location="f2:2517" file="f2" line="2517"/>
  </OperatorMethod>
  <Destructor id="_2591" name="CThostFtdcQryUserSessionField" context="_876" access="public" location="f2:2517" file="f2" line="2517" inline="1" artificial="1"/>
  <Field id="_2592" name="ExchangeID" type="_23" context="_877" access="public" location="f2:2533" file="f2" line="2533" offset="0"/>
  <Field id="_2593" name="BrokerID" type="_10" context="_877" access="public" location="f2:2535" file="f2" line="2535" offset="72"/>
  <Field id="_2594" name="ParticipantID" type="_15" context="_877" access="public" location="f2:2537" file="f2" line="2537" offset="160"/>
  <Constructor id="_2595" name="CThostFtdcQryPartBrokerField" context="_877" access="public" location="f2:2530" file="f2" line="2530" inline="1" artificial="1"/>
  <Constructor id="_2596" name="CThostFtdcQryPartBrokerField" context="_877" access="public" location="f2:2530" file="f2" line="2530" inline="1" artificial="1">
    <Argument type="_6920" location="f2:2530" file="f2" line="2530"/>
  </Constructor>
  <OperatorMethod id="_2597" name="=" returns="_6921" context="_877" access="public" location="f2:2530" file="f2" line="2530" inline="1" artificial="1" mangled="_ZN28CThostFtdcQryPartBrokerFieldaSERKS_">
    <Argument type="_6920" location="f2:2530" file="f2" line="2530"/>
  </OperatorMethod>
  <Destructor id="_2598" name="CThostFtdcQryPartBrokerField" context="_877" access="public" location="f2:2530" file="f2" line="2530" inline="1" artificial="1"/>
  <Field id="_2599" name="FrontID" type="_98" context="_878" access="public" location="f2:2544" file="f2" line="2544" offset="0"/>
  <Constructor id="_2600" name="CThostFtdcQryFrontStatusField" context="_878" access="public" location="f2:2541" file="f2" line="2541" inline="1" artificial="1"/>
  <Constructor id="_2601" name="CThostFtdcQryFrontStatusField" context="_878" access="public" location="f2:2541" file="f2" line="2541" inline="1" artificial="1">
    <Argument type="_6922" location="f2:2541" file="f2" line="2541"/>
  </Constructor>
  <OperatorMethod id="_2602" name="=" returns="_6923" context="_878" access="public" location="f2:2541" file="f2" line="2541" inline="1" artificial="1" mangled="_ZN29CThostFtdcQryFrontStatusFieldaSERKS_">
    <Argument type="_6922" location="f2:2541" file="f2" line="2541"/>
  </OperatorMethod>
  <Destructor id="_2603" name="CThostFtdcQryFrontStatusField" context="_878" access="public" location="f2:2541" file="f2" line="2541" inline="1" artificial="1"/>
  <Field id="_2604" name="ParticipantID" type="_15" context="_879" access="public" location="f2:2551" file="f2" line="2551" offset="0"/>
  <Field id="_2605" name="ClientID" type="_18" context="_879" access="public" location="f2:2553" file="f2" line="2553" offset="88"/>
  <Field id="_2606" name="ExchangeInstID" type="_13" context="_879" access="public" location="f2:2555" file="f2" line="2555" offset="176"/>
  <Field id="_2607" name="ExchangeID" type="_23" context="_879" access="public" location="f2:2557" file="f2" line="2557" offset="424"/>
  <Field id="_2608" name="TraderID" type="_8" context="_879" access="public" location="f2:2559" file="f2" line="2559" offset="496"/>
  <Constructor id="_2609" name="CThostFtdcQryExchangeOrderField" context="_879" access="public" location="f2:2548" file="f2" line="2548" inline="1" artificial="1"/>
  <Constructor id="_2610" name="CThostFtdcQryExchangeOrderField" context="_879" access="public" location="f2:2548" file="f2" line="2548" inline="1" artificial="1">
    <Argument type="_6924" location="f2:2548" file="f2" line="2548"/>
  </Constructor>
  <OperatorMethod id="_2611" name="=" returns="_6925" context="_879" access="public" location="f2:2548" file="f2" line="2548" inline="1" artificial="1" mangled="_ZN31CThostFtdcQryExchangeOrderFieldaSERKS_">
    <Argument type="_6924" location="f2:2548" file="f2" line="2548"/>
  </OperatorMethod>
  <Destructor id="_2612" name="CThostFtdcQryExchangeOrderField" context="_879" access="public" location="f2:2548" file="f2" line="2548" inline="1" artificial="1"/>
  <Field id="_2613" name="BrokerID" type="_10" context="_880" access="public" location="f2:2566" file="f2" line="2566" offset="0"/>
  <Field id="_2614" name="InvestorID" type="_9" context="_880" access="public" location="f2:2568" file="f2" line="2568" offset="88"/>
  <Field id="_2615" name="ExchangeID" type="_23" context="_880" access="public" location="f2:2570" file="f2" line="2570" offset="192"/>
  <Constructor id="_2616" name="CThostFtdcQryOrderActionField" context="_880" access="public" location="f2:2563" file="f2" line="2563" inline="1" artificial="1"/>
  <Constructor id="_2617" name="CThostFtdcQryOrderActionField" context="_880" access="public" location="f2:2563" file="f2" line="2563" inline="1" artificial="1">
    <Argument type="_6926" location="f2:2563" file="f2" line="2563"/>
  </Constructor>
  <OperatorMethod id="_2618" name="=" returns="_6927" context="_880" access="public" location="f2:2563" file="f2" line="2563" inline="1" artificial="1" mangled="_ZN29CThostFtdcQryOrderActionFieldaSERKS_">
    <Argument type="_6926" location="f2:2563" file="f2" line="2563"/>
  </OperatorMethod>
  <Destructor id="_2619" name="CThostFtdcQryOrderActionField" context="_880" access="public" location="f2:2563" file="f2" line="2563" inline="1" artificial="1"/>
  <Field id="_2620" name="ParticipantID" type="_15" context="_881" access="public" location="f2:2577" file="f2" line="2577" offset="0"/>
  <Field id="_2621" name="ClientID" type="_18" context="_881" access="public" location="f2:2579" file="f2" line="2579" offset="88"/>
  <Field id="_2622" name="ExchangeID" type="_23" context="_881" access="public" location="f2:2581" file="f2" line="2581" offset="176"/>
  <Field id="_2623" name="TraderID" type="_8" context="_881" access="public" location="f2:2583" file="f2" line="2583" offset="248"/>
  <Constructor id="_2624" name="CThostFtdcQryExchangeOrderActionField" context="_881" access="public" location="f2:2574" file="f2" line="2574" inline="1" artificial="1"/>
  <Constructor id="_2625" name="CThostFtdcQryExchangeOrderActionField" context="_881" access="public" location="f2:2574" file="f2" line="2574" inline="1" artificial="1">
    <Argument type="_6928" location="f2:2574" file="f2" line="2574"/>
  </Constructor>
  <OperatorMethod id="_2626" name="=" returns="_6929" context="_881" access="public" location="f2:2574" file="f2" line="2574" inline="1" artificial="1" mangled="_ZN37CThostFtdcQryExchangeOrderActionFieldaSERKS_">
    <Argument type="_6928" location="f2:2574" file="f2" line="2574"/>
  </OperatorMethod>
  <Destructor id="_2627" name="CThostFtdcQryExchangeOrderActionField" context="_881" access="public" location="f2:2574" file="f2" line="2574" inline="1" artificial="1"/>
  <Field id="_2628" name="UserID" type="_16" context="_882" access="public" location="f2:2590" file="f2" line="2590" offset="0"/>
  <Constructor id="_2629" name="CThostFtdcQrySuperUserField" context="_882" access="public" location="f2:2587" file="f2" line="2587" inline="1" artificial="1"/>
  <Constructor id="_2630" name="CThostFtdcQrySuperUserField" context="_882" access="public" location="f2:2587" file="f2" line="2587" inline="1" artificial="1">
    <Argument type="_6930" location="f2:2587" file="f2" line="2587"/>
  </Constructor>
  <OperatorMethod id="_2631" name="=" returns="_6931" context="_882" access="public" location="f2:2587" file="f2" line="2587" inline="1" artificial="1" mangled="_ZN27CThostFtdcQrySuperUserFieldaSERKS_">
    <Argument type="_6930" location="f2:2587" file="f2" line="2587"/>
  </OperatorMethod>
  <Destructor id="_2632" name="CThostFtdcQrySuperUserField" context="_882" access="public" location="f2:2587" file="f2" line="2587" inline="1" artificial="1"/>
  <Field id="_2633" name="ExchangeID" type="_23" context="_883" access="public" location="f2:2597" file="f2" line="2597" offset="0"/>
  <Constructor id="_2634" name="CThostFtdcQryExchangeField" context="_883" access="public" location="f2:2594" file="f2" line="2594" inline="1" artificial="1"/>
  <Constructor id="_2635" name="CThostFtdcQryExchangeField" context="_883" access="public" location="f2:2594" file="f2" line="2594" inline="1" artificial="1">
    <Argument type="_6932" location="f2:2594" file="f2" line="2594"/>
  </Constructor>
  <OperatorMethod id="_2636" name="=" returns="_6933" context="_883" access="public" location="f2:2594" file="f2" line="2594" inline="1" artificial="1" mangled="_ZN26CThostFtdcQryExchangeFieldaSERKS_">
    <Argument type="_6932" location="f2:2594" file="f2" line="2594"/>
  </OperatorMethod>
  <Destructor id="_2637" name="CThostFtdcQryExchangeField" context="_883" access="public" location="f2:2594" file="f2" line="2594" inline="1" artificial="1"/>
  <Field id="_2638" name="ProductID" type="_19" context="_884" access="public" location="f2:2604" file="f2" line="2604" offset="0"/>
  <Field id="_2639" name="ProductClass" type="_68" context="_884" access="public" location="f2:2606" file="f2" line="2606" offset="248"/>
  <Field id="_2640" name="ExchangeID" type="_23" context="_884" access="public" location="f2:2608" file="f2" line="2608" offset="256"/>
  <Constructor id="_2641" name="CThostFtdcQryProductField" context="_884" access="public" location="f2:2601" file="f2" line="2601" inline="1" artificial="1"/>
  <Constructor id="_2642" name="CThostFtdcQryProductField" context="_884" access="public" location="f2:2601" file="f2" line="2601" inline="1" artificial="1">
    <Argument type="_6934" location="f2:2601" file="f2" line="2601"/>
  </Constructor>
  <OperatorMethod id="_2643" name="=" returns="_6935" context="_884" access="public" location="f2:2601" file="f2" line="2601" inline="1" artificial="1" mangled="_ZN25CThostFtdcQryProductFieldaSERKS_">
    <Argument type="_6934" location="f2:2601" file="f2" line="2601"/>
  </OperatorMethod>
  <Destructor id="_2644" name="CThostFtdcQryProductField" context="_884" access="public" location="f2:2601" file="f2" line="2601" inline="1" artificial="1"/>
  <Field id="_2645" name="InstrumentID" type="_19" context="_885" access="public" location="f2:2615" file="f2" line="2615" offset="0"/>
  <Field id="_2646" name="ExchangeID" type="_23" context="_885" access="public" location="f2:2617" file="f2" line="2617" offset="248"/>
  <Field id="_2647" name="ExchangeInstID" type="_13" context="_885" access="public" location="f2:2619" file="f2" line="2619" offset="320"/>
  <Field id="_2648" name="ProductID" type="_19" context="_885" access="public" location="f2:2621" file="f2" line="2621" offset="568"/>
  <Constructor id="_2649" name="CThostFtdcQryInstrumentField" context="_885" access="public" location="f2:2612" file="f2" line="2612" inline="1" artificial="1"/>
  <Constructor id="_2650" name="CThostFtdcQryInstrumentField" context="_885" access="public" location="f2:2612" file="f2" line="2612" inline="1" artificial="1">
    <Argument type="_6936" location="f2:2612" file="f2" line="2612"/>
  </Constructor>
  <OperatorMethod id="_2651" name="=" returns="_6937" context="_885" access="public" location="f2:2612" file="f2" line="2612" inline="1" artificial="1" mangled="_ZN28CThostFtdcQryInstrumentFieldaSERKS_">
    <Argument type="_6936" location="f2:2612" file="f2" line="2612"/>
  </OperatorMethod>
  <Destructor id="_2652" name="CThostFtdcQryInstrumentField" context="_885" access="public" location="f2:2612" file="f2" line="2612" inline="1" artificial="1"/>
  <Field id="_2653" name="InstrumentID" type="_19" context="_886" access="public" location="f2:2628" file="f2" line="2628" offset="0"/>
  <Field id="_2654" name="ExchangeID" type="_23" context="_886" access="public" location="f2:2630" file="f2" line="2630" offset="248"/>
  <Constructor id="_2655" name="CThostFtdcQryDepthMarketDataField" context="_886" access="public" location="f2:2625" file="f2" line="2625" inline="1" artificial="1"/>
  <Constructor id="_2656" name="CThostFtdcQryDepthMarketDataField" context="_886" access="public" location="f2:2625" file="f2" line="2625" inline="1" artificial="1">
    <Argument type="_6938" location="f2:2625" file="f2" line="2625"/>
  </Constructor>
  <OperatorMethod id="_2657" name="=" returns="_6939" context="_886" access="public" location="f2:2625" file="f2" line="2625" inline="1" artificial="1" mangled="_ZN33CThostFtdcQryDepthMarketDataFieldaSERKS_">
    <Argument type="_6938" location="f2:2625" file="f2" line="2625"/>
  </OperatorMethod>
  <Destructor id="_2658" name="CThostFtdcQryDepthMarketDataField" context="_886" access="public" location="f2:2625" file="f2" line="2625" inline="1" artificial="1"/>
  <Field id="_2659" name="BrokerID" type="_10" context="_887" access="public" location="f2:2637" file="f2" line="2637" offset="0"/>
  <Field id="_2660" name="UserID" type="_16" context="_887" access="public" location="f2:2639" file="f2" line="2639" offset="88"/>
  <Constructor id="_2661" name="CThostFtdcQryBrokerUserField" context="_887" access="public" location="f2:2634" file="f2" line="2634" inline="1" artificial="1"/>
  <Constructor id="_2662" name="CThostFtdcQryBrokerUserField" context="_887" access="public" location="f2:2634" file="f2" line="2634" inline="1" artificial="1">
    <Argument type="_6940" location="f2:2634" file="f2" line="2634"/>
  </Constructor>
  <OperatorMethod id="_2663" name="=" returns="_6941" context="_887" access="public" location="f2:2634" file="f2" line="2634" inline="1" artificial="1" mangled="_ZN28CThostFtdcQryBrokerUserFieldaSERKS_">
    <Argument type="_6940" location="f2:2634" file="f2" line="2634"/>
  </OperatorMethod>
  <Destructor id="_2664" name="CThostFtdcQryBrokerUserField" context="_887" access="public" location="f2:2634" file="f2" line="2634" inline="1" artificial="1"/>
  <Field id="_2665" name="BrokerID" type="_10" context="_888" access="public" location="f2:2646" file="f2" line="2646" offset="0"/>
  <Field id="_2666" name="UserID" type="_16" context="_888" access="public" location="f2:2648" file="f2" line="2648" offset="88"/>
  <Constructor id="_2667" name="CThostFtdcQryBrokerUserFunctionField" context="_888" access="public" location="f2:2643" file="f2" line="2643" inline="1" artificial="1"/>
  <Constructor id="_2668" name="CThostFtdcQryBrokerUserFunctionField" context="_888" access="public" location="f2:2643" file="f2" line="2643" inline="1" artificial="1">
    <Argument type="_6942" location="f2:2643" file="f2" line="2643"/>
  </Constructor>
  <OperatorMethod id="_2669" name="=" returns="_6943" context="_888" access="public" location="f2:2643" file="f2" line="2643" inline="1" artificial="1" mangled="_ZN36CThostFtdcQryBrokerUserFunctionFieldaSERKS_">
    <Argument type="_6942" location="f2:2643" file="f2" line="2643"/>
  </OperatorMethod>
  <Destructor id="_2670" name="CThostFtdcQryBrokerUserFunctionField" context="_888" access="public" location="f2:2643" file="f2" line="2643" inline="1" artificial="1"/>
  <Field id="_2671" name="ExchangeID" type="_23" context="_889" access="public" location="f2:2655" file="f2" line="2655" offset="0"/>
  <Field id="_2672" name="ParticipantID" type="_15" context="_889" access="public" location="f2:2657" file="f2" line="2657" offset="72"/>
  <Field id="_2673" name="TraderID" type="_8" context="_889" access="public" location="f2:2659" file="f2" line="2659" offset="160"/>
  <Constructor id="_2674" name="CThostFtdcQryTraderOfferField" context="_889" access="public" location="f2:2652" file="f2" line="2652" inline="1" artificial="1"/>
  <Constructor id="_2675" name="CThostFtdcQryTraderOfferField" context="_889" access="public" location="f2:2652" file="f2" line="2652" inline="1" artificial="1">
    <Argument type="_6944" location="f2:2652" file="f2" line="2652"/>
  </Constructor>
  <OperatorMethod id="_2676" name="=" returns="_6945" context="_889" access="public" location="f2:2652" file="f2" line="2652" inline="1" artificial="1" mangled="_ZN29CThostFtdcQryTraderOfferFieldaSERKS_">
    <Argument type="_6944" location="f2:2652" file="f2" line="2652"/>
  </OperatorMethod>
  <Destructor id="_2677" name="CThostFtdcQryTraderOfferField" context="_889" access="public" location="f2:2652" file="f2" line="2652" inline="1" artificial="1"/>
  <Field id="_2678" name="BrokerID" type="_10" context="_890" access="public" location="f2:2666" file="f2" line="2666" offset="0"/>
  <Field id="_2679" name="DepositSeqNo" type="_43" context="_890" access="public" location="f2:2668" file="f2" line="2668" offset="88"/>
  <Constructor id="_2680" name="CThostFtdcQrySyncDepositField" context="_890" access="public" location="f2:2663" file="f2" line="2663" inline="1" artificial="1"/>
  <Constructor id="_2681" name="CThostFtdcQrySyncDepositField" context="_890" access="public" location="f2:2663" file="f2" line="2663" inline="1" artificial="1">
    <Argument type="_6946" location="f2:2663" file="f2" line="2663"/>
  </Constructor>
  <OperatorMethod id="_2682" name="=" returns="_6947" context="_890" access="public" location="f2:2663" file="f2" line="2663" inline="1" artificial="1" mangled="_ZN29CThostFtdcQrySyncDepositFieldaSERKS_">
    <Argument type="_6946" location="f2:2663" file="f2" line="2663"/>
  </OperatorMethod>
  <Destructor id="_2683" name="CThostFtdcQrySyncDepositField" context="_890" access="public" location="f2:2663" file="f2" line="2663" inline="1" artificial="1"/>
  <Field id="_2684" name="BrokerID" type="_10" context="_891" access="public" location="f2:2675" file="f2" line="2675" offset="0"/>
  <Field id="_2685" name="InvestorID" type="_9" context="_891" access="public" location="f2:2677" file="f2" line="2677" offset="88"/>
  <Field id="_2686" name="TradingDay" type="_30" context="_891" access="public" location="f2:2679" file="f2" line="2679" offset="192"/>
  <Field id="_2687" name="AccountID" type="_170" context="_891" access="public" location="f2:2681" file="f2" line="2681" offset="264"/>
  <Field id="_2688" name="CurrencyID" type="_335" context="_891" access="public" location="f2:2683" file="f2" line="2683" offset="368"/>
  <Constructor id="_2689" name="CThostFtdcQrySettlementInfoField" context="_891" access="public" location="f2:2672" file="f2" line="2672" inline="1" artificial="1"/>
  <Constructor id="_2690" name="CThostFtdcQrySettlementInfoField" context="_891" access="public" location="f2:2672" file="f2" line="2672" inline="1" artificial="1">
    <Argument type="_6948" location="f2:2672" file="f2" line="2672"/>
  </Constructor>
  <OperatorMethod id="_2691" name="=" returns="_6949" context="_891" access="public" location="f2:2672" file="f2" line="2672" inline="1" artificial="1" mangled="_ZN32CThostFtdcQrySettlementInfoFieldaSERKS_">
    <Argument type="_6948" location="f2:2672" file="f2" line="2672"/>
  </OperatorMethod>
  <Destructor id="_2692" name="CThostFtdcQrySettlementInfoField" context="_891" access="public" location="f2:2672" file="f2" line="2672" inline="1" artificial="1"/>
  <Field id="_2693" name="BrokerID" type="_10" context="_892" access="public" location="f2:2690" file="f2" line="2690" offset="0"/>
  <Field id="_2694" name="InstrumentID" type="_19" context="_892" access="public" location="f2:2692" file="f2" line="2692" offset="88"/>
  <Field id="_2695" name="HedgeFlag" type="_75" context="_892" access="public" location="f2:2694" file="f2" line="2694" offset="336"/>
  <Field id="_2696" name="ExchangeID" type="_23" context="_892" access="public" location="f2:2696" file="f2" line="2696" offset="344"/>
  <Constructor id="_2697" name="CThostFtdcQryExchangeMarginRateField" context="_892" access="public" location="f2:2687" file="f2" line="2687" inline="1" artificial="1"/>
  <Constructor id="_2698" name="CThostFtdcQryExchangeMarginRateField" context="_892" access="public" location="f2:2687" file="f2" line="2687" inline="1" artificial="1">
    <Argument type="_6950" location="f2:2687" file="f2" line="2687"/>
  </Constructor>
  <OperatorMethod id="_2699" name="=" returns="_6951" context="_892" access="public" location="f2:2687" file="f2" line="2687" inline="1" artificial="1" mangled="_ZN36CThostFtdcQryExchangeMarginRateFieldaSERKS_">
    <Argument type="_6950" location="f2:2687" file="f2" line="2687"/>
  </OperatorMethod>
  <Destructor id="_2700" name="CThostFtdcQryExchangeMarginRateField" context="_892" access="public" location="f2:2687" file="f2" line="2687" inline="1" artificial="1"/>
  <Field id="_2701" name="BrokerID" type="_10" context="_893" access="public" location="f2:2703" file="f2" line="2703" offset="0"/>
  <Field id="_2702" name="InstrumentID" type="_19" context="_893" access="public" location="f2:2705" file="f2" line="2705" offset="88"/>
  <Field id="_2703" name="HedgeFlag" type="_75" context="_893" access="public" location="f2:2707" file="f2" line="2707" offset="336"/>
  <Constructor id="_2704" name="CThostFtdcQryExchangeMarginRateAdjustField" context="_893" access="public" location="f2:2700" file="f2" line="2700" inline="1" artificial="1"/>
  <Constructor id="_2705" name="CThostFtdcQryExchangeMarginRateAdjustField" context="_893" access="public" location="f2:2700" file="f2" line="2700" inline="1" artificial="1">
    <Argument type="_6952" location="f2:2700" file="f2" line="2700"/>
  </Constructor>
  <OperatorMethod id="_2706" name="=" returns="_6953" context="_893" access="public" location="f2:2700" file="f2" line="2700" inline="1" artificial="1" mangled="_ZN42CThostFtdcQryExchangeMarginRateAdjustFieldaSERKS_">
    <Argument type="_6952" location="f2:2700" file="f2" line="2700"/>
  </OperatorMethod>
  <Destructor id="_2707" name="CThostFtdcQryExchangeMarginRateAdjustField" context="_893" access="public" location="f2:2700" file="f2" line="2700" inline="1" artificial="1"/>
  <Field id="_2708" name="BrokerID" type="_10" context="_894" access="public" location="f2:2714" file="f2" line="2714" offset="0"/>
  <Field id="_2709" name="FromCurrencyID" type="_335" context="_894" access="public" location="f2:2716" file="f2" line="2716" offset="88"/>
  <Field id="_2710" name="ToCurrencyID" type="_335" context="_894" access="public" location="f2:2718" file="f2" line="2718" offset="120"/>
  <Constructor id="_2711" name="CThostFtdcQryExchangeRateField" context="_894" access="public" location="f2:2711" file="f2" line="2711" inline="1" artificial="1"/>
  <Constructor id="_2712" name="CThostFtdcQryExchangeRateField" context="_894" access="public" location="f2:2711" file="f2" line="2711" inline="1" artificial="1">
    <Argument type="_6954" location="f2:2711" file="f2" line="2711"/>
  </Constructor>
  <OperatorMethod id="_2713" name="=" returns="_6955" context="_894" access="public" location="f2:2711" file="f2" line="2711" inline="1" artificial="1" mangled="_ZN30CThostFtdcQryExchangeRateFieldaSERKS_">
    <Argument type="_6954" location="f2:2711" file="f2" line="2711"/>
  </OperatorMethod>
  <Destructor id="_2714" name="CThostFtdcQryExchangeRateField" context="_894" access="public" location="f2:2711" file="f2" line="2711" inline="1" artificial="1"/>
  <Field id="_2715" name="BrokerID" type="_10" context="_895" access="public" location="f2:2725" file="f2" line="2725" offset="0"/>
  <Field id="_2716" name="MortgageSeqNo" type="_43" context="_895" access="public" location="f2:2727" file="f2" line="2727" offset="88"/>
  <Constructor id="_2717" name="CThostFtdcQrySyncFundMortgageField" context="_895" access="public" location="f2:2722" file="f2" line="2722" inline="1" artificial="1"/>
  <Constructor id="_2718" name="CThostFtdcQrySyncFundMortgageField" context="_895" access="public" location="f2:2722" file="f2" line="2722" inline="1" artificial="1">
    <Argument type="_6956" location="f2:2722" file="f2" line="2722"/>
  </Constructor>
  <OperatorMethod id="_2719" name="=" returns="_6957" context="_895" access="public" location="f2:2722" file="f2" line="2722" inline="1" artificial="1" mangled="_ZN34CThostFtdcQrySyncFundMortgageFieldaSERKS_">
    <Argument type="_6956" location="f2:2722" file="f2" line="2722"/>
  </OperatorMethod>
  <Destructor id="_2720" name="CThostFtdcQrySyncFundMortgageField" context="_895" access="public" location="f2:2722" file="f2" line="2722" inline="1" artificial="1"/>
  <Field id="_2721" name="BrokerID" type="_10" context="_896" access="public" location="f2:2734" file="f2" line="2734" offset="0"/>
  <Field id="_2722" name="InvestorID" type="_9" context="_896" access="public" location="f2:2736" file="f2" line="2736" offset="88"/>
  <Field id="_2723" name="InstrumentID" type="_19" context="_896" access="public" location="f2:2738" file="f2" line="2738" offset="192"/>
  <Field id="_2724" name="ExchangeID" type="_23" context="_896" access="public" location="f2:2740" file="f2" line="2740" offset="440"/>
  <Field id="_2725" name="OrderSysID" type="_35" context="_896" access="public" location="f2:2742" file="f2" line="2742" offset="512"/>
  <Field id="_2726" name="InsertTimeStart" type="_31" context="_896" access="public" location="f2:2744" file="f2" line="2744" offset="680"/>
  <Field id="_2727" name="InsertTimeEnd" type="_31" context="_896" access="public" location="f2:2746" file="f2" line="2746" offset="752"/>
  <Field id="_2728" name="TradingDay" type="_30" context="_896" access="public" location="f2:2748" file="f2" line="2748" offset="824"/>
  <Field id="_2729" name="SettlementID" type="_96" context="_896" access="public" location="f2:2750" file="f2" line="2750" offset="896"/>
  <Constructor id="_2730" name="CThostFtdcQryHisOrderField" context="_896" access="public" location="f2:2731" file="f2" line="2731" inline="1" artificial="1"/>
  <Constructor id="_2731" name="CThostFtdcQryHisOrderField" context="_896" access="public" location="f2:2731" file="f2" line="2731" inline="1" artificial="1">
    <Argument type="_6958" location="f2:2731" file="f2" line="2731"/>
  </Constructor>
  <OperatorMethod id="_2732" name="=" returns="_6959" context="_896" access="public" location="f2:2731" file="f2" line="2731" inline="1" artificial="1" mangled="_ZN26CThostFtdcQryHisOrderFieldaSERKS_">
    <Argument type="_6958" location="f2:2731" file="f2" line="2731"/>
  </OperatorMethod>
  <Destructor id="_2733" name="CThostFtdcQryHisOrderField" context="_896" access="public" location="f2:2731" file="f2" line="2731" inline="1" artificial="1"/>
  <Field id="_2734" name="InstrumentID" type="_19" context="_897" access="public" location="f2:2757" file="f2" line="2757" offset="0"/>
  <Field id="_2735" name="InvestorRange" type="_54" context="_897" access="public" location="f2:2759" file="f2" line="2759" offset="248"/>
  <Field id="_2736" name="BrokerID" type="_10" context="_897" access="public" location="f2:2761" file="f2" line="2761" offset="256"/>
  <Field id="_2737" name="InvestorID" type="_9" context="_897" access="public" location="f2:2763" file="f2" line="2763" offset="344"/>
  <Field id="_2738" name="MinMargin" type="_113" context="_897" access="public" location="f2:2765" file="f2" line="2765" offset="448"/>
  <Field id="_2739" name="ValueMethod" type="_736" context="_897" access="public" location="f2:2767" file="f2" line="2767" offset="512"/>
  <Field id="_2740" name="IsRelative" type="_108" context="_897" access="public" location="f2:2769" file="f2" line="2769" offset="544"/>
  <Constructor id="_2741" name="CThostFtdcOptionInstrMiniMarginField" context="_897" access="public" location="f2:2754" file="f2" line="2754" inline="1" artificial="1"/>
  <Constructor id="_2742" name="CThostFtdcOptionInstrMiniMarginField" context="_897" access="public" location="f2:2754" file="f2" line="2754" inline="1" artificial="1">
    <Argument type="_6960" location="f2:2754" file="f2" line="2754"/>
  </Constructor>
  <OperatorMethod id="_2743" name="=" returns="_6961" context="_897" access="public" location="f2:2754" file="f2" line="2754" inline="1" artificial="1" mangled="_ZN36CThostFtdcOptionInstrMiniMarginFieldaSERKS_">
    <Argument type="_6960" location="f2:2754" file="f2" line="2754"/>
  </OperatorMethod>
  <Destructor id="_2744" name="CThostFtdcOptionInstrMiniMarginField" context="_897" access="public" location="f2:2754" file="f2" line="2754" inline="1" artificial="1"/>
  <Field id="_2745" name="InstrumentID" type="_19" context="_898" access="public" location="f2:2776" file="f2" line="2776" offset="0"/>
  <Field id="_2746" name="InvestorRange" type="_54" context="_898" access="public" location="f2:2778" file="f2" line="2778" offset="248"/>
  <Field id="_2747" name="BrokerID" type="_10" context="_898" access="public" location="f2:2780" file="f2" line="2780" offset="256"/>
  <Field id="_2748" name="InvestorID" type="_9" context="_898" access="public" location="f2:2782" file="f2" line="2782" offset="344"/>
  <Field id="_2749" name="SShortMarginRatioByMoney" type="_112" context="_898" access="public" location="f2:2784" file="f2" line="2784" offset="448"/>
  <Field id="_2750" name="SShortMarginRatioByVolume" type="_113" context="_898" access="public" location="f2:2786" file="f2" line="2786" offset="512"/>
  <Field id="_2751" name="HShortMarginRatioByMoney" type="_112" context="_898" access="public" location="f2:2788" file="f2" line="2788" offset="576"/>
  <Field id="_2752" name="HShortMarginRatioByVolume" type="_113" context="_898" access="public" location="f2:2790" file="f2" line="2790" offset="640"/>
  <Field id="_2753" name="AShortMarginRatioByMoney" type="_112" context="_898" access="public" location="f2:2792" file="f2" line="2792" offset="704"/>
  <Field id="_2754" name="AShortMarginRatioByVolume" type="_113" context="_898" access="public" location="f2:2794" file="f2" line="2794" offset="768"/>
  <Field id="_2755" name="IsRelative" type="_108" context="_898" access="public" location="f2:2796" file="f2" line="2796" offset="832"/>
  <Field id="_2756" name="MShortMarginRatioByMoney" type="_112" context="_898" access="public" location="f2:2798" file="f2" line="2798" offset="896"/>
  <Field id="_2757" name="MShortMarginRatioByVolume" type="_113" context="_898" access="public" location="f2:2800" file="f2" line="2800" offset="960"/>
  <Constructor id="_2758" name="CThostFtdcOptionInstrMarginAdjustField" context="_898" access="public" location="f2:2773" file="f2" line="2773" inline="1" artificial="1"/>
  <Constructor id="_2759" name="CThostFtdcOptionInstrMarginAdjustField" context="_898" access="public" location="f2:2773" file="f2" line="2773" inline="1" artificial="1">
    <Argument type="_6962" location="f2:2773" file="f2" line="2773"/>
  </Constructor>
  <OperatorMethod id="_2760" name="=" returns="_6963" context="_898" access="public" location="f2:2773" file="f2" line="2773" inline="1" artificial="1" mangled="_ZN38CThostFtdcOptionInstrMarginAdjustFieldaSERKS_">
    <Argument type="_6962" location="f2:2773" file="f2" line="2773"/>
  </OperatorMethod>
  <Destructor id="_2761" name="CThostFtdcOptionInstrMarginAdjustField" context="_898" access="public" location="f2:2773" file="f2" line="2773" inline="1" artificial="1"/>
  <Field id="_2762" name="InstrumentID" type="_19" context="_899" access="public" location="f2:2807" file="f2" line="2807" offset="0"/>
  <Field id="_2763" name="InvestorRange" type="_54" context="_899" access="public" location="f2:2809" file="f2" line="2809" offset="248"/>
  <Field id="_2764" name="BrokerID" type="_10" context="_899" access="public" location="f2:2811" file="f2" line="2811" offset="256"/>
  <Field id="_2765" name="InvestorID" type="_9" context="_899" access="public" location="f2:2813" file="f2" line="2813" offset="344"/>
  <Field id="_2766" name="OpenRatioByMoney" type="_112" context="_899" access="public" location="f2:2815" file="f2" line="2815" offset="448"/>
  <Field id="_2767" name="OpenRatioByVolume" type="_112" context="_899" access="public" location="f2:2817" file="f2" line="2817" offset="512"/>
  <Field id="_2768" name="CloseRatioByMoney" type="_112" context="_899" access="public" location="f2:2819" file="f2" line="2819" offset="576"/>
  <Field id="_2769" name="CloseRatioByVolume" type="_112" context="_899" access="public" location="f2:2821" file="f2" line="2821" offset="640"/>
  <Field id="_2770" name="CloseTodayRatioByMoney" type="_112" context="_899" access="public" location="f2:2823" file="f2" line="2823" offset="704"/>
  <Field id="_2771" name="CloseTodayRatioByVolume" type="_112" context="_899" access="public" location="f2:2825" file="f2" line="2825" offset="768"/>
  <Field id="_2772" name="StrikeRatioByMoney" type="_112" context="_899" access="public" location="f2:2827" file="f2" line="2827" offset="832"/>
  <Field id="_2773" name="StrikeRatioByVolume" type="_112" context="_899" access="public" location="f2:2829" file="f2" line="2829" offset="896"/>
  <Field id="_2774" name="ExchangeID" type="_23" context="_899" access="public" location="f2:2831" file="f2" line="2831" offset="960"/>
  <Field id="_2775" name="InvestUnitID" type="_748" context="_899" access="public" location="f2:2833" file="f2" line="2833" offset="1032"/>
  <Constructor id="_2776" name="CThostFtdcOptionInstrCommRateField" context="_899" access="public" location="f2:2804" file="f2" line="2804" inline="1" artificial="1"/>
  <Constructor id="_2777" name="CThostFtdcOptionInstrCommRateField" context="_899" access="public" location="f2:2804" file="f2" line="2804" inline="1" artificial="1">
    <Argument type="_6964" location="f2:2804" file="f2" line="2804"/>
  </Constructor>
  <OperatorMethod id="_2778" name="=" returns="_6965" context="_899" access="public" location="f2:2804" file="f2" line="2804" inline="1" artificial="1" mangled="_ZN34CThostFtdcOptionInstrCommRateFieldaSERKS_">
    <Argument type="_6964" location="f2:2804" file="f2" line="2804"/>
  </OperatorMethod>
  <Destructor id="_2779" name="CThostFtdcOptionInstrCommRateField" context="_899" access="public" location="f2:2804" file="f2" line="2804" inline="1" artificial="1"/>
  <Field id="_2780" name="BrokerID" type="_10" context="_900" access="public" location="f2:2840" file="f2" line="2840" offset="0"/>
  <Field id="_2781" name="InvestorID" type="_9" context="_900" access="public" location="f2:2842" file="f2" line="2842" offset="88"/>
  <Field id="_2782" name="InstrumentID" type="_19" context="_900" access="public" location="f2:2844" file="f2" line="2844" offset="192"/>
  <Field id="_2783" name="HedgeFlag" type="_75" context="_900" access="public" location="f2:2846" file="f2" line="2846" offset="440"/>
  <Field id="_2784" name="FixedMargin" type="_113" context="_900" access="public" location="f2:2848" file="f2" line="2848" offset="448"/>
  <Field id="_2785" name="MiniMargin" type="_113" context="_900" access="public" location="f2:2850" file="f2" line="2850" offset="512"/>
  <Field id="_2786" name="Royalty" type="_113" context="_900" access="public" location="f2:2852" file="f2" line="2852" offset="576"/>
  <Field id="_2787" name="ExchFixedMargin" type="_113" context="_900" access="public" location="f2:2854" file="f2" line="2854" offset="640"/>
  <Field id="_2788" name="ExchMiniMargin" type="_113" context="_900" access="public" location="f2:2856" file="f2" line="2856" offset="704"/>
  <Field id="_2789" name="ExchangeID" type="_23" context="_900" access="public" location="f2:2858" file="f2" line="2858" offset="768"/>
  <Field id="_2790" name="InvestUnitID" type="_748" context="_900" access="public" location="f2:2860" file="f2" line="2860" offset="840"/>
  <Constructor id="_2791" name="CThostFtdcOptionInstrTradeCostField" context="_900" access="public" location="f2:2837" file="f2" line="2837" inline="1" artificial="1"/>
  <Constructor id="_2792" name="CThostFtdcOptionInstrTradeCostField" context="_900" access="public" location="f2:2837" file="f2" line="2837" inline="1" artificial="1">
    <Argument type="_6966" location="f2:2837" file="f2" line="2837"/>
  </Constructor>
  <OperatorMethod id="_2793" name="=" returns="_6967" context="_900" access="public" location="f2:2837" file="f2" line="2837" inline="1" artificial="1" mangled="_ZN35CThostFtdcOptionInstrTradeCostFieldaSERKS_">
    <Argument type="_6966" location="f2:2837" file="f2" line="2837"/>
  </OperatorMethod>
  <Destructor id="_2794" name="CThostFtdcOptionInstrTradeCostField" context="_900" access="public" location="f2:2837" file="f2" line="2837" inline="1" artificial="1"/>
  <Field id="_2795" name="BrokerID" type="_10" context="_901" access="public" location="f2:2867" file="f2" line="2867" offset="0"/>
  <Field id="_2796" name="InvestorID" type="_9" context="_901" access="public" location="f2:2869" file="f2" line="2869" offset="88"/>
  <Field id="_2797" name="InstrumentID" type="_19" context="_901" access="public" location="f2:2871" file="f2" line="2871" offset="192"/>
  <Field id="_2798" name="HedgeFlag" type="_75" context="_901" access="public" location="f2:2873" file="f2" line="2873" offset="440"/>
  <Field id="_2799" name="InputPrice" type="_109" context="_901" access="public" location="f2:2875" file="f2" line="2875" offset="448"/>
  <Field id="_2800" name="UnderlyingPrice" type="_109" context="_901" access="public" location="f2:2877" file="f2" line="2877" offset="512"/>
  <Field id="_2801" name="ExchangeID" type="_23" context="_901" access="public" location="f2:2879" file="f2" line="2879" offset="576"/>
  <Field id="_2802" name="InvestUnitID" type="_748" context="_901" access="public" location="f2:2881" file="f2" line="2881" offset="648"/>
  <Constructor id="_2803" name="CThostFtdcQryOptionInstrTradeCostField" context="_901" access="public" location="f2:2864" file="f2" line="2864" inline="1" artificial="1"/>
  <Constructor id="_2804" name="CThostFtdcQryOptionInstrTradeCostField" context="_901" access="public" location="f2:2864" file="f2" line="2864" inline="1" artificial="1">
    <Argument type="_6968" location="f2:2864" file="f2" line="2864"/>
  </Constructor>
  <OperatorMethod id="_2805" name="=" returns="_6969" context="_901" access="public" location="f2:2864" file="f2" line="2864" inline="1" artificial="1" mangled="_ZN38CThostFtdcQryOptionInstrTradeCostFieldaSERKS_">
    <Argument type="_6968" location="f2:2864" file="f2" line="2864"/>
  </OperatorMethod>
  <Destructor id="_2806" name="CThostFtdcQryOptionInstrTradeCostField" context="_901" access="public" location="f2:2864" file="f2" line="2864" inline="1" artificial="1"/>
  <Field id="_2807" name="BrokerID" type="_10" context="_902" access="public" location="f2:2888" file="f2" line="2888" offset="0"/>
  <Field id="_2808" name="InvestorID" type="_9" context="_902" access="public" location="f2:2890" file="f2" line="2890" offset="88"/>
  <Field id="_2809" name="InstrumentID" type="_19" context="_902" access="public" location="f2:2892" file="f2" line="2892" offset="192"/>
  <Field id="_2810" name="ExchangeID" type="_23" context="_902" access="public" location="f2:2894" file="f2" line="2894" offset="440"/>
  <Field id="_2811" name="InvestUnitID" type="_748" context="_902" access="public" location="f2:2896" file="f2" line="2896" offset="512"/>
  <Constructor id="_2812" name="CThostFtdcQryOptionInstrCommRateField" context="_902" access="public" location="f2:2885" file="f2" line="2885" inline="1" artificial="1"/>
  <Constructor id="_2813" name="CThostFtdcQryOptionInstrCommRateField" context="_902" access="public" location="f2:2885" file="f2" line="2885" inline="1" artificial="1">
    <Argument type="_6970" location="f2:2885" file="f2" line="2885"/>
  </Constructor>
  <OperatorMethod id="_2814" name="=" returns="_6971" context="_902" access="public" location="f2:2885" file="f2" line="2885" inline="1" artificial="1" mangled="_ZN37CThostFtdcQryOptionInstrCommRateFieldaSERKS_">
    <Argument type="_6970" location="f2:2885" file="f2" line="2885"/>
  </OperatorMethod>
  <Destructor id="_2815" name="CThostFtdcQryOptionInstrCommRateField" context="_902" access="public" location="f2:2885" file="f2" line="2885" inline="1" artificial="1"/>
  <Field id="_2816" name="BrokerID" type="_10" context="_903" access="public" location="f2:2903" file="f2" line="2903" offset="0"/>
  <Field id="_2817" name="InstrumentID" type="_19" context="_903" access="public" location="f2:2905" file="f2" line="2905" offset="88"/>
  <Field id="_2818" name="ClosePrice" type="_109" context="_903" access="public" location="f2:2907" file="f2" line="2907" offset="384"/>
  <Constructor id="_2819" name="CThostFtdcIndexPriceField" context="_903" access="public" location="f2:2900" file="f2" line="2900" inline="1" artificial="1"/>
  <Constructor id="_2820" name="CThostFtdcIndexPriceField" context="_903" access="public" location="f2:2900" file="f2" line="2900" inline="1" artificial="1">
    <Argument type="_6972" location="f2:2900" file="f2" line="2900"/>
  </Constructor>
  <OperatorMethod id="_2821" name="=" returns="_6973" context="_903" access="public" location="f2:2900" file="f2" line="2900" inline="1" artificial="1" mangled="_ZN25CThostFtdcIndexPriceFieldaSERKS_">
    <Argument type="_6972" location="f2:2900" file="f2" line="2900"/>
  </OperatorMethod>
  <Destructor id="_2822" name="CThostFtdcIndexPriceField" context="_903" access="public" location="f2:2900" file="f2" line="2900" inline="1" artificial="1"/>
  <Field id="_2823" name="BrokerID" type="_10" context="_904" access="public" location="f2:2914" file="f2" line="2914" offset="0"/>
  <Field id="_2824" name="InvestorID" type="_9" context="_904" access="public" location="f2:2916" file="f2" line="2916" offset="88"/>
  <Field id="_2825" name="InstrumentID" type="_19" context="_904" access="public" location="f2:2918" file="f2" line="2918" offset="192"/>
  <Field id="_2826" name="ExecOrderRef" type="_14" context="_904" access="public" location="f2:2920" file="f2" line="2920" offset="440"/>
  <Field id="_2827" name="UserID" type="_16" context="_904" access="public" location="f2:2922" file="f2" line="2922" offset="544"/>
  <Field id="_2828" name="Volume" type="_97" context="_904" access="public" location="f2:2924" file="f2" line="2924" offset="672"/>
  <Field id="_2829" name="RequestID" type="_105" context="_904" access="public" location="f2:2926" file="f2" line="2926" offset="704"/>
  <Field id="_2830" name="BusinessUnit" type="_42" context="_904" access="public" location="f2:2928" file="f2" line="2928" offset="736"/>
  <Field id="_2831" name="OffsetFlag" type="_79" context="_904" access="public" location="f2:2930" file="f2" line="2930" offset="904"/>
  <Field id="_2832" name="HedgeFlag" type="_75" context="_904" access="public" location="f2:2932" file="f2" line="2932" offset="912"/>
  <Field id="_2833" name="ActionType" type="_734" context="_904" access="public" location="f2:2934" file="f2" line="2934" offset="920"/>
  <Field id="_2834" name="PosiDirection" type="_72" context="_904" access="public" location="f2:2936" file="f2" line="2936" offset="928"/>
  <Field id="_2835" name="ReservePositionFlag" type="_737" context="_904" access="public" location="f2:2938" file="f2" line="2938" offset="936"/>
  <Field id="_2836" name="CloseFlag" type="_738" context="_904" access="public" location="f2:2940" file="f2" line="2940" offset="944"/>
  <Field id="_2837" name="ExchangeID" type="_23" context="_904" access="public" location="f2:2942" file="f2" line="2942" offset="952"/>
  <Field id="_2838" name="InvestUnitID" type="_748" context="_904" access="public" location="f2:2944" file="f2" line="2944" offset="1024"/>
  <Field id="_2839" name="AccountID" type="_170" context="_904" access="public" location="f2:2946" file="f2" line="2946" offset="1160"/>
  <Field id="_2840" name="CurrencyID" type="_335" context="_904" access="public" location="f2:2948" file="f2" line="2948" offset="1264"/>
  <Field id="_2841" name="ClientID" type="_18" context="_904" access="public" location="f2:2950" file="f2" line="2950" offset="1296"/>
  <Field id="_2842" name="IPAddress" type="_38" context="_904" access="public" location="f2:2952" file="f2" line="2952" offset="1384"/>
  <Field id="_2843" name="MacAddress" type="_27" context="_904" access="public" location="f2:2954" file="f2" line="2954" offset="1512"/>
  <Constructor id="_2844" name="CThostFtdcInputExecOrderField" context="_904" access="public" location="f2:2911" file="f2" line="2911" inline="1" artificial="1"/>
  <Constructor id="_2845" name="CThostFtdcInputExecOrderField" context="_904" access="public" location="f2:2911" file="f2" line="2911" inline="1" artificial="1">
    <Argument type="_6974" location="f2:2911" file="f2" line="2911"/>
  </Constructor>
  <OperatorMethod id="_2846" name="=" returns="_6975" context="_904" access="public" location="f2:2911" file="f2" line="2911" inline="1" artificial="1" mangled="_ZN29CThostFtdcInputExecOrderFieldaSERKS_">
    <Argument type="_6974" location="f2:2911" file="f2" line="2911"/>
  </OperatorMethod>
  <Destructor id="_2847" name="CThostFtdcInputExecOrderField" context="_904" access="public" location="f2:2911" file="f2" line="2911" inline="1" artificial="1"/>
  <Field id="_2848" name="BrokerID" type="_10" context="_905" access="public" location="f2:2961" file="f2" line="2961" offset="0"/>
  <Field id="_2849" name="InvestorID" type="_9" context="_905" access="public" location="f2:2963" file="f2" line="2963" offset="88"/>
  <Field id="_2850" name="ExecOrderActionRef" type="_92" context="_905" access="public" location="f2:2965" file="f2" line="2965" offset="192"/>
  <Field id="_2851" name="ExecOrderRef" type="_14" context="_905" access="public" location="f2:2967" file="f2" line="2967" offset="224"/>
  <Field id="_2852" name="RequestID" type="_105" context="_905" access="public" location="f2:2969" file="f2" line="2969" offset="352"/>
  <Field id="_2853" name="FrontID" type="_98" context="_905" access="public" location="f2:2971" file="f2" line="2971" offset="384"/>
  <Field id="_2854" name="SessionID" type="_99" context="_905" access="public" location="f2:2973" file="f2" line="2973" offset="416"/>
  <Field id="_2855" name="ExchangeID" type="_23" context="_905" access="public" location="f2:2975" file="f2" line="2975" offset="448"/>
  <Field id="_2856" name="ExecOrderSysID" type="_726" context="_905" access="public" location="f2:2977" file="f2" line="2977" offset="520"/>
  <Field id="_2857" name="ActionFlag" type="_85" context="_905" access="public" location="f2:2979" file="f2" line="2979" offset="688"/>
  <Field id="_2858" name="UserID" type="_16" context="_905" access="public" location="f2:2981" file="f2" line="2981" offset="696"/>
  <Field id="_2859" name="InstrumentID" type="_19" context="_905" access="public" location="f2:2983" file="f2" line="2983" offset="824"/>
  <Field id="_2860" name="InvestUnitID" type="_748" context="_905" access="public" location="f2:2985" file="f2" line="2985" offset="1072"/>
  <Field id="_2861" name="IPAddress" type="_38" context="_905" access="public" location="f2:2987" file="f2" line="2987" offset="1208"/>
  <Field id="_2862" name="MacAddress" type="_27" context="_905" access="public" location="f2:2989" file="f2" line="2989" offset="1336"/>
  <Constructor id="_2863" name="CThostFtdcInputExecOrderActionField" context="_905" access="public" location="f2:2958" file="f2" line="2958" inline="1" artificial="1"/>
  <Constructor id="_2864" name="CThostFtdcInputExecOrderActionField" context="_905" access="public" location="f2:2958" file="f2" line="2958" inline="1" artificial="1">
    <Argument type="_6976" location="f2:2958" file="f2" line="2958"/>
  </Constructor>
  <OperatorMethod id="_2865" name="=" returns="_6977" context="_905" access="public" location="f2:2958" file="f2" line="2958" inline="1" artificial="1" mangled="_ZN35CThostFtdcInputExecOrderActionFieldaSERKS_">
    <Argument type="_6976" location="f2:2958" file="f2" line="2958"/>
  </OperatorMethod>
  <Destructor id="_2866" name="CThostFtdcInputExecOrderActionField" context="_905" access="public" location="f2:2958" file="f2" line="2958" inline="1" artificial="1"/>
  <Field id="_2867" name="BrokerID" type="_10" context="_906" access="public" location="f2:2996" file="f2" line="2996" offset="0"/>
  <Field id="_2868" name="InvestorID" type="_9" context="_906" access="public" location="f2:2998" file="f2" line="2998" offset="88"/>
  <Field id="_2869" name="InstrumentID" type="_19" context="_906" access="public" location="f2:3000" file="f2" line="3000" offset="192"/>
  <Field id="_2870" name="ExecOrderRef" type="_14" context="_906" access="public" location="f2:3002" file="f2" line="3002" offset="440"/>
  <Field id="_2871" name="UserID" type="_16" context="_906" access="public" location="f2:3004" file="f2" line="3004" offset="544"/>
  <Field id="_2872" name="Volume" type="_97" context="_906" access="public" location="f2:3006" file="f2" line="3006" offset="672"/>
  <Field id="_2873" name="RequestID" type="_105" context="_906" access="public" location="f2:3008" file="f2" line="3008" offset="704"/>
  <Field id="_2874" name="BusinessUnit" type="_42" context="_906" access="public" location="f2:3010" file="f2" line="3010" offset="736"/>
  <Field id="_2875" name="OffsetFlag" type="_79" context="_906" access="public" location="f2:3012" file="f2" line="3012" offset="904"/>
  <Field id="_2876" name="HedgeFlag" type="_75" context="_906" access="public" location="f2:3014" file="f2" line="3014" offset="912"/>
  <Field id="_2877" name="ActionType" type="_734" context="_906" access="public" location="f2:3016" file="f2" line="3016" offset="920"/>
  <Field id="_2878" name="PosiDirection" type="_72" context="_906" access="public" location="f2:3018" file="f2" line="3018" offset="928"/>
  <Field id="_2879" name="ReservePositionFlag" type="_737" context="_906" access="public" location="f2:3020" file="f2" line="3020" offset="936"/>
  <Field id="_2880" name="CloseFlag" type="_738" context="_906" access="public" location="f2:3022" file="f2" line="3022" offset="944"/>
  <Field id="_2881" name="ExecOrderLocalID" type="_46" context="_906" access="public" location="f2:3024" file="f2" line="3024" offset="952"/>
  <Field id="_2882" name="ExchangeID" type="_23" context="_906" access="public" location="f2:3026" file="f2" line="3026" offset="1056"/>
  <Field id="_2883" name="ParticipantID" type="_15" context="_906" access="public" location="f2:3028" file="f2" line="3028" offset="1128"/>
  <Field id="_2884" name="ClientID" type="_18" context="_906" access="public" location="f2:3030" file="f2" line="3030" offset="1216"/>
  <Field id="_2885" name="ExchangeInstID" type="_13" context="_906" access="public" location="f2:3032" file="f2" line="3032" offset="1304"/>
  <Field id="_2886" name="TraderID" type="_8" context="_906" access="public" location="f2:3034" file="f2" line="3034" offset="1552"/>
  <Field id="_2887" name="InstallID" type="_94" context="_906" access="public" location="f2:3036" file="f2" line="3036" offset="1728"/>
  <Field id="_2888" name="OrderSubmitStatus" type="_64" context="_906" access="public" location="f2:3038" file="f2" line="3038" offset="1760"/>
  <Field id="_2889" name="NotifySequence" type="_100" context="_906" access="public" location="f2:3040" file="f2" line="3040" offset="1792"/>
  <Field id="_2890" name="TradingDay" type="_30" context="_906" access="public" location="f2:3042" file="f2" line="3042" offset="1824"/>
  <Field id="_2891" name="SettlementID" type="_96" context="_906" access="public" location="f2:3044" file="f2" line="3044" offset="1920"/>
  <Field id="_2892" name="ExecOrderSysID" type="_726" context="_906" access="public" location="f2:3046" file="f2" line="3046" offset="1952"/>
  <Field id="_2893" name="InsertDate" type="_30" context="_906" access="public" location="f2:3048" file="f2" line="3048" offset="2120"/>
  <Field id="_2894" name="InsertTime" type="_31" context="_906" access="public" location="f2:3050" file="f2" line="3050" offset="2192"/>
  <Field id="_2895" name="CancelTime" type="_31" context="_906" access="public" location="f2:3052" file="f2" line="3052" offset="2264"/>
  <Field id="_2896" name="ExecResult" type="_727" context="_906" access="public" location="f2:3054" file="f2" line="3054" offset="2336"/>
  <Field id="_2897" name="ClearingPartID" type="_15" context="_906" access="public" location="f2:3056" file="f2" line="3056" offset="2344"/>
  <Field id="_2898" name="SequenceNo" type="_100" context="_906" access="public" location="f2:3058" file="f2" line="3058" offset="2432"/>
  <Field id="_2899" name="FrontID" type="_98" context="_906" access="public" location="f2:3060" file="f2" line="3060" offset="2464"/>
  <Field id="_2900" name="SessionID" type="_99" context="_906" access="public" location="f2:3062" file="f2" line="3062" offset="2496"/>
  <Field id="_2901" name="UserProductInfo" type="_40" context="_906" access="public" location="f2:3064" file="f2" line="3064" offset="2528"/>
  <Field id="_2902" name="StatusMsg" type="_49" context="_906" access="public" location="f2:3066" file="f2" line="3066" offset="2616"/>
  <Field id="_2903" name="ActiveUserID" type="_16" context="_906" access="public" location="f2:3068" file="f2" line="3068" offset="3264"/>
  <Field id="_2904" name="BrokerExecOrderSeq" type="_100" context="_906" access="public" location="f2:3070" file="f2" line="3070" offset="3392"/>
  <Field id="_2905" name="BranchID" type="_261" context="_906" access="public" location="f2:3072" file="f2" line="3072" offset="3424"/>
  <Field id="_2906" name="InvestUnitID" type="_748" context="_906" access="public" location="f2:3074" file="f2" line="3074" offset="3496"/>
  <Field id="_2907" name="AccountID" type="_170" context="_906" access="public" location="f2:3076" file="f2" line="3076" offset="3632"/>
  <Field id="_2908" name="CurrencyID" type="_335" context="_906" access="public" location="f2:3078" file="f2" line="3078" offset="3736"/>
  <Field id="_2909" name="IPAddress" type="_38" context="_906" access="public" location="f2:3080" file="f2" line="3080" offset="3768"/>
  <Field id="_2910" name="MacAddress" type="_27" context="_906" access="public" location="f2:3082" file="f2" line="3082" offset="3896"/>
  <Constructor id="_2911" name="CThostFtdcExecOrderField" context="_906" access="public" location="f2:2993" file="f2" line="2993" inline="1" artificial="1"/>
  <Constructor id="_2912" name="CThostFtdcExecOrderField" context="_906" access="public" location="f2:2993" file="f2" line="2993" inline="1" artificial="1">
    <Argument type="_6978" location="f2:2993" file="f2" line="2993"/>
  </Constructor>
  <OperatorMethod id="_2913" name="=" returns="_6979" context="_906" access="public" location="f2:2993" file="f2" line="2993" inline="1" artificial="1" mangled="_ZN24CThostFtdcExecOrderFieldaSERKS_">
    <Argument type="_6978" location="f2:2993" file="f2" line="2993"/>
  </OperatorMethod>
  <Destructor id="_2914" name="CThostFtdcExecOrderField" context="_906" access="public" location="f2:2993" file="f2" line="2993" inline="1" artificial="1"/>
  <Field id="_2915" name="BrokerID" type="_10" context="_907" access="public" location="f2:3089" file="f2" line="3089" offset="0"/>
  <Field id="_2916" name="InvestorID" type="_9" context="_907" access="public" location="f2:3091" file="f2" line="3091" offset="88"/>
  <Field id="_2917" name="ExecOrderActionRef" type="_92" context="_907" access="public" location="f2:3093" file="f2" line="3093" offset="192"/>
  <Field id="_2918" name="ExecOrderRef" type="_14" context="_907" access="public" location="f2:3095" file="f2" line="3095" offset="224"/>
  <Field id="_2919" name="RequestID" type="_105" context="_907" access="public" location="f2:3097" file="f2" line="3097" offset="352"/>
  <Field id="_2920" name="FrontID" type="_98" context="_907" access="public" location="f2:3099" file="f2" line="3099" offset="384"/>
  <Field id="_2921" name="SessionID" type="_99" context="_907" access="public" location="f2:3101" file="f2" line="3101" offset="416"/>
  <Field id="_2922" name="ExchangeID" type="_23" context="_907" access="public" location="f2:3103" file="f2" line="3103" offset="448"/>
  <Field id="_2923" name="ExecOrderSysID" type="_726" context="_907" access="public" location="f2:3105" file="f2" line="3105" offset="520"/>
  <Field id="_2924" name="ActionFlag" type="_85" context="_907" access="public" location="f2:3107" file="f2" line="3107" offset="688"/>
  <Field id="_2925" name="ActionDate" type="_30" context="_907" access="public" location="f2:3109" file="f2" line="3109" offset="696"/>
  <Field id="_2926" name="ActionTime" type="_31" context="_907" access="public" location="f2:3111" file="f2" line="3111" offset="768"/>
  <Field id="_2927" name="TraderID" type="_8" context="_907" access="public" location="f2:3113" file="f2" line="3113" offset="840"/>
  <Field id="_2928" name="InstallID" type="_94" context="_907" access="public" location="f2:3115" file="f2" line="3115" offset="1024"/>
  <Field id="_2929" name="ExecOrderLocalID" type="_46" context="_907" access="public" location="f2:3117" file="f2" line="3117" offset="1056"/>
  <Field id="_2930" name="ActionLocalID" type="_46" context="_907" access="public" location="f2:3119" file="f2" line="3119" offset="1160"/>
  <Field id="_2931" name="ParticipantID" type="_15" context="_907" access="public" location="f2:3121" file="f2" line="3121" offset="1264"/>
  <Field id="_2932" name="ClientID" type="_18" context="_907" access="public" location="f2:3123" file="f2" line="3123" offset="1352"/>
  <Field id="_2933" name="BusinessUnit" type="_42" context="_907" access="public" location="f2:3125" file="f2" line="3125" offset="1440"/>
  <Field id="_2934" name="OrderActionStatus" type="_62" context="_907" access="public" location="f2:3127" file="f2" line="3127" offset="1608"/>
  <Field id="_2935" name="UserID" type="_16" context="_907" access="public" location="f2:3129" file="f2" line="3129" offset="1616"/>
  <Field id="_2936" name="ActionType" type="_734" context="_907" access="public" location="f2:3131" file="f2" line="3131" offset="1744"/>
  <Field id="_2937" name="StatusMsg" type="_49" context="_907" access="public" location="f2:3133" file="f2" line="3133" offset="1752"/>
  <Field id="_2938" name="InstrumentID" type="_19" context="_907" access="public" location="f2:3135" file="f2" line="3135" offset="2400"/>
  <Field id="_2939" name="BranchID" type="_261" context="_907" access="public" location="f2:3137" file="f2" line="3137" offset="2648"/>
  <Field id="_2940" name="InvestUnitID" type="_748" context="_907" access="public" location="f2:3139" file="f2" line="3139" offset="2720"/>
  <Field id="_2941" name="IPAddress" type="_38" context="_907" access="public" location="f2:3141" file="f2" line="3141" offset="2856"/>
  <Field id="_2942" name="MacAddress" type="_27" context="_907" access="public" location="f2:3143" file="f2" line="3143" offset="2984"/>
  <Constructor id="_2943" name="CThostFtdcExecOrderActionField" context="_907" access="public" location="f2:3086" file="f2" line="3086" inline="1" artificial="1"/>
  <Constructor id="_2944" name="CThostFtdcExecOrderActionField" context="_907" access="public" location="f2:3086" file="f2" line="3086" inline="1" artificial="1">
    <Argument type="_6980" location="f2:3086" file="f2" line="3086"/>
  </Constructor>
  <OperatorMethod id="_2945" name="=" returns="_6981" context="_907" access="public" location="f2:3086" file="f2" line="3086" inline="1" artificial="1" mangled="_ZN30CThostFtdcExecOrderActionFieldaSERKS_">
    <Argument type="_6980" location="f2:3086" file="f2" line="3086"/>
  </OperatorMethod>
  <Destructor id="_2946" name="CThostFtdcExecOrderActionField" context="_907" access="public" location="f2:3086" file="f2" line="3086" inline="1" artificial="1"/>
  <Field id="_2947" name="BrokerID" type="_10" context="_908" access="public" location="f2:3150" file="f2" line="3150" offset="0"/>
  <Field id="_2948" name="InvestorID" type="_9" context="_908" access="public" location="f2:3152" file="f2" line="3152" offset="88"/>
  <Field id="_2949" name="InstrumentID" type="_19" context="_908" access="public" location="f2:3154" file="f2" line="3154" offset="192"/>
  <Field id="_2950" name="ExchangeID" type="_23" context="_908" access="public" location="f2:3156" file="f2" line="3156" offset="440"/>
  <Field id="_2951" name="ExecOrderSysID" type="_726" context="_908" access="public" location="f2:3158" file="f2" line="3158" offset="512"/>
  <Field id="_2952" name="InsertTimeStart" type="_31" context="_908" access="public" location="f2:3160" file="f2" line="3160" offset="680"/>
  <Field id="_2953" name="InsertTimeEnd" type="_31" context="_908" access="public" location="f2:3162" file="f2" line="3162" offset="752"/>
  <Constructor id="_2954" name="CThostFtdcQryExecOrderField" context="_908" access="public" location="f2:3147" file="f2" line="3147" inline="1" artificial="1"/>
  <Constructor id="_2955" name="CThostFtdcQryExecOrderField" context="_908" access="public" location="f2:3147" file="f2" line="3147" inline="1" artificial="1">
    <Argument type="_6982" location="f2:3147" file="f2" line="3147"/>
  </Constructor>
  <OperatorMethod id="_2956" name="=" returns="_6983" context="_908" access="public" location="f2:3147" file="f2" line="3147" inline="1" artificial="1" mangled="_ZN27CThostFtdcQryExecOrderFieldaSERKS_">
    <Argument type="_6982" location="f2:3147" file="f2" line="3147"/>
  </OperatorMethod>
  <Destructor id="_2957" name="CThostFtdcQryExecOrderField" context="_908" access="public" location="f2:3147" file="f2" line="3147" inline="1" artificial="1"/>
  <Field id="_2958" name="Volume" type="_97" context="_909" access="public" location="f2:3169" file="f2" line="3169" offset="0"/>
  <Field id="_2959" name="RequestID" type="_105" context="_909" access="public" location="f2:3171" file="f2" line="3171" offset="32"/>
  <Field id="_2960" name="BusinessUnit" type="_42" context="_909" access="public" location="f2:3173" file="f2" line="3173" offset="64"/>
  <Field id="_2961" name="OffsetFlag" type="_79" context="_909" access="public" location="f2:3175" file="f2" line="3175" offset="232"/>
  <Field id="_2962" name="HedgeFlag" type="_75" context="_909" access="public" location="f2:3177" file="f2" line="3177" offset="240"/>
  <Field id="_2963" name="ActionType" type="_734" context="_909" access="public" location="f2:3179" file="f2" line="3179" offset="248"/>
  <Field id="_2964" name="PosiDirection" type="_72" context="_909" access="public" location="f2:3181" file="f2" line="3181" offset="256"/>
  <Field id="_2965" name="ReservePositionFlag" type="_737" context="_909" access="public" location="f2:3183" file="f2" line="3183" offset="264"/>
  <Field id="_2966" name="CloseFlag" type="_738" context="_909" access="public" location="f2:3185" file="f2" line="3185" offset="272"/>
  <Field id="_2967" name="ExecOrderLocalID" type="_46" context="_909" access="public" location="f2:3187" file="f2" line="3187" offset="280"/>
  <Field id="_2968" name="ExchangeID" type="_23" context="_909" access="public" location="f2:3189" file="f2" line="3189" offset="384"/>
  <Field id="_2969" name="ParticipantID" type="_15" context="_909" access="public" location="f2:3191" file="f2" line="3191" offset="456"/>
  <Field id="_2970" name="ClientID" type="_18" context="_909" access="public" location="f2:3193" file="f2" line="3193" offset="544"/>
  <Field id="_2971" name="ExchangeInstID" type="_13" context="_909" access="public" location="f2:3195" file="f2" line="3195" offset="632"/>
  <Field id="_2972" name="TraderID" type="_8" context="_909" access="public" location="f2:3197" file="f2" line="3197" offset="880"/>
  <Field id="_2973" name="InstallID" type="_94" context="_909" access="public" location="f2:3199" file="f2" line="3199" offset="1056"/>
  <Field id="_2974" name="OrderSubmitStatus" type="_64" context="_909" access="public" location="f2:3201" file="f2" line="3201" offset="1088"/>
  <Field id="_2975" name="NotifySequence" type="_100" context="_909" access="public" location="f2:3203" file="f2" line="3203" offset="1120"/>
  <Field id="_2976" name="TradingDay" type="_30" context="_909" access="public" location="f2:3205" file="f2" line="3205" offset="1152"/>
  <Field id="_2977" name="SettlementID" type="_96" context="_909" access="public" location="f2:3207" file="f2" line="3207" offset="1248"/>
  <Field id="_2978" name="ExecOrderSysID" type="_726" context="_909" access="public" location="f2:3209" file="f2" line="3209" offset="1280"/>
  <Field id="_2979" name="InsertDate" type="_30" context="_909" access="public" location="f2:3211" file="f2" line="3211" offset="1448"/>
  <Field id="_2980" name="InsertTime" type="_31" context="_909" access="public" location="f2:3213" file="f2" line="3213" offset="1520"/>
  <Field id="_2981" name="CancelTime" type="_31" context="_909" access="public" location="f2:3215" file="f2" line="3215" offset="1592"/>
  <Field id="_2982" name="ExecResult" type="_727" context="_909" access="public" location="f2:3217" file="f2" line="3217" offset="1664"/>
  <Field id="_2983" name="ClearingPartID" type="_15" context="_909" access="public" location="f2:3219" file="f2" line="3219" offset="1672"/>
  <Field id="_2984" name="SequenceNo" type="_100" context="_909" access="public" location="f2:3221" file="f2" line="3221" offset="1760"/>
  <Field id="_2985" name="BranchID" type="_261" context="_909" access="public" location="f2:3223" file="f2" line="3223" offset="1792"/>
  <Field id="_2986" name="IPAddress" type="_38" context="_909" access="public" location="f2:3225" file="f2" line="3225" offset="1864"/>
  <Field id="_2987" name="MacAddress" type="_27" context="_909" access="public" location="f2:3227" file="f2" line="3227" offset="1992"/>
  <Constructor id="_2988" name="CThostFtdcExchangeExecOrderField" context="_909" access="public" location="f2:3166" file="f2" line="3166" inline="1" artificial="1"/>
  <Constructor id="_2989" name="CThostFtdcExchangeExecOrderField" context="_909" access="public" location="f2:3166" file="f2" line="3166" inline="1" artificial="1">
    <Argument type="_6984" location="f2:3166" file="f2" line="3166"/>
  </Constructor>
  <OperatorMethod id="_2990" name="=" returns="_6985" context="_909" access="public" location="f2:3166" file="f2" line="3166" inline="1" artificial="1" mangled="_ZN32CThostFtdcExchangeExecOrderFieldaSERKS_">
    <Argument type="_6984" location="f2:3166" file="f2" line="3166"/>
  </OperatorMethod>
  <Destructor id="_2991" name="CThostFtdcExchangeExecOrderField" context="_909" access="public" location="f2:3166" file="f2" line="3166" inline="1" artificial="1"/>
  <Field id="_2992" name="ParticipantID" type="_15" context="_910" access="public" location="f2:3234" file="f2" line="3234" offset="0"/>
  <Field id="_2993" name="ClientID" type="_18" context="_910" access="public" location="f2:3236" file="f2" line="3236" offset="88"/>
  <Field id="_2994" name="ExchangeInstID" type="_13" context="_910" access="public" location="f2:3238" file="f2" line="3238" offset="176"/>
  <Field id="_2995" name="ExchangeID" type="_23" context="_910" access="public" location="f2:3240" file="f2" line="3240" offset="424"/>
  <Field id="_2996" name="TraderID" type="_8" context="_910" access="public" location="f2:3242" file="f2" line="3242" offset="496"/>
  <Constructor id="_2997" name="CThostFtdcQryExchangeExecOrderField" context="_910" access="public" location="f2:3231" file="f2" line="3231" inline="1" artificial="1"/>
  <Constructor id="_2998" name="CThostFtdcQryExchangeExecOrderField" context="_910" access="public" location="f2:3231" file="f2" line="3231" inline="1" artificial="1">
    <Argument type="_6986" location="f2:3231" file="f2" line="3231"/>
  </Constructor>
  <OperatorMethod id="_2999" name="=" returns="_6987" context="_910" access="public" location="f2:3231" file="f2" line="3231" inline="1" artificial="1" mangled="_ZN35CThostFtdcQryExchangeExecOrderFieldaSERKS_">
    <Argument type="_6986" location="f2:3231" file="f2" line="3231"/>
  </OperatorMethod>
  <Destructor id="_3000" name="CThostFtdcQryExchangeExecOrderField" context="_910" access="public" location="f2:3231" file="f2" line="3231" inline="1" artificial="1"/>
  <Field id="_3001" name="BrokerID" type="_10" context="_911" access="public" location="f2:3249" file="f2" line="3249" offset="0"/>
  <Field id="_3002" name="InvestorID" type="_9" context="_911" access="public" location="f2:3251" file="f2" line="3251" offset="88"/>
  <Field id="_3003" name="ExchangeID" type="_23" context="_911" access="public" location="f2:3253" file="f2" line="3253" offset="192"/>
  <Constructor id="_3004" name="CThostFtdcQryExecOrderActionField" context="_911" access="public" location="f2:3246" file="f2" line="3246" inline="1" artificial="1"/>
  <Constructor id="_3005" name="CThostFtdcQryExecOrderActionField" context="_911" access="public" location="f2:3246" file="f2" line="3246" inline="1" artificial="1">
    <Argument type="_6988" location="f2:3246" file="f2" line="3246"/>
  </Constructor>
  <OperatorMethod id="_3006" name="=" returns="_6989" context="_911" access="public" location="f2:3246" file="f2" line="3246" inline="1" artificial="1" mangled="_ZN33CThostFtdcQryExecOrderActionFieldaSERKS_">
    <Argument type="_6988" location="f2:3246" file="f2" line="3246"/>
  </OperatorMethod>
  <Destructor id="_3007" name="CThostFtdcQryExecOrderActionField" context="_911" access="public" location="f2:3246" file="f2" line="3246" inline="1" artificial="1"/>
  <Field id="_3008" name="ExchangeID" type="_23" context="_912" access="public" location="f2:3260" file="f2" line="3260" offset="0"/>
  <Field id="_3009" name="ExecOrderSysID" type="_726" context="_912" access="public" location="f2:3262" file="f2" line="3262" offset="72"/>
  <Field id="_3010" name="ActionFlag" type="_85" context="_912" access="public" location="f2:3264" file="f2" line="3264" offset="240"/>
  <Field id="_3011" name="ActionDate" type="_30" context="_912" access="public" location="f2:3266" file="f2" line="3266" offset="248"/>
  <Field id="_3012" name="ActionTime" type="_31" context="_912" access="public" location="f2:3268" file="f2" line="3268" offset="320"/>
  <Field id="_3013" name="TraderID" type="_8" context="_912" access="public" location="f2:3270" file="f2" line="3270" offset="392"/>
  <Field id="_3014" name="InstallID" type="_94" context="_912" access="public" location="f2:3272" file="f2" line="3272" offset="576"/>
  <Field id="_3015" name="ExecOrderLocalID" type="_46" context="_912" access="public" location="f2:3274" file="f2" line="3274" offset="608"/>
  <Field id="_3016" name="ActionLocalID" type="_46" context="_912" access="public" location="f2:3276" file="f2" line="3276" offset="712"/>
  <Field id="_3017" name="ParticipantID" type="_15" context="_912" access="public" location="f2:3278" file="f2" line="3278" offset="816"/>
  <Field id="_3018" name="ClientID" type="_18" context="_912" access="public" location="f2:3280" file="f2" line="3280" offset="904"/>
  <Field id="_3019" name="BusinessUnit" type="_42" context="_912" access="public" location="f2:3282" file="f2" line="3282" offset="992"/>
  <Field id="_3020" name="OrderActionStatus" type="_62" context="_912" access="public" location="f2:3284" file="f2" line="3284" offset="1160"/>
  <Field id="_3021" name="UserID" type="_16" context="_912" access="public" location="f2:3286" file="f2" line="3286" offset="1168"/>
  <Field id="_3022" name="ActionType" type="_734" context="_912" access="public" location="f2:3288" file="f2" line="3288" offset="1296"/>
  <Field id="_3023" name="BranchID" type="_261" context="_912" access="public" location="f2:3290" file="f2" line="3290" offset="1304"/>
  <Field id="_3024" name="IPAddress" type="_38" context="_912" access="public" location="f2:3292" file="f2" line="3292" offset="1376"/>
  <Field id="_3025" name="MacAddress" type="_27" context="_912" access="public" location="f2:3294" file="f2" line="3294" offset="1504"/>
  <Field id="_3026" name="ExchangeInstID" type="_13" context="_912" access="public" location="f2:3296" file="f2" line="3296" offset="1672"/>
  <Field id="_3027" name="Volume" type="_97" context="_912" access="public" location="f2:3298" file="f2" line="3298" offset="1920"/>
  <Constructor id="_3028" name="CThostFtdcExchangeExecOrderActionField" context="_912" access="public" location="f2:3257" file="f2" line="3257" inline="1" artificial="1"/>
  <Constructor id="_3029" name="CThostFtdcExchangeExecOrderActionField" context="_912" access="public" location="f2:3257" file="f2" line="3257" inline="1" artificial="1">
    <Argument type="_6990" location="f2:3257" file="f2" line="3257"/>
  </Constructor>
  <OperatorMethod id="_3030" name="=" returns="_6991" context="_912" access="public" location="f2:3257" file="f2" line="3257" inline="1" artificial="1" mangled="_ZN38CThostFtdcExchangeExecOrderActionFieldaSERKS_">
    <Argument type="_6990" location="f2:3257" file="f2" line="3257"/>
  </OperatorMethod>
  <Destructor id="_3031" name="CThostFtdcExchangeExecOrderActionField" context="_912" access="public" location="f2:3257" file="f2" line="3257" inline="1" artificial="1"/>
  <Field id="_3032" name="ParticipantID" type="_15" context="_913" access="public" location="f2:3305" file="f2" line="3305" offset="0"/>
  <Field id="_3033" name="ClientID" type="_18" context="_913" access="public" location="f2:3307" file="f2" line="3307" offset="88"/>
  <Field id="_3034" name="ExchangeID" type="_23" context="_913" access="public" location="f2:3309" file="f2" line="3309" offset="176"/>
  <Field id="_3035" name="TraderID" type="_8" context="_913" access="public" location="f2:3311" file="f2" line="3311" offset="248"/>
  <Constructor id="_3036" name="CThostFtdcQryExchangeExecOrderActionField" context="_913" access="public" location="f2:3302" file="f2" line="3302" inline="1" artificial="1"/>
  <Constructor id="_3037" name="CThostFtdcQryExchangeExecOrderActionField" context="_913" access="public" location="f2:3302" file="f2" line="3302" inline="1" artificial="1">
    <Argument type="_6992" location="f2:3302" file="f2" line="3302"/>
  </Constructor>
  <OperatorMethod id="_3038" name="=" returns="_6993" context="_913" access="public" location="f2:3302" file="f2" line="3302" inline="1" artificial="1" mangled="_ZN41CThostFtdcQryExchangeExecOrderActionFieldaSERKS_">
    <Argument type="_6992" location="f2:3302" file="f2" line="3302"/>
  </OperatorMethod>
  <Destructor id="_3039" name="CThostFtdcQryExchangeExecOrderActionField" context="_913" access="public" location="f2:3302" file="f2" line="3302" inline="1" artificial="1"/>
  <Field id="_3040" name="BrokerID" type="_10" context="_914" access="public" location="f2:3318" file="f2" line="3318" offset="0"/>
  <Field id="_3041" name="InvestorID" type="_9" context="_914" access="public" location="f2:3320" file="f2" line="3320" offset="88"/>
  <Field id="_3042" name="InstrumentID" type="_19" context="_914" access="public" location="f2:3322" file="f2" line="3322" offset="192"/>
  <Field id="_3043" name="ExecOrderRef" type="_14" context="_914" access="public" location="f2:3324" file="f2" line="3324" offset="440"/>
